{
  "locationType": "School",
  "accrediting": "Carmel Teacher Training Partnership (CTTP",
  "provider": "Harton Technology School Alliance",
  "subjects": [
    "Computing",
    "Secondary"
  ],
  "name": "Computing",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1D7/285Z",
  "providerCode": "1D7",
  "programmeCode": "285Z",
  "schools": [
    {
      "name": "Main Site",
      "address": "Harton Technology College, Lisle Road, South Shields, NE34 6DL",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Harton Technology College, Lisle Road, South Shields, NE34 6DL",
      "geocode": true,
      "formatted_address": "Lisle Rd, South Shields NE34 6DL, UK",
      "latitude": 54.9757167,
      "longitude": -1.4074263,
      "post_code": "NE34 6DL",
      "city": "Tyne and Wear",
      "route": "Lisle Road",
      "postal_town": "South Shields"
    }
  ],
  "providerAddress": {
    "inst_code": "1D7",
    "addr_1": "Harton Technology College",
    "addr_2": "Lisle Road",
    "addr_3": null,
    "addr_4": "South Shields",
    "postcode": "NE34 6DL",
    "url": "http://www.harton-tc.co.uk",
    "geocode": true,
    "formatted_address": "Lisle Rd, South Shields NE34 6DL, UK",
    "latitude": 54.9757167,
    "longitude": -1.4074263,
    "post_code": "NE34 6DL",
    "city": "Tyne and Wear",
    "route": "Lisle Road",
    "postal_town": "South Shields"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The training you receive will take place at both your host school and the University of Sunderland. You will spend 15 days at the University of Sunderland and will be taught via lectures, seminars, tutorials, project work and group work. Generic training will be at Harton Academy. Work-based learning will be in placement schools where you will be trained in a supportive and aspirational environment. You will complete two teaching placements in contrasting school environments. Your host school will be the school where you spend most of the year and where you will undertake most of your teaching commitments. You will also carry out a second placement of around 25 days in one of our partner schools dependent on your individual needs assessed in the first term.\\r\n\\r\nYou will also have the opportunity to spend two days in two different special schools, thus affording all trainee teachers a comprehensive range of training experiences across all ability and age ranges, irrespective of your subject.\\r\n\\r\nYou will be assigned a Mentor who will be an experienced member of staff from the department you will be working in. You will also have the support of a Professional Tutor who is also an experienced member of the staff at your placement school. All our Mentors and Professional Tutors are fully trained and have extensive experience of mentoring trainee teachers.\\r\n\\r\nYou will be assessed with written work, some of which contributes towards Master's credits. In addition you will be assessed throughout your teaching practice. All School Direct students are assessed against the Teachers’ Standards in order to be recommended for the award of Qualified Teacher Status (QTS). This School Direct (Tuition) Post Graduate Certificate of Education degree awards you Qualified Teacher Status (QTS), which you need to be able to teach in any state maintained school in England and Wales.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Entrants must hold a degree. We will be looking for a second class Honours Degree as the minimum requirement. A 2:1 or better is preferred in all cases; a 2:2 will be accepted with recent and relevant experience.\\r\n\\r\nAll entrants will have attained a minimum grade C in their GCSE (or equivalent) examinations in English and Mathematics.\\r\n\\r\nFor entrants with degrees from overseas please contact NARIC (National Academic Recognition Information Centre)\\r\n",
    "FeeInternational": 10750.0,
    "FinancialSupport": "Financial support for trainee teachers has never been better. You could get up to £30,000 tax-free while you train, either as a bursary or prestigious scholarship – or you could earn a salary of up to £25,000 while you train on a School Direct (salaried) course.\\r\n\\r\nYour eligibility for financial support, and the amount you can expect to receive, will depend on the subject you choose to teach and your degree classification or highest relevant academic qualification.\\r\nIf your degree is not in the subject you wish to teach, you may be eligible for a funded course to increase your subject knowledge before starting your training.\\r\n\\r\nFor more information on student finance, course fees and loans, please visit-\\r\n(https://www.gov.uk/student-finance) or\\r\n(https://getintoteaching.education.gov.uk/bursaries-and-funding)\\r\n",
    "InterviewProcess": "If successful at the application stage, you will be invited for interview. This will involve a half a day spent at one of our partner schools. The day is a rigorous selection process where you will be required to teach a 30-minute observed lesson. There will also be a series of tasks including group and written ones, designed to show off your strengths. You will be told in advance about the content of the lesson and the age group you will be teaching as well as any other relevant information to enable you to demonstrate your skills and qualities. At this early stage, we are looking for applicants to demonstrate their future potential as teachers.",
    "OtherRequirements": "All entrants will go through an enhanced Disclosures and Barring Service (DBS) to ascertain that they have no criminal background preventing them from working with children.\\r\n\\r\nOnce trainees have been offered a place, they must book their skills tests and pass them before the course begins.\\r\n\\r\nAll successful applicants must submit an Occupational Health form. Entrants are required to satisfy interviewers that they possess the physical and mental agility necessary to meet the strenuous demands of teaching. This does not preclude entrants with disabilities from applying who give every indication of becoming competent and valued members of the teaching profession.\\r\n",
    "PersonalQualities": "We are looking for enthusiastic applicants with very good communication skills, the determination to succeed, a commitment to working hard and the ability to work with others. Successful applicants are confident and passionate about teaching and able to contribute to the wider school ethos and community. Training to teach is challenging and rewarding. Developing excellent interpersonal skills will enable trainees to work with groups of young people from diverse backgrounds. We are looking for people who strive to improve and are committed to their own professional development, and who are proactive, independent and team players willing to act upon advice.",
    "HowSchoolPlacementsWork": "You will complete two teaching placements in contrasting school environments. Your host school will be where you spend most of the year and where you will undertake most of your teaching commitments. You will be in your host school from September through to December. You will then carry out a Second Placement of around 25 days in one of our partner schools dependent on your individual needs assessed in the first term and the experiences you have already had from your host placement school. Your second school placement will be from January to February. After you have completed your Second School Placement you will return to your host placement until the end of June. Each Friday will be a training day and take place at Sunderland University, Harton Academy or one of our partnership schools."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "At Harton Teaching School Alliance we are passionate about teaching and this passion will be shared and embedded in a supportive, practical and hands on way with all our trainees. You will receive training so you are confident when taking the next steps into the profession and can take what you have learnt into a fulfilling and successful career. We believe in holding onto tradition whilst embracing innovation and, above all, we pride ourselves in the quality of the training we offer. The best way to learn to teach is to do it, to make mistakes and to learn from them. Harton Teaching School Alliance will allow you to become immersed in school life from the start, but offers you a safety net of the support needed to thrive as a new teacher.\\r\n\\r\nHarton Teaching School Alliance is a partnership of 16 Secondary and Primary schools working in close collaboration with local providers to deliver high quality and innovative teacher training. The Lead School for the Partnership is Harton Academy, an OFSTED ‘Outstanding’ rated school (2013) and successful Teaching School. Harton was one of the first 100 teaching schools in the country.  A distinctive feature of the programme is the focus on carefully staged and appropriately supervised practical classroom experience within two contrasting schools, which is further supported by academic and professional study via central training. \\r\n",
    "TrainWithDisability": "Harton Teaching School Alliance welcomes applications for teacher training from all candidates. Harton Academy hosts a large number of pupils and students with a range of physical impairments and social, emotional and mental health conditions, and can use this expertise to help identify and provide any support agreed for trainees. \\r\n\\r\nHarton benefitted from significant building improvements under the government’s Building Schools for the Future programme and therefore has bespoke infrastructures to suit people of all abilities.  Additionally, Human Resources support is available, as we consider our trainees a member of the staffing team, and would look to make reasonable adjustments as necessary. \\r\n\\r\nBoth of our accredited providers have a Disability Support Team who will be able to provide advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. \\r\n\\r\nIn relation to our partner schools where a school is unsuitable for a particular placement, we would seek to find an appropriate school which can accommodate successfully. Please contact John Gibson on jgibson@hartonacademy.co.uk with any specific disability access requirements.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Our HEI provider for the Secondary School Direct Teacher Training Programme is the University of Sunderland. Sunderland has a well-established reputation for quality provision in education. Research in education at Sunderland has been described as ‘world-leading’ by the latest Research Excellence Framework. The University of Sunderland has risen 38 places in The Guardian League Tables in the last two years – they were the highest climber in 2017 and have risen another eight places this year. The Guardian league tables focus on teaching, student satisfaction and employability; issues that really matter to you, the students.",
        "UcasInstitutionCode": "S84"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "N77"
      }
    ]
  },
  "has_inst": true
}
