{
  "locationType": "School",
  "accrediting": "University College Birmingham",
  "provider": "Wilson Stuart School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1DW/2K27",
  "providerCode": "1DW",
  "programmeCode": "2K27",
  "schools": [
    {
      "name": "Main Site",
      "address": "Perry Common Road, Erdington, Birmingham, B23 7AT",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Perry Common Road, Erdington, Birmingham, B23 7AT",
      "geocode": true,
      "formatted_address": "Perry Common Rd, Birmingham B23 7AU, UK",
      "latitude": 52.5337823,
      "longitude": -1.868722,
      "post_code": "B23 7AU",
      "city": "West Midlands",
      "route": "Perry Common Road",
      "postal_town": "Birmingham"
    }
  ],
  "providerAddress": {
    "inst_code": "1DW",
    "addr_1": "Wilson Stuart School",
    "addr_2": "Perry Common Road",
    "addr_3": "Erdington",
    "addr_4": "Birmingham",
    "postcode": "B23 7AT ",
    "url": "http://www.wilsonstuart.co.uk/schooldirect/",
    "geocode": true,
    "formatted_address": "Perry Common Rd, Birmingham B23 7AT, UK",
    "latitude": 52.5325996,
    "longitude": -1.8686384,
    "post_code": "B23 7AT",
    "city": "West Midlands",
    "route": "Perry Common Road",
    "postal_town": "Birmingham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 8750.0,
    "FeeDetails": "School Direct Tuition fee - The postgraduate fees at University College Birmingham are among the most competitive in the higher education sector. We also run a number of fee waivers and scholarships that can substantially reduce costs. The School direct Tuition fee route is in line with the PGCE and costs £9,250 (discount of £500 if the fee is paid before 5th October). Full access to student funding is available. The UCB finance department are extremely supportive if you contact them.",
    "AboutCourse": "Completing our School Direct Tuition fee route will provide you with a PGCE and QTS. Training teachers will have placements in two different schools within the partnership based on an ABA model this is to support your professional development in different environments. You can choose whether you want to specialise in special educational needs or mainstream. Training teachers will spend 4 days a week within a school which will include observations, team teaching, group teaching and whole class teaching. You will also be given opportunities to meet with specialist staff including external agencies such as physiotherapists, speech and language therapists and educational psychologists. As part of your time in schools you will also receive planning time. The course is an opportunity to “learn on the job” and teaching time will build up over the course of the year. Within school you will have a school based mentor who you will have weekly meeting with to discuss progress and targets, you will also have fortnightly teaching observations to support the improvement of your teaching style. One day a week you will be at university where you will complete the units that enable you to receive the PGCE this will include essays and assignments. A university based mentor will support you with your university study. As part of your 1 day a week you will have access to a range of activities to enhance your teaching style including days out looking at maths and science in the outdoor environment and using the highly resourced catering kitchens at UCB to look at how cooking can enhance the curriculum and life skills. A lead mentor from the programme will oversee your programme to support your professional development. ",
    "CourseLength": "OneYear",
    "Qualifications": "To complete the course you will need to have completed a degree with a classification of 2:2 or higher and gained a C grade or above in English, Maths, Science GCSE.\\r\nYou will also need to pass the QTS skills test in English and Maths before starting the course.",
    "FinancialSupport": "Full access to student funding is available. The UCB finance department are extremely supportive if you contact them.\\r\nFor new students starting a PGCE course in September 2019, University College Birmingham will provide financial support in the form of the ‘The Kick-Start Scheme’. Eligible students will receive credit of up to £800, which can be used on a dedicated website to purchase course-related materials or on certain items within UCB. The great news is, these funds don't need to be paid back \\r\nStudents who progress from a UCB BA/BSc(Hons) course onto the UCB PGCE course without a break in study, will receive a fee waiver £1,130 (in 2018/19). \\r\nIf your household income is £16,190 or less and you are eligible to receive support from Student Finance England you will receive a £1,130 (in 2018/19) discount off your tuition fees. \\r\nAdditional scholarships are available for those with academic or sporting excellence. See UCB website for more details related to funding and tuition fees, https://www.ucb.ac.uk/our-courses/postgraduate/fees-and-scholarships/fees-and-scholarships.aspx\\r\n",
    "InterviewProcess": "The interview process occurs after a successful application. You will be contacted with regard to specific details. The interview is held at Wilson Stuart School and is a full day. An English written task will take place and a maths test. Over the course of the day you will teach a small group of pupils, which can be either a maths or literacy lesson of your choosing (additional information will be forwarded to you about the pupils on acceptance to the interview). Following your teaching you will have a formal interview. You also have a group discussion around a professional school related issue (fictional). Information regarding the issue will be sent out before the interview and you are allowed to take in any prepared notes for this section of the day. ",
    "OtherRequirements": "You will need to complete a DBS application.",
    "PersonalQualities": "Some experience of working with children is preferable. This could be in a range of settings such as before or after school clubs, a Teaching Assistant role or Sports groups .",
    "HowSchoolPlacementsWork": "School direct tuition fee\\r\nTraining teachers will work in two schools. You can request to specialise in mainstream or special educational needs. Your preference in this area has no impact on you gaining a place on the programme, but it does help us allocate appropriate placement schools for you. Placements are spilt 70%:30%. Teachers will be in school A September through until Christmas then with a supported transition process will go to placement B January to Easter then return to your school A for the summer term. You will be in schools for 4 days a week. You will meet with other training teachers at university 1 day a week. Transition between the 2 placements is supported with time to meet mentors, visit schools and meet with colleagues. When placements are decided upon individual circumstances are taken into account such as distance and use of public transport. We try to provide placements that are geographically convenient for you to get to. The course is primary based so therefore you will primarily teach pupils from 5 – 11 years of age. You may be asked to travel to different venues on occasion for specialist opportunities."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Wilson Stuart School is a 5 times consecutive Ofsted Outstanding all age (2 – 25 years) Special School which provides “Outstanding” education for up to 310 pupils and young people who have physical disabilities, and/or complex medical conditions. In our last Ofsted in February 2015, we were graded as outstanding in every single aspect of the inspection. We are a lead school who are partnered with a range of Birmingham based Outstanding/Good special and mainstream schools to provide an invaluable training experience. We work in close partnership with UCB to deliver our teacher training programme delivering School Direct for 5 years. As a training provider we are a small partnership who offers an individualised programme for each of our training teachers. Our employment figures to date after completion of the course has been 100%, many of which are still successfully teaching within the partnership. Retention figures show that those completing School Direct route with our partnership remain in teaching with past candidates going on to complete middle leadership courses. Over 90% of our teachers finish with a teaching grade of Outstanding. To complete the course you will need to have completed a degree with a classification of 2:2 or higher,  c or above in English, Maths, Science GCSE and some experience of working with children; this could be in a range of setting such as before or after school clubs, Teaching Assistant or Sports groups .",
    "TrainWithDisability": "Our partnership specialises in teaching pupils with special educational needs. As an Outstanding school who works with pupils with a range of physical, medical and learning needs we are in a position to offer support and encouragement for all those who endeavour to become outstanding teachers. Many of our schools are fully accessible and can accommodate training teachers who require adapted facilities including ramp access, automatic doors and disabled bathroom facilities. We see training teachers with additional needs as an opportunity to provide role models to our own pupils. We have staff who work with us who have registered disabilities and have used access to work funding to provide additional resources or support where required. \\r\nWe have also worked with young adults at a school for the visually impaired to support work experience opportunities. When attending lectures at UCB you are based within McIntyre house which was built in 2014 and has lift access to all the floors. UCB also has a Disability Advisor who can support with many areas of access to the course. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "University College Birmingham and Wilson Stuart School have worked very closely over several years to provide a bespoke Initial Teacher Education experience, with a large focus on improving the understanding of teachers in the area of Special Educational Need and Disabilities.\\r\nBy only taking a small number of candidates onto the programme, Wilson Stuart School and UCB can provide a highly individualised training experience for every candidate, gaining outstanding results since the beginning of the partnership in 2014.\\r\n",
        "UcasInstitutionCode": "B35"
      }
    ]
  },
  "has_inst": true
}
