{
  "locationType": "University",
  "accrediting": null,
  "provider": "The Bedfordshire Schools Training Partnership",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "B31/V1X1",
  "providerCode": "B31",
  "programmeCode": "V1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "B31",
    "addr_1": "BEST House",
    "addr_2": "Samuel Whitbread Academy",
    "addr_3": "Shefford Rd, Clifton",
    "addr_4": "Beds",
    "postcode": "SG17 5QS",
    "url": "http://www.bedsscitt.org.uk",
    "geocode": true,
    "formatted_address": "Shefford Rd, Clifton, Shefford SG17 5QS, UK",
    "latitude": 52.036607,
    "longitude": -0.317712,
    "post_code": "SG17 5QS",
    "city": "Clifton",
    "route": "Shefford Road",
    "postal_town": "Shefford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary English course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYour tutors are active researchers in matters relating to history education. They are regarded as experts in the field, both nationally and internationally, and have been consulted by a number of national and international organisations, such as the Historical Association, QCA and QCDA, the TDA, Ofqual, the Department for Education and Council of Europe on matters relating to the history curriculum.\\r\n\\r\nYour assignments are designed to help you plan your teaching effectively and imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils. Tutors weave together personal experience, practice and research into challenging but highly practical and relevant sessions.\\r\n\\r\nYou will learn in first-class facilities through a series of practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n*gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Bedfordshire Schools' Training Partnership (Beds SCITT) is a successful long established SCITT offering both Primary and Secondary Initial Teacher Training across Bedford, Luton and rural Central Beds. We work in collaboration with Robert Bloomfield Academy (BEST Teaching School) - appears as Bedfordshire Schools Training Partnership on UCAS - and St Thomas More Catholic School (INSPIRIT Teaching School) offering high quality school based training at over 50 partnership schools. All courses operate over one year and are full time resulting in QTS and academic recognition in the form of a PGCE award (worth 60 Masters Credits) validated by The University of Buckingham.\\r\nTrainees will work with experienced teachers as their mentor and will meet weekly with their subject leader for Subject Application lectures. Professional Studies lectures will also be weekly. These lectures will address the Standards for QTS and Subject Knowledge for Teaching and will involve assessment through assignments.\\r\n\\r\nWhat's in it for you? Why choose us??\\r\nHigh quality school based training alongside qualified teachers; \\r\nExcellent employment prospects and a rewarding career - we employ the vast majority of our trainees in our Partnership schools across Bedfordshire & Hertfordshire;\\r\nA solid framework of support - always someone to talk to; \\r\nPlacement in a school tailored to meet your needs - your situation will always be taken into account.\\r\n",
    "TrainWithDisability": "We have accommodated many trainees over the years with various disabilities and other needs - Dyslexia is one we often come across. With the help of the various disability assessments provided we always have a clear picture of the needs of every individual at the start of their training and can then tailor our lectures to ensure that we address these needs. Being a relatively small provider this is never a problem and we are always available to discuss any issues moving forward. The Office Manager meets every week with trainees when they attend Professional Studies so there is always an opportunity to check well-being.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
