{
  "locationType": "University",
  "accrediting": null,
  "provider": "Loughborough University",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Student finance if you’re eligible",
  "slug": "L79/X9C6",
  "providerCode": "L79",
  "programmeCode": "X9C6",
  "schools": [
    {
      "name": "Main Site",
      "address": "TEU Matthew Arnold, Loughborough University, Epinal Way, Loughborough, LE11 3TU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "TEU Matthew Arnold, Loughborough University, Epinal Way, Loughborough, LE11 3TU",
      "geocode": true,
      "formatted_address": "Epinal Way, Loughborough LE11 3TU, UK",
      "latitude": 52.769227,
      "longitude": -1.224632,
      "post_code": "LE11 3TU",
      "city": "Leicestershire",
      "route": "Epinal Way",
      "postal_town": "Loughborough"
    }
  ],
  "providerAddress": {
    "inst_code": "L79",
    "addr_1": "Loughborough University",
    "addr_2": null,
    "addr_3": "Loughborough",
    "addr_4": "Leicestershire",
    "postcode": "LE11 3TU",
    "url": "http://www.lboro.ac.uk",
    "geocode": true,
    "formatted_address": "Epinal Way, Loughborough LE11 3TU, UK",
    "latitude": 52.769227,
    "longitude": -1.224632,
    "post_code": "LE11 3TU",
    "city": "Leicestershire",
    "route": "Epinal Way",
    "postal_town": "Loughborough"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Physical Education course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of physical education; these staff are supported by expert practitioners from local schools.\\r\n\\r\nOur excellent teaching facilities, including a sports hall and gymnasium with extensive resources and equipment, will provide the setting for your practical teaching.\\r\n\\r\nThe content of the programme is grounded in the evidence-based principles of teaching and learning. You will examine a range of pedagogical approaches to physical education teaching, including workshop-led and informal approaches to learning. Other teaching methods include a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Loughborough University has a strong tradition of teacher education and a history of successfully producing teachers who are in great demand by schools and colleges in the UK and overseas.\\r\n\\r\nOur courses have been highly rated in Ofsted inspections and Loughborough has been assessed as a category 'A' provider, representing 'outstanding' provision, three consecutive times since 2005.  Loughborough University is ranked 2nd in the top ten of higher education institutions in the 'Good Teacher Training Guide 2017' and has been ranked Top 10 for the past five years\\r\n\\r\nThe Loughborough Post-Graduate Certificate in Education course contributes towards half of a masters degree. Individuals wanting to complete the masters degree can do so on a part-time basis during their early teaching career.\\r\n\\r\nIf you are interested in training to teach Physical Education or Mathematics in secondary schools, you will find the information you need to get started on this site.\\r\n\\r\n",
    "TrainWithDisability": "The University encourages the development of an environment in which diversity is valued. An important part of putting this into practice is a commitment to prohibit discrimination on the grounds of disability in all employment matters, to increase employment opportunities for people who have a disability and to ensure that its recruitment and selection processes are fully accessible.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
