{
  "locationType": "School",
  "accrediting": "Kirklees and Calderdale SCITT",
  "provider": "Yorkshire Inclusive Teaching School Alliance",
  "subjects": [
    "French",
    "Languages",
    "Secondary",
    "Spanish"
  ],
  "name": "Modern Languages (French or Spanish)",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1ER/26W2",
  "providerCode": "1ER",
  "programmeCode": "26W2",
  "schools": [
    {
      "name": "Main Site",
      "address": "Hollin Hill Drive, Leeds, LS8 2PW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Hollin Hill Drive, Leeds, LS8 2PW",
      "geocode": true,
      "formatted_address": "Hollin Hill Dr, Leeds LS8 2PW, UK",
      "latitude": 53.8227013,
      "longitude": -1.4956668,
      "post_code": "LS8 2PW",
      "city": "West Yorkshire",
      "route": "Hollin Hill Drive",
      "postal_town": "Leeds"
    }
  ],
  "providerAddress": {
    "inst_code": "1ER",
    "addr_1": "John Jamieson School",
    "addr_2": "Hollin Hill Drive",
    "addr_3": null,
    "addr_4": "Leeds",
    "postcode": "LS8 2PW ",
    "url": "http://www.yorkshire-inclusive.org",
    "geocode": true,
    "formatted_address": "Hollin Hill Dr, Leeds LS8 2PW, UK",
    "latitude": 53.8233116,
    "longitude": -1.4945188,
    "post_code": "LS8 2PW",
    "city": "West Yorkshire",
    "route": "Hollin Hill Drive",
    "postal_town": "Leeds"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "The Kirklees and Calderdale SCITT is a well-established ITT provider working alongside Partnership schools and in association with the University of Huddersfield. \\r\nWe work with Partnership schools across Kirklees and Calderdale which means we can offer a diverse selection of schools and a contrasting experience which supports your learning and development. \\r\n100% of trainees of trainees who qualified in 2017 and seeking employment were employed. \\r\nWe were rated Good in our OFSTED inspection in 2015. \\r\n'Primary and secondary trainees voice high levels of satisfaction with the course, which gives them many and varied opportunities to meet and exceed the teachers' standards.'\\r\nYour training will take place in supportive and aspirational schools which will prepare you to deliver outstanding lessons where pupils male exceptional progress. You will learn the skills to deliver creative, purposeful and challenging lessons. 80% of your time will be spent in schools, the remaining 20% in centre-based training activities designed to support and enhance your school experience. \\r\nYou will be assigned a mentor from your subject or phase and a visiting tutor from the SCITT. Your mentor will be trained to give you accurate and developmental feedback from lesson observations. You will have timetabled weekly mentor meetings. \\r\nFrom the outset expectation is that you will be treated as any member of staff within your host school. Staff meetings, INSET days and Parents Evenings will play an important part in your development. \\r\nYou will be in school from the first day of the programme.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "GCSEs or (YSJU approved equivalent) at Grade C/Grade 4 or above\\r\nGCSE in English Language, Mathematics and Science.\\r\n\\r\nHonours degree 2:1 or above from a United Kingdom higher education institution or equivalent.  2.2 degrees may be considered.\\r\n\\r\nCandidates must pass professional skills tests in Literacy and Numeracy before commencing the course.  http://sta.education.gov.uk/\\r\n\\r\nIt is desirable that you should have at least two weeks relevant and recent (within the last two years) primary classroom experience before you apply. \\r\n\\r\nSuccessful candidates must undertake an enhanced DBS criminal records check and complete a medical questionnaire in order to assess your fitness to teach.  \\r\n",
    "FinancialSupport": "Financial advice can also be sought from Kirklees & Calderdale SCITT by following this link - http://www.kcscitt.com/faqs/",
    "InterviewProcess": "The interview will be in two parts within schools in the partnership \\r\n•\\tThe pupil task and school visit\\r\n•\\tThe written task and formal interview\\r\nIf you would like help with your interview, go to\\r\nhttps://getintoteaching.education.gov.uk/how-to-apply/preparing-for-your-interview \\r\nWe will be holding interviews on a fortnightly basis until we have recruited all our trainees.\\r\nOn the day of the interview please bring with you your passport or driving licence, GCSE certificates, Degree certificate, Professional Skills Tests (if these have been done).  If applying for an Art place please bring a portfolio of your work with you.\\r\nAfter interview - Accept the offer on the UCAS website.  Complete your Professional Skills Tests if not done so already.\\r\nWe will contact you regularly with information.  You will be invited to an induction event in the summer term.\\r\n",
    "PersonalQualities": "You will be able to demonstrate -\\r\n•\\tA high degree of emotional intelligence, the ability to empathise and have a sound understanding of equality and diversity.\\r\n•\\tA real sense of moral purpose and a tireless energy to achieve the best for your pupils.\\r\n•\\tCommitment, resilience and the ability to reflect in order to learn from your own experiences as well as the experiences of others.\\r\n",
    "HowSchoolPlacementsWork": "Starting on the first day of the autumn term, you will be based in your “home” school.  You will be seen as a member of staff, quickly appreciating the workplace and seeing theory put into practice every day.  You will undertake training by staff in your “home” school as well as workshops and other activities with student teachers from across our Alliance of schools.  \\r\n\\r\nWhen you are ready, you will start to take responsibility to deliver parts of lessons on your own. The ITT programme will build your confidence and subject knowledge and give you the necessary skills to become an effective classroom practitioner.  As you become more confident and competent you will take on greater responsibility until you are teaching full lessons.\\r\n\\r\nHow many school placements will there be?\\r\nYou are required to teach in 2 schools during the course of the year.  The first placement (Autumn) and the third placement (Summer) are usually in the same school.  In the Spring term you will spend time teaching in another school.  Our placement strategy is aimed at giving you the best preparation possible for your teaching career.  During the programme you will spend time in a variety of schools and contexts including mainstream schools, special schools, Pupil Referral Units (PRU), and the Medical Needs Teaching Service.\\r\n\\r\nWhat kind of assessments are there for School Direct?\\r\nYou will need to demonstrate that you meet the Teachers’ Standards to achieve QTS.  You will also complete academic assignments in order to achieve a PGCE.  These assignments are focused on your understanding of how children learn, your specialist subject knowledge and your vision for education.  \\r\n\\r\nWhat support will I receive?\\r\nThroughout your year you will be supported by a well-trained mentor, the primary and secondary lead mentors and colleagues from our ITT partners.  \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are training the next generation of outstanding teachers for the Leeds area. We are committed to providing the highest standard of education and we want to recruit student teachers who share the same commitment. Our current cohort of student teachers are training to teach in primary and secondary in both mainstream and special school settings.\\r\n\\r\nWe provide training and placements of the highest quality to deliver a truly bespoke training package. We are committed to helping you develop professionally, well beyond your initial teacher training and Newly Qualified Teacher (NQT) year by means of an extensive programme of Continuing Professional Development (CPD) opportunities – As an Appropriate Body for NQTs we offer our trainees a coherent two year programme of support.\\r\nYou will have - GCSE Grade C or above (or equivalent) in English and Mathematics.   If you are applying for our Primary programme, GCSE Grade C or above (or equivalent) in Science as well.\\r\nA degree from a UK or European Union Higher Education Institution or equivalent qualification, preferably a First Class Honours Degree or a 2.1.  A 2.2 would be considered for applicants with additional experience, expertise or extenuating circumstances.\\r\nExperience of working with children or young people in the recent past; this may include experience leading the local Brownie pack, working as a Teaching Assistant or being employed as an unqualified teacher.",
    "TrainWithDisability": "At Yorkshire Inclusive Teaching School Alliance equality means treating everyone with equal dignity and worth and valuing their particular\\r\ncharacteristics. Equality means that stakeholders will not be discriminated against or treated less favourably because of their:\\r\n* Disability\\r\n* Race\\r\n* Religion, belief or culture\\r\n* Sexual orientation\\r\n* Gender\\r\n* Gender reassignment\\r\n* Pregnancy or maternity\\r\n* Age\\r\nWe welcome our duties under the Equality Act 2010 to eliminate discrimination, advance equality of opportunity and\\r\nfoster good relations in relation to age (as appropriate), disability, ethnicity, gender (including transgender and issues\\r\naround maternity and pregnancy), religion and belief and sexual identity.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Our Alliance of schools is working in partnership with Kirklees & Calderdale SCITT to deliver a year-long, school-based programme of Initial Teacher Training. Validated by Kirklees & Calderdale SCITT and University of Huddersfield. The programme leads to a PGCE with QTS.\\r\n\\r\nPostgraduate Certificate Education (PGCE)\\r\nThe School of Education and Professional Development is pleased to offer an opportunity for Kirklees and Calderdale SCITT trainees to study two Masters level modules during their training year, leading to the award of Postgraduate Certificate in Education, (PGCE (nonQTS) (SCITT))",
        "UcasInstitutionCode": "1WK"
      },
      {
        "Description": "Our Alliance of schools is working in partnership with HART of Yorkshire SCITT to deliver a year-long, school-based programme of Initial Teacher Training.  Validated by HART of Yorkshire SCITT and Northumbria University. The programme leads to a PGCE with QTS.",
        "UcasInstitutionCode": "25C"
      }
    ]
  },
  "has_inst": true
}
