{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Southampton",
  "subjects": [
    "English",
    "Secondary"
  ],
  "name": "English",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "S27/Q3X1",
  "providerCode": "S27",
  "programmeCode": "Q3X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "S27",
    "addr_1": "Highfield",
    "addr_2": null,
    "addr_3": "Southampton",
    "addr_4": null,
    "postcode": "SO17 1BJ",
    "url": "http://www.southampton.ac.uk/education/postgraduate/itt.page",
    "geocode": true,
    "formatted_address": "Highfield, Southampton SO17 3RU, UK",
    "latitude": 50.93261099999999,
    "longitude": -1.390369,
    "post_code": "SO17 3RU",
    "city": "Highfield",
    "route": null,
    "postal_town": "Southampton"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Course introduction\\r\nThe University of Portsmouth's PGCE Initial Teacher Training Secondary in English is a one-year, full-time course for graduates who wish to train as secondary school English teachers. It is run by the University's School of Education and Continuing Studies and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level) or the Postgraduate Certificate in Education (with 60 credits towards a Master's degree). \\r\n\\r\nEnglish is a core subject of the secondary curriculum at Key Stage 3 and 4. English is an engaging and constantly evolving subject in the school curriculum. On the PGCE course you will learn not only about issues related to English teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \\r\n\\r\nCourse aims\\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers' Standards. \\r\n\\r\nMode of study\\r\nThis is a one-year full-time course (36 weeks). \\r\n\\r\nCourse outline\\r\nThe English course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with mentors and other school staff. \\r\n\\r\nThroughout the year you will be engaged in considering a range of subjects including: \\r\n\\r\n*subject knowledge enhancement\\r\n*ICT in the classroom\\r\n*lesson planning\\r\n*classroom management\\r\n*special needs and inclusion\\r\n*assessment\\r\n*creative learning\\r\n\\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school's teaching staff. You will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom. ",
    "CourseLength": "OneYear",
    "Qualifications": "An honours degree in a relevant subject, with approximately 50% English content and a classification of at least 2:1.  GCSE Mathematics and English language at grade C (Grade 4) or above, or equivalent. ",
    "OtherRequirements": "All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. All applicants must pass the National College for Teaching and Leadership's professional skills tests in literacy and numeracy before starting the course.",
    "HowSchoolPlacementsWork": "School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Initial Teacher Education department is a dynamic and thriving community of professional educators and researchers. In AY2017-2018 Southampton Education School was ranked 2nd in the Guardian University League Table.\\r\n\\r\nWhy come to Southampton?\\r\n\\r\n* Our Tutors. In every forum the dedication and commitment of our Tutors is praised. Trainee Teachers rate them extremely highly, External Examiners praise the time and effort that Tutors devote to Trainees and Ofsted recognises the ‘high quality mentoring and support’ offered. \\r\n* Our quality of teaching and our diverse partnerships and placements. Our Tutors are all Teachers. We thrive through continuous professional development – and very much enjoy implementing new research or theories in partnership with Trainee Teachers and the Schools that we work with. Our Partner Schools are key to our success, and the Mentors that we work are experienced, dedicated and enthusiastic. \\r\n* Our commitment to Health and Wellbeing. The health and wellbeing of our Trainee Teachers, and the students that they teach, is central to producing outstanding teachers and happy students who can make progress and succeed.\\r\n* Our scope to personalise and individualise your learning on your Programme. Every Trainee Teacher is unique, and we want each and every trainee to be the very best teacher that they can be. We achieve this by personalising our programmes to suit you.\\r\n* Our commitment to ‘Student Voice’. We actively encourage trainees to work with us to make our courses even better. \\r\n* Employability. Almost 100% of our Trainee Teachers get jobs. \\r\n",
    "TrainWithDisability": "At Southampton we welcome applications from candidates with disabilities and other needs. SEND is a very important element of our training throughout the PGCE, and trainees who have personal experiences of SEND are of real benefit to our programmes, as they bring a wealth of experience.\\r\n\\r\nHow are Trainee Teachers with disabilities and other needs supported?\\r\n\\r\n* Trainees with dyslexia meet together at the start of the course for an informal session, led by a tutor with significant SEND experience. This group is then enabled to support one another throughout the course, with individual, personalised, input from the tutor as required.\\r\n* Trainees with Physical Disabilities are always accommodated as appropriate and a wide variety of modifications are available.  For example, a student with a hearing impairment may be supported by our enabling services, as well as by their Personal Academic Tutor with services such as remote transcription available - we work with individuals to ensure that their needs are met both when in University and when teaching in schools.\\r\n* We recognise that teaching can be stressful. The University offers a variety of services for Trainees who may be suffering from anxiety or depression, for example trainees can access talking therapies via the University Enabling Services. Trainees are also encouraged to make full use of their Personal Academic Tutor.\\r\n* The course team are able to personalise many aspects of the programme, to accommodate need on an individual basis, to enable successful completion of the course.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
