{
  "locationType": "School",
  "accrediting": "Canterbury Christ Church University",
  "provider": "The Westlands School",
  "subjects": [
    "Geography",
    "Secondary"
  ],
  "name": "Geography",
  "financial_support": "Salary",
  "slug": "14H/2297",
  "providerCode": "14H",
  "programmeCode": "2297",
  "schools": [
    {
      "name": "Westlands School",
      "address": "Westlands Avenue, Sittingbourne, Kent, ME10 1PF",
      "code": "H"
    },
    {
      "name": "The North School",
      "address": "Essella Road, Ashford, Kent, TN24 8AL",
      "code": "N"
    },
    {
      "name": "The Sittingbourne Community College",
      "address": "Swanstree Avenue, Sittingbourne, Kent, ME10 4NL",
      "code": "S"
    }
  ],
  "addresses": [
    {
      "address": "Westlands Avenue, Sittingbourne, Kent, ME10 1PF",
      "geocode": true,
      "formatted_address": "Westlands Ave, Sittingbourne ME10 1PG, UK",
      "latitude": 51.34298159999999,
      "longitude": 0.7123008,
      "post_code": "ME10 1PG",
      "city": "Kent",
      "route": "Westlands Avenue",
      "postal_town": "Sittingbourne"
    },
    {
      "address": "Essella Road, Ashford, Kent, TN24 8AL",
      "geocode": true,
      "formatted_address": "Essella Rd, Ashford TN24 8AL, UK",
      "latitude": 51.1438645,
      "longitude": 0.8880334,
      "post_code": "TN24 8AL",
      "city": "Kent",
      "route": "Essella Road",
      "postal_town": "Ashford"
    },
    {
      "address": "Swanstree Avenue, Sittingbourne, Kent, ME10 4NL",
      "geocode": true,
      "formatted_address": "Swanstree Ave, Sittingbourne ME10 4LG, UK",
      "latitude": 51.3334226,
      "longitude": 0.7556423,
      "post_code": "ME10 4LG",
      "city": "Kent",
      "route": "Swanstree Avenue",
      "postal_town": "Sittingbourne"
    }
  ],
  "providerAddress": {
    "inst_code": "14H",
    "addr_1": "Westlands Avenue",
    "addr_2": "Sittingbourne",
    "addr_3": null,
    "addr_4": "Kent",
    "postcode": "ME10 1PF",
    "url": "http://www.swaleacademiestrust.org.uk",
    "geocode": true,
    "formatted_address": "Westlands Ave, Sittingbourne ME10 1PG, UK",
    "latitude": 51.34315669999999,
    "longitude": 0.7129192,
    "post_code": "ME10 1PG",
    "city": "Kent",
    "route": "Westlands Avenue",
    "postal_town": "Sittingbourne"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "Professional Learning Days\\r\n\\r\nThese are whole day sessions where the basics of teaching and learning are presented and good practice shared.  You will be trained at our dedicated training facility and the training will be delivered by our own expert staff who have been accredited by Christ Church University.  These sessions cover topics such as Lesson Planning, Behaviour Management, AEN and Inclusion and Theories of Learning.\\r\n\\r\nTrainees will also attend fifteen additional Subject Days, delivered at Canterbury Christ Church University.\\r\n\\r\n\\r\nPedagogy in Practice\\r\n\\r\nThese are weekly Monday am or pm Professional Studies sessions where the theories presented during the Professional Learning Days are put into practice.\\r\n\\r\n",
    "CourseLength": "OneYear",
    "SalaryDetails": "Trainees will be paid on Unqualified Teachers' Pay Scale, Point 1.  \\r\n\\r\nAll trainees will work towards Qualified Teacher Status (QTS) which is funded by the employing school.\\r\n\\r\nThere is further opportunity to undertake Post Graduate Certificate in Education (PGCE) with Masters Credits.  This will be funded by the trainee.\\r\n\\r\nAll of our pathways are accredited by Canterbury Christ Church University.\\r\n\\r\n",
    "Qualifications": "Degree:  Minimum Lower Second\\r\nYou should be a graduate, preferably with a 1st or a 2:1, although we are willing to consider applicants who have a 2:2 who can demonstrate a real aptitude for teaching.  You should have a degree in which the majority of the content was based on the subject for which you are applying.\\r\n\\r\nGCSE:  You will need at least a Grade C or equivalent in GCSE English and maths.\\r\n\\r\nOther Requirements: Professional Skills Tests in Literacy and Numeracy must be completed within 6 weeks of successful interview, if not before.",
    "InterviewProcess": "Westlands School is the lead school within the Trust and will be co-ordinating the recruitment process.  Applicants for positions at other schools within the Trust will be given the opportunity to visit the relevant school.\\r\n\\r\nA rigorous selection procedure is in place.  This will involve a full day spent at the school.  Applicants are required to undertake a number of tasks during the day including:\\r\n\\r\n* an introduction to School Direct within the Trust\\r\n* tour of the school(s)\\r\n* a meet the pupils session\\r\n* brief literacy and numeracy tests if Skills Tests have not already  been successfully completed\\r\n* a delivery of short subject based task to a group of pupils\\r\n* formal interview\\r\n\\r\nAll offers will be ratified by and made through Canterbury Christ Church University.",
    "PersonalQualities": "Our trainees will: \\r\n\\r\n*have a real desire to work with young people and help them realise their potential\\r\n*be enthusiastic about their subject\\r\n*have high expectations\\r\n*have effective written and oral communication skills\\r\n*be dedicated and prepared to work hard\\r\n*be resilient\\r\n*be a team player\\r\n*be able to work independently\\r\n*realise the importance of meeting deadlines\\r\n*be open to new ideas\\r\n*be willing to review personal progress\\r\n*be able to reflect on strengths and areas for development\\r\n*have excellent organisational skills\\r\n*have a sense of professionalism.\\r\n",
    "HowSchoolPlacementsWork": "Wider Professional Practice\\r\n\\r\nA four week contrasting placement will be arranged for each trainee.  In addition, an alternative stage placement of one week's duration is arranged. \\r\n\\r\nVisits to other schools can be set up to provide wider experience.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We have a long history of training teachers within the Trust and have developed a rigorous and robust training programme.  This consists of a combination of practical and theoretical elements delivered by a dedicated team at the Trust Training Centre. \\r\n\\r\nWe recognise that trainees come with varying levels of previous school experience and our training is therefore tailored to the individual.  Those who have plenty of relevant classroom experience have the opportunity to begin teaching whole classes early on in the programme.  Those with less relevant experience will receive more guidance at the beginning, to build a firm foundation on which to base their classroom practice.\\r\n\\r\nOur belief in the importance of trainees having sufficient time to work with more experienced staff means our aim is to make School Direct appointments supernumerary.  This provides time for trainees to work closely with mentors and others to develop high level skills before being given full responsibility for classes.\\r\n\\r\nSwale Academies Trust is committed to safeguarding and promoting the welfare of children and young people and expects all staff to share this commitment.  School Direct positions are subject to an enhanced DBS check.",
    "TrainWithDisability": "Over recent years, schools and academies have (in line with other institutions and public bodies) been working towards an improved understanding of the diverse nature of their communities.  Much of the work is in response to new legislation that places an increased duty on schools, academies and other settings to tackle radicalisation and to establish a positive ethos of British Values. Legislation requires schools and academies both to eliminate direct or indirect discrimination, victimisation or harassment and to promote equalities for students, staff and others who use their facilities.\\r\n\\r\nIn our Trust we work to ensure that there is equality of opportunity for all members of our community who hold a range of protected characteristics as defined by the Equality Act 2010, as well as having regard to other factors which have the potential to cause inequality, such as, socio-economic factors.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Please visit the relevant University website for further details on course content:  (http://www.canterbury.ac.uk)",
        "UcasInstitutionCode": "C10"
      },
      {
        "Description": "Please visit the relevant University website for further details on course content:  (http://www.brighton.ac.uk)",
        "UcasInstitutionCode": "B72"
      },
      {
        "Description": "Please visit the relevant University website for further details on course content:  (http://www.sussex.ac.uk)",
        "UcasInstitutionCode": "S90"
      }
    ]
  },
  "has_inst": true
}
