{
  "locationType": "School",
  "accrediting": "University of East London",
  "provider": "ELEYSP",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Salary",
  "slug": "25U/2W2L",
  "providerCode": "25U",
  "programmeCode": "2W2L",
  "schools": [
    {
      "name": "Main Site",
      "address": "Sheringham Avenue, London, E12 5PB",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Sheringham Avenue, London, E12 5PB",
      "geocode": true,
      "formatted_address": "Sheringham Ave, London E12 5PA, UK",
      "latitude": 51.5535496,
      "longitude": 0.06005919999999999,
      "post_code": "E12 5PA",
      "city": "Greater London",
      "route": "Sheringham Avenue",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "25U",
    "addr_1": "East London Early Years and Schools",
    "addr_2": "Partnership, Elkington road,",
    "addr_3": "Plaistow",
    "addr_4": "London",
    "postcode": "E13 8LH ",
    "url": "http://www.eleysp.co.uk",
    "geocode": true,
    "formatted_address": "Kaizen Primary School, Elkington Rd, London E13 8LH, UK",
    "latitude": 51.521288,
    "longitude": 0.0270019,
    "post_code": "E13 8LH",
    "city": "Greater London",
    "route": "Elkington Road",
    "postal_town": "London"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "You will learn how to be a nursery or primary class teacher. By the end of the year, you will understand how to teach the entire primary curriculum to a class of 30 pupils, and be confident and competent in doing so.\\r\n\\r\nYou will leave the course with outstanding subject knowledge across the curriculum. You will have an understanding of how to plan and deliver engaging and motivating lessons and how to support your pupils’ progress.\\r\n\\r\nYou will learn how to identify the strength and needs of your pupils and make sure that everyone in your class is included and challenged.\\r\n\\r\nYou will spend 4/5 days of your week, from day one, in your sponsor (employing) school, meaning you get to build relationships with your colleagues and pupils immediately.\\r\n\\r\nThe other 1/5 days of your week is spent at the university, where you will build your academic and theoretical knowledge and understanding about the key components of becoming a primary teacher. \\r\n\\r\nThis will include sessions such as:\\r\n*Theories of learning and child development;\\r\n*Managing behaviour;\\r\n*Addressing different learning needs;\\r\n*Developing pupils' understanding of foundation subjects, English and maths;\\r\n*Embedding assessment;\\r\n*The pastoral role; \\r\n*Working with families;\\r\n*Developing resilient learners.\\r\n\\r\nYou will also be given the chance to  focus your learning weekly on Early Years practice or Special Educational Needs and inclusion.\\r\n\\r\nIn addition you will also take a primary module, Developing Understanding and Skills in English and Mathematics, assessed by a Task Portfolio (2,250 words equivalent), which you will complete in the summer term.\\r\n\\r\nYou will be assessed throughout the year, through mentor observations and progress meetings and you will gather evidence in an e-portfolio to meet the Teacher Standards, which take into account your practice and professionalism. The Task Portfolio described above is also part of your overall assessment.\\r\n\\r\n You will complete a complementary placement during the year in a different school and key stage, all the while being mentored and supported by experienced teachers and tutors.",
    "CourseLength": "OneYear",
    "SalaryDetails": "You will be employed at your sponsor (employing) school as an unqualified teacher (scale 0.1).\\r\n\\r\nThere are no fees for this course.",
    "Qualifications": "You will need a GCSE C or 4 or above (or an equivalence exam) in English, maths and science.\\r\n\\r\nYour degree will need to be graded at 2:2 Honours or above.\\r\n\\r\nIf you do not have the required GCSE qualifications or grades you can sit an A Star Teacher’s Equivalency Exam. Further information is available at (https://www.astarteachers.co.uk/equivalency-and-professional-development/booking) \\r\n\\r\nIf you who hold a degree or qualifications from a non-UK institution, you must verify their equivalence through the National Recognition Information Centre for the UK (NARIC). \\r\nPlease go to (http://www.naric.org.uk) for information on their services.\\r\n",
    "InterviewProcess": "Your application will be short listed, and you may be invited to interview at our lead school, Kaizen primary school.\\r\n\\r\nThe interview process will consist of an observation, an individual interview with leaders from across our Alliance of schools, a numeracy and a literacy test (equivalent to Year 6 outcomes), an opportunity for you to ask any questions and possibly a group task and will last for the duration of a morning.\\r\n\\r\nFor the observation you will be asked to work with a small group of children from any year group, including Nursery and Reception, (excluding year 6). \\r\n\\r\nYour session should be based on a plan you have prepared using a book, poem, maths activity etc. \\r\n",
    "OtherRequirements": "We follow Safer Recruitment guidance and your employing school will carry out a criminal record check in line with obtaining a DBS certificate.",
    "PersonalQualities": "We are looking for reflective, hard-working and committed people who are ready to listen and learn.\\r\n\\r\nYou must have some experience of working with children, preferably in a nursery or a school.",
    "HowSchoolPlacementsWork": "It is highly recommended that you have a sponsor school before you apply, but we can also find employing school placements from one of our 20+ Alliance schools in Newham, Tower Hamlets and Hackney.\\r\n\\r\nYou will spend 4/5 days of your week in your sponsor (employing) school from September to December. You will then move to your second complementary placement school for 4/5 days of your week until February.\\r\nAfter this placement, you will return to your sponsor school for 4/5 days of your week until the end of the year.\\r\n\\r\nYou will be teaching, not helping, on your placements. You may start off working with groups of pupils but your role is not to help the teacher – it is to support and increase the pupils’ learning. You will gradually increase your teacher time as your competence and confidence grow.\\r\n\\r\nThis School Direct Salaried programme offers you the chance to teach children aged from 3 -11, resulting in Primary QTS."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are delighted you are interested in teacher training with the East London Early Years and Schools Partnership.\\r\n\\r\nWe think that every child deserves a great education, and in particular, we must do everything possible to give children living in social and economic disadvantage the best start in life and learning. This means that we want to find the very best people and help them to become effective and inspirational teachers. \\r\n\\r\nPeople like you.\\r\n\\r\nOur specialisms include:\\r\n* learning about the Early Years, in outstanding Nursery Schools as well as in Primary Schools\\r\n* Working with a wide range of local Primary schools (all rated outstanding or good by Ofsted)\\r\n* Developing trainees' understanding of how to make the best curriculum for all, regardless of ability.\\r\n\\r\nAnd because we work so well as an alliance of schools, we're able to draw on high levels of expertise to ensure that you get the personalised support, mentoring and input you need so that you can be the very best teacher you can be.\\r\n\\r\nWe also offer the unique opportunity to spend time in a contrasting location - the Lake District - observing practice and taking part in teaching in our partner school there.\\r\n\\r\nWe look forward to welcoming you to East London.\\r\n",
    "TrainWithDisability": "Our schools aim to meet their obligations under the public sector equality duty by having due regard to the need to:\\r\n\\r\n*Eliminate discrimination and other conduct that is prohibited by the Equality Act 2010;\\r\n*Advance equality of opportunity between people who share a protected characteristic and people who do not share it;\\r\n*Foster good relations across all characteristics - between people who share a protected characteristic and people who do not share it.\\r\n\\r\nHigh quality tutoring by the University of East London ensures that individual needs are identified and communicated and structured plans are put into place, quickly and effectively. This means that trainees' needs are well met and responded to in a timely way. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We're proud to work in partnership with the University of East London, who have an excellent reputation for preparing teachers to work in multi-ethnic and multilingual urban schools and successfully train up to 600 teachers every year.\\r\n\\r\nYou'll benefit from the excellent core learning from The University of East London, delivered by experienced and expert practitioners, as well as individual tutoring to ensure you stay on track and get the support you need to succeed.\\r\n",
        "UcasInstitutionCode": "E28"
      }
    ]
  },
  "has_inst": true
}
