{
  "locationType": "School",
  "accrediting": "George Abbot SCITT",
  "provider": "George Abbot SCITT",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Student finance if you’re eligible",
  "slug": "G12/C66X",
  "providerCode": "G12",
  "programmeCode": "C66X",
  "schools": [
    {
      "name": "Main site",
      "address": "Woodruff Avenue, Burpham, Guildford, GU1 1XX",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Woodruff Avenue, Burpham, Guildford, GU1 1XX",
      "geocode": true,
      "formatted_address": "Woodruff Ave, Guildford GU1 1XS, UK",
      "latitude": 51.2542635,
      "longitude": -0.546604,
      "post_code": "GU1 1XS",
      "city": "Surrey",
      "route": "Woodruff Avenue",
      "postal_town": "Guildford"
    }
  ],
  "providerAddress": {
    "inst_code": "G12",
    "addr_1": "Woodruff Avenue",
    "addr_2": "Burpham",
    "addr_3": "Guildford",
    "addr_4": "Surrey",
    "postcode": "GU1 1XX ",
    "url": "http://www.georgeabbottraining.surrey.sch.uk",
    "geocode": true,
    "formatted_address": "Woodruff Ave, Guildford GU1 1XS, UK",
    "latitude": 51.2542635,
    "longitude": -0.546604,
    "post_code": "GU1 1XS",
    "city": "Surrey",
    "route": "Woodruff Avenue",
    "postal_town": "Guildford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "The PGCE programme in your chosen subject will give you the necessary knowledge and skills to meet the standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits).\\r\n\\r\nThe programme covers a wide range of topics that you will need to address as a teacher. These include planning for learning, classroom management, inclusion, assessment, subject work, wider school issues and other important topics. The topics are not just covered once in the course but are regularly revisited during the year in various contexts. This approach allows continual reinforcement and deepening of your knowledge and understanding of teaching and learning.\\r\n\\r\nThe course duration is approximately 180 days. You will spend approximately 60 days during the course of the training, mostly outside of the classroom on many aspects of teaching. Most of these 60 days of training will be at the Lancaster campus. A number of days will be subject specific, designed to develop your knowledge of how to teach your subject known as Pedagogy for Learning (PFL) days. On these days the both School Direct and university based students are taught together. The other 120 days will be in two contrasting school placements. For these placements you will be supported by both school and university colleagues to meet the standards for QTS. \\r\n\\r\nThe course is assessed in two different ways. The placement module for the QTS element is assessed by school and university colleagues on a pass/ fail basis using a widely recognised trainee teacher assessment matrix. You will also prepare an electronic portfolio to submit as evidence of meeting the QTS standards. The two modules connected to the PGCE are assessed by the submission of four written assignments on teaching and learning in your subject and wider educational issues. The four written assignments are spread across the year to try to even out workload and two of them are formative to help develop your Masters level writing towards the two summative assignments.\\r\n\\r\nThe University of Cumbria and its legacy institutions, St Martins and Charlotte Mason colleges, have a long history of training successful teachers and an excellent record in producing good and outstanding teachers.\\r\n\\r\nFor information:\\r\n(https://www.cumbria.ac.uk/study/courses/postgraduate/secondary-education-with-qts-physical-education-pgce/)\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "George Abbot SCITT is a highly respected and well-established provider delivering school-based Initial Teacher Training (ITT) through Teach Surrey.  Teach Surrey represents an alliance of Teaching Schools and their associated partner schools. \\r\n\\r\nWe offer Primary and Secondary teacher training on a full-time basis, all with a core focus on training all teachers to teach all children, and this includes offering trainees the option to specialise in Special Educational Needs (SEN).\\r\n\\r\nWith 17 years’ experience leading ITT, we offer practical training in a variety of schools, with experienced practitioners to mentor you through the course.  We have unrivalled experience in Surrey having trained over 500 teachers, and our provision across the partnership is rated as “Outstanding” by Ofsted, as well as by our past trainees.  \\r\n\\r\nWe are small enough to really get to know our trainees and to be able to tailor our training to meet the needs of everyone on our programme.  We are also proud to say that we have a 100% employment record at the end of our training programmes.\\r\n\\r\nGeorge Abbot SCITT has always led the way in teacher training and we work very closely with the DfE. In 2012, we were the first ITT provider in the UK to pilot the School Direct ITT programme. In 2013, alongside an educational charity, we created an entirely new route into teaching for candidates with PhDs, called Researchers in Schools. We were also selected to pilot a 2 year, part-time school-based training route for shortage subjects in September 2016.",
    "TrainWithDisability": "George Abbot SCITT has trained teachers with a variety of individual needs.  We are able to adjust our programme accordingly.\\r\n\\r\nShould you be invited to interview, you will be asked to disclose any needs you may have so that we can support you appropriately.\\r\n\\r\nIf you would like to discuss how we could support you during training with your needs, please do get in touch on 01483 888048.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
