{
  "locationType": "School",
  "accrediting": "King's College London (University of London",
  "provider": "Beal High School",
  "subjects": [
    "Computing",
    "Secondary"
  ],
  "name": "Computing",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1NA/24BH",
  "providerCode": "1NA",
  "programmeCode": "24BH",
  "schools": [
    {
      "name": "Main Site",
      "address": "Beal High School, Woodford Bridge Road, Ilford, Essex, IG4 5LP",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Beal High School, Woodford Bridge Road, Ilford, Essex, IG4 5LP",
      "geocode": true,
      "formatted_address": "Essex, UK",
      "latitude": 51.7343313,
      "longitude": 0.4690888,
      "post_code": null,
      "city": "Essex",
      "route": null
    }
  ],
  "providerAddress": {
    "inst_code": "1NA",
    "addr_1": "Beal High School",
    "addr_2": "Woodford Bridge Road",
    "addr_3": null,
    "addr_4": "Ilford",
    "postcode": "IG4 5LP ",
    "url": "http://nelta.co.uk",
    "geocode": true,
    "formatted_address": "Woodford Bridge Road, London IG4 5LP, UK",
    "latitude": 51.586046,
    "longitude": 0.051729,
    "post_code": "IG4 5LP",
    "city": "Greater London",
    "route": "Woodford Bridge Road",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2018 student survey, 92% of trainees rated the quality of their training as very good or good. \\r\n\\r\nThe PGCE Computing at King's trains Computing professionals and graduates to become effective teachers of Computing in secondary schools. The PGCE Computing programme examines in detail the specifications and expectations for Computing in UK secondary schools including GCSE and A-Level courses.\\r\n\\r\nLearning to be a teacher of Computing involves:\\r\n\\r\n-learning about teaching the Computing knowledge, skills and processes as laid down in the National Curriculum and examination specifications for Computing, Computer Science and Information Technology.\\r\n-learning how to incorporate computational thinking into other subject areas in schools.\\r\n\\r\nA distinctive feature of the King's Computing programme is the emphasis on learning through critical reflection and discussion with colleagues. In the same way that you will encouraged to make your students think when they are analysing computing-based issues and problems, so staff at King's are keen for you to apply your developing understanding of teaching to help you think about your own practice.\\r\n\\r\nAt King’s we are at the forefront of research into computing education in schools, and this research impacts on the teaching in the programme. We also co-run the Computing At School (CAS) Regional Centre for London, running many professional development and networking events for teachers of Computing. Our PGCE students can get involved in all these activities.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "A degree with a minimum 2.2 that meets at least one of the following criteria:\\r\n-a degree in Computing, Computer Science or IT\\r\n-a degree that includes significant elements of Computing, Computer Science or IT\\r\n-a degree and additional courses that, considered together, are equivalent to Computing/IT degree-level courses. \\r\n -a degree and significant work-based experience and training in Computing/IT at degree-level. \\r\n -a higher degree containing a range of Computing or IT.\\r\n\\r\nAll applicants must possess a grade C/ grade 4 in GCSE English and Maths (or equivalent).\\r\n",
    "FeeInternational": 19320.0,
    "InterviewProcess": "In addition to meeting the shortlisting requirements, you must demonstrate the following if you are to be offered a place:\\r\n\\r\n-conceptual understanding of some school Computing\\r\n-Computing knowledge of an appropriate level\\r\n-ability to think and reason clearly\\r\n-clarity and accuracy of written and spoken communication\\r\n-successful experience with children or clear potential for this\\r\n-ability to interact with pupils and colleagues\\r\n-strong motivation to teach\\r\n-ability to recognise own shortcomings\\r\n-flexibility of mind and potential necessary to improve\\r\n-ability to present ideas clearly and at an appropriate level\\r\n\\r\nIf you are shortlisted you will be invited to a group interview.  This process will take half a day and is designed to:\\r\n\\r\n-enable you to demonstrate your potential for teaching Computing\\r\n-help you to decide whether Computing teaching is the right career for you.\\r\n\\r\nDuring the interview process you will demonstrate your potential for teaching Computing through:\\r\n-subject knowledge test (including questions on algorithms and programming)\\r\n-oral answers during individual interview\\r\n-a brief introduction to a lesson which you prepare at the interview and present to the rest of the interview group.\\r\n",
    "OtherRequirements": "All applicants for teacher training programmes must pass the Department for Education’s Literacy and Numeracy Skills Tests prior to commencing their teacher training course.\\r\n\\r\nThe Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\\r\n",
    "PersonalQualities": "Personal qualities we look for include:\\r\n\\r\n-Ability to engage interest and communicate your own enthusiasm for Computer Science\\r\n-Commitment to working with young people\\r\n-Ability to explain ideas clearly and to think on your feet\\r\n-Evidence of good interpersonal skills\\r\n-Awareness of current educational issues\\r\n",
    "HowSchoolPlacementsWork": "You will have two different school placements during the course. Both placements will be at one of the lead school's (Beal High School) partner schools located in the London Borough of Redbridge.\\r\n\\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "North East London Teaching Alliance (NELTA) is a large teaching school alliance of 20 schools. Beal High School is the lead school.\\r\n\\r\nWe are passionate about developing the next generation of teachers and school leaders. Teachers and leaders who will ensure an outstanding educational future for all pupils irrespective of background or ability. \\r\n\\r\nWorking with our alliance you can expect:\\r\n* Guidance from an experienced school based mentor and provider tutor\\r\n* Very well established support programmes\\r\n* Access to a wide network of schools including community secondary, primary, independent, grammar and special education\\r\n* Professional development opportunities beyond your training year focused on outstanding teaching and leadership\\r\n\\r\nNELTA, which spans Barking and Dagenham, Waltham Forest, Redbridge, Newham and beyond, we offer opportunities to work in a range of different socio-economic areas. Working in a partnership which includes independent schools, boys' and girls' grammar schools, faith schools, comprehensive schools and special schools means you will have access to a broad range of training experiences which will give you the opportunity to you develop your practice in a variety of different settings.\\r\n\\r\nWe offer teacher training places for both the tuition fee and salaried routes to Qualified Teacher Status. \\r\nFor tuition fee routes routes we work with King’s College London, UCL and NELTA as our accredited providers.\\r\nFor our salaried route the accredited provider is NELTA (the operating name of teacher training provided by the Beacon Multi-Academy Trust)\\r\n",
    "TrainWithDisability": "We are committed to supporting equal opportunities and disability access.\\r\n\\r\nWe have accommodated trainees in the past with a range of disabilities including mental health conditions, dyslexia and physical impairments.\\r\n\\r\nDisability access in schools varies according to the specific training location. Please check with the relevant accredited provider or email us to discuss your needs [NELTA](admin@nelta.co.uk).\\r\n\\r\n\\r\nAt UCL School Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information here:-\\r\n[UCL Student Support](https://www.ucl.ac.uk/students/disability-support)\\r\n\\r\n\\r\nKing's offer information, advice and guidance to current and prospective disabled students about support that may help them to engage with their studies. When we refer to the term “disability” we also include long-term medical or mental health conditions and Specific Learning Difficulties (SpLDs).  \\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "UCL Institute of Education is the world’s leading centre for research and teaching in education and related social sciences. You can view UCL’s online teacher training prospectus is here:-\\r\n[Online teacher training prospectus](https://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes)\\r\n\\r\n\\r\n \\r\n",
        "UcasInstitutionCode": "U80"
      },
      {
        "Description": "We are committed to working in partnership with trainees and partner schools to provide highly trained teachers for the local community and beyond.\\r\n\\r\nWeekly contact with other trainees and our programme tutors means that you will always feel fully supported.\\r\n\\r\nThe Ofsted inspection of our initial teacher training provision on 2017 said:\\r\n“Leaders’ ambitious vision for excellence and their aspirations for trainees are of the highest order”\\r\n“The quality of training is outstanding”\\r\n“Trainees are overwhelmingly positive about the quality of mentoring”",
        "UcasInstitutionCode": "251"
      },
      {
        "Description": "Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2018 student survey, 92% of trainees rated the quality of their training as very good or good. ",
        "UcasInstitutionCode": "K60"
      }
    ]
  },
  "has_inst": true
}
