{
  "locationType": "University",
  "accrediting": null,
  "provider": "Brunel University London",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Student finance if you’re eligible",
  "slug": "B84/X9C6",
  "providerCode": "B84",
  "programmeCode": "X9C6",
  "schools": [
    {
      "name": "Main Site",
      "address": "Kingston Lane, Uxbridge, Middlesex, UB8 3PH",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Kingston Lane, Uxbridge, Middlesex, UB8 3PH",
      "geocode": true,
      "formatted_address": "Kingston Ln, Uxbridge UB8 3PN, UK",
      "latitude": 51.5320767,
      "longitude": -0.4665542,
      "post_code": "UB8 3PN",
      "city": "Greater London",
      "route": "Kingston Lane",
      "postal_town": "Uxbridge"
    }
  ],
  "providerAddress": {
    "inst_code": "B84",
    "addr_1": "Brunel University",
    "addr_2": "Kingston Lane",
    "addr_3": "Uxbridge",
    "addr_4": "Middlesex",
    "postcode": "UB8 3PH ",
    "url": "http://www.brunel.ac.uk",
    "geocode": true,
    "formatted_address": "Kingston Ln, London, Uxbridge UB8 3PH, UK",
    "latitude": 51.5328677,
    "longitude": -0.471229,
    "post_code": "UB8 3PH",
    "city": "London",
    "route": "Kingston Lane",
    "postal_town": "Uxbridge"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Physical Education course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of physical education; these staff are supported by expert practitioners from local schools.\\r\n\\r\nOur excellent teaching facilities, including a sports hall and gymnasium with extensive resources and equipment, will provide the setting for your practical teaching.\\r\n\\r\nThe content of the programme is grounded in the evidence-based principles of teaching and learning. You will examine a range of pedagogical approaches to physical education teaching, including workshop-led and informal approaches to learning. Other teaching methods include a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Education at Brunel: Ranked 2nd in London (Guardian League Table 2019) and an outstanding provider of Initial Teacher Education (Ofsted, 2015/2016).\\r\n\\r\nEducation at Brunel offers an unrivalled experience for developing education professional or for your education training.  \\r\n\\r\nWe are one of the longest established Education departments in the country and leading research centre for work in supportive education.  We regularly receive high ratings from the UK's leading benchmarks such as Ofsted.  \\r\n\\r\nAll our education courses have been developed in collaboration with partnership schools and the National College for Teaching and Leadership (NCTL).  This ensures the highest possible quality of provision and relevance in national and school-level priorities in Education.  \\r\n\\r\nYou'll learn in lectures, seminars, and workshops and by modelling classroom practice.  You'll also learn through independent learning, investigation and guided discovery; and through observation, self-evaluation and reflection on teaching practice.  We invite guest speakers to contribute to the taught sessions and arrange school visits, for example, to pupil referral units and special schools.  \\r\n\\r\n100% of our PGCE Secondary Education students secured posts in schools within six months of graduation (Destination of Learners from High Education 2015-2016).  \\r\n\\r\nA Brunel PGCE with recommendation for QTS is a recognised symbol of high-quality Initial Teacher Education.  You'll benefit from our partnerships with educational institutions and local schools.  Many of our students go on to work in our partner schools and many more are employed in schools where they undertook a placement.  ",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
