{
  "locationType": "School",
  "accrediting": null,
  "provider": "Wildern Partnership",
  "subjects": [
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1WH/2LSF",
  "providerCode": "1WH",
  "programmeCode": "2LSF",
  "schools": [
    {
      "name": "Main Site",
      "address": "Wildern Lane, Hedge End, Southampton, Hampshire, SO30 4EJ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Wildern Lane, Hedge End, Southampton, Hampshire, SO30 4EJ",
      "geocode": true,
      "formatted_address": "Wildern Ln, Hedge End, Southampton SO30 4EJ, UK",
      "latitude": 50.9199426,
      "longitude": -1.3044592,
      "post_code": "SO30 4EJ",
      "city": "Hedge End",
      "route": "Wildern Lane",
      "postal_town": "Southampton"
    }
  ],
  "providerAddress": {
    "inst_code": "1WH",
    "addr_1": "Wildern Lane",
    "addr_2": "Hedge End",
    "addr_3": "Southampton",
    "addr_4": "Hampshire",
    "postcode": "SO30 4EJ",
    "url": "http://www.wildernpartnership.co.uk/",
    "geocode": true,
    "formatted_address": "Wildern Ln, Hedge End, Southampton SO30 4EJ, UK",
    "latitude": 50.9180009,
    "longitude": -1.3031926,
    "post_code": "SO30 4EJ",
    "city": "Hedge End",
    "route": "Wildern Lane",
    "postal_town": "Southampton"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "Phase 1 – Scaffold\\r\nSCITT Teaching School Experience (STSE) – (1 weeks Induction plus 8 weeks at lead school and the training centre)\\r\n-\\tOutstanding practice modelled, theory and practice analysed and mediated.\\r\n-\\tIntegrated school / training centre learning experience for general professional studies and subject professional studies.\\r\n-\\tCore group training where Secondary and Primary trainees received phased and combined training by Wildern Partnership Specialists.\\r\n\\r\nPhase 2 – Scaffold and Develop\\r\nSCITT Partnership School A – (7 weeks at lead school and the training centre)\\r\n-\\tTeaching Groups, micro teaching and working with individual children building to whole class planning, teaching and assessment. Individual support from outstanding school based subject leaders and highly trained school based mentors.\\r\n-\\tWorking towards a 40-50% timetable built up at an individual rate.\\r\n-\\tFridays are based at the training centre and other partner institutions for general professional studies.\\r\n-\\tTrainees spend 2 days in alternative key stages and settings. \\r\n\\r\nPhase 3 – Develop \\r\nSecond school experience – (6 weeks in a contrasting setting and the training centre)\\r\n-\\tTheory practice relationships consolidated in a contrasting setting.\\r\n-\\tTeaching classes, groups and individual children, supported and assessed by highly trained school based mentors. Embedding subject knowledge for teaching and supporting pupil progress.\\r\n-\\tFridays are based at the Training Centre for general professional studies.\\r\n\\r\nPhase 4 - Develop and Refine \\r\n(6 weeks at lead school and the training centre)\\r\n-\\tReturn to lead school.\\r\n-\\tBegin to embed practice from second school experience. \\r\n-\\tWorking towards a 50-60% timetable built up at a rate which is individual and managed by curriculum / phase and professional mentor.\\r\n-\\tFridays are based at the training centre and other partner institutions for general professional studies.\\r\n\\r\nPhase 5/6 – Refine and Enrich\\r\nEmployment in Education / Enrichment – (10 weeks at lead school and the training centre)\\r\n-\\tRefine teaching practice to develop autonomy in the classroom, working towards a 60-70% timetable at a rate which is individual and managed by curriculum / phase and professional mentor.\\r\n-\\tSCITT support for local NQTs, School CPD in mentoring / subject knowledge / MA level study / diverse bespoke needs.\\r\n-\\tPreparing for Employment in Education.\\r\n-\\tFridays are based at the Training Centre for general professional studies.\\r\n-\\tFurther completion of teaching time, should any long periods of absence arise throughout the year.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Applicants must hold a degree of a UK university, higher education institution or an acceptable equivalent at 2:2 or above. Their degree should include a minimum content of 50% which is directly related to the subject which they are training to teach. \\r\n\\r\nApplicants must be in possession of appropriate prior qualifications including GCSE grade C or above in English (or English Language) and Mathematics.\\r\n\\r\nApplicants are required to have passed the professional skills tests before the start of the course.\\r\n",
    "InterviewProcess": "Secondary SCITT Tuition Fee applicants – If shortlisted for interview you will be invited to Wildern School where you will; deliver a teaching activity, undertake a Subject Knowledge Audit, complete a written task, take part in a group activity (which is observed) and have an individual formal interview.\\r\n\\r\n",
    "HowSchoolPlacementsWork": "Placement schools are selected following rigorous quality assurance processes of the placement which determines that the placement and mentoring will be of high quality, location; personal circumstances (such as means of transport, childcare); pedagogical and subject knowledge needs of the trainee; trainee’s prior background; commitment of the school and staff to the programme and a high level of professional development. \\r\n\\r\nTrainees will teach the age ranges of 11-16 (Secondary programme) and also gain experience in early years and  further education, as well as special schools, hospital schools and pupil behaviour units. \\r\n\\r\nThe Wildern Partnership SCITT partners with approximately 30 primary and secondary schools in diverse contexts.  \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Wildern Partnership SCITT is an outstanding local teacher training provider, developed through years of collaboration with a diverse range of partnership schools, colleges and universities.\\r\n\\r\nWe offer a school based, collaborative, quality and cross phase training programme which is adapted to your individual needs.\\r\n\\r\nThe full time one-year training programme in both Primary and Secondary commences in September. Successful completion of your training with us will result in QTS, along with a Postgraduate Certificate of Education (PGCE) at Masters level.\\r\n\\r\nIn addition to the academic support available we support your wellbeing through; professional coaching; a high level of pastoral care; subsidised gym membership.\\r\n\\r\n\\r\n",
    "TrainWithDisability": "We pride ourselves on supporting those trainees with specific learning difficulties and disabilities, offering bespoke individualised provision.\\r\n\\r\n\\r\n\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
