{
  "locationType": "School",
  "accrediting": "University of Worcester",
  "provider": "South Bromsgrove Community High School",
  "subjects": [
    "Early years",
    "Primary"
  ],
  "name": "Primary (Early Years)",
  "financial_support": "Student finance if you’re eligible",
  "slug": "19S/34S3",
  "providerCode": "19S",
  "programmeCode": "34S3",
  "schools": [
    {
      "name": "Saint Johns Middle School",
      "address": "Watt Close, Bromsgrove, Worcestershire, B61 7DH",
      "code": "A"
    }
  ],
  "addresses": [
    {
      "address": "Watt Close, Bromsgrove, Worcestershire, B61 7DH",
      "geocode": true,
      "formatted_address": "Watt Cl, Bromsgrove B61 7DH, UK",
      "latitude": 52.3319792,
      "longitude": -2.0665445,
      "post_code": "B61 7DH",
      "city": "Worcestershire",
      "route": "Watt Close",
      "postal_town": "Bromsgrove"
    }
  ],
  "providerAddress": {
    "inst_code": "19S",
    "addr_1": "South Bromsgrove High School",
    "addr_2": "Charford Road",
    "addr_3": "Bromsgrove",
    "addr_4": null,
    "postcode": "B60 3NL ",
    "url": "http://www.southbromsgrove.worcs.sch.uk",
    "geocode": true,
    "formatted_address": "Charford Rd, Bromsgrove B60 3NL, UK",
    "latitude": 52.324718,
    "longitude": -2.061353,
    "post_code": "B60 3NL",
    "city": "Worcestershire",
    "route": "Charford Road",
    "postal_town": "Bromsgrove"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "St John’s Cof E Middle School, part of the South Bromsgrove High Teaching School Alliance, offers a highly successful school-based Primary teacher training programme within vibrant and high-achieving settings. We are able to place trainees in a range of first, middle and primary schools for both main and second placements.\\r\n\\r\nWhat we can offer you:\\r\n\\r\n* An Outstanding lead training school (Ofsted, 2012)\\r\n* An alliance of placement schools committed to high quality training\\r\n* A comprehensive Professional Studies programme with input from leading experts in education\\r\n* Fully trained and dedicated subject mentors\\r\n* Opportunities to broaden your experience of school life through our extensive\\r\n* Extra-Curricular Programme\\r\n* Strong and successful partnership with University of Worcester\\r\n* High quality support in becoming an outstanding, creative and reflective teacher\\r\n* QTS and PGCE qualification, with credits towards Masters Accreditation",
    "CourseLength": "OneYear",
    "Qualifications": "* You'll need to hold an undergraduate degree awarded by a UK higher education provider, or a recognised equivalent qualification.\\r\n\\r\n* You'll  need to have achieved a standard equivalent to grade C/4, or above, in the GCSE examinations in English,  Mathematics and a GCSE science subject examination.\\r\n\\r\n* You'll also need to pass the professional skills tests in numeracy and literacy before you begin your teacher training.",
    "InterviewProcess": "The School Direct Programme is an intensive, school-based training year that demands a full-time commitment. Our selection process is rigorous and thorough and designed to help us decide whether this is the right training programme for you. Interviews will be held at St John’s CofE Middle School in collaboration with our partner First, Primary and Middle Schools and the University of Worcester.\\r\n\\r\nThe interview will involve:\\r\n\\r\n* leading an activity with a group of students;\\r\n* written activity based on some pre-reading;\\r\n* interview.",
    "OtherRequirements": "Prospective trainees will be subject to an Enhanced DBS check. ",
    "PersonalQualities": "What are we looking for – Applicants will need to demonstrate:\\r\n\\r\n* A commitment to the welfare and well-being of young people;\\r\n* Enthusiasm for teaching and an ability to relate to young people;\\r\n* A passion for your subject and for education in general;\\r\n* A willingness to learn through experience and respond to feedback;\\r\n* Some prior school experience is strongly recommended.",
    "HowSchoolPlacementsWork": "Trainees will undertake three School Experience placements.  Your SE1 and SE3 will be based at your main school.  SE2, during the Spring term will be based in a contrasting school.  Your main school will be determined by the South Bromsgrove Teaching School Alliance in collaboration with the Primary Lead at St John's CofE Middle School and the University of Worcester.  \\r\n\\r\nTrainees will spend the majority of the time in school, but will spend one day a week in professional studies. This will take place either at the University of Worcester or one of our alliance schools.\\r\n\\r\nSchool placements will be arranged taking into account the training needs of the individuals and location.  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "South Bromsgrove High Teaching School Alliance provides a high quality, school-based learning opportunity.  ‘South’ is an outstanding school (Ofsted 2012/13) where students enjoy learning in a way which stimulates their imagination and creativity. We maintain high standards of achievement, offer a broad and relevant curriculum, and place great emphasis on high quality learning experiences in lessons.\\r\n\\r\nThe unique aspect of our School Direct training programmes is that delivery is shared across schools from across our wider alliance, who have specific areas of expertise. This allows insight into First, Middle, High and Special Schools and a broader understanding of education and pedagogy.  Our highly successful primary programme is coordinated by St John’s CofE Middle School (judged Outstanding by Ofsted in 2012) and placements are provided in a range of excellent local First, Middle and Primary Schools.  For our secondary training programmes, we can offer placements at South Bromsgrove High Academy or Trinity High School, Redditch (depending on subject).\\r\n\\r\nAll schools in the alliance are highly committed to the training of teachers in a school based environment with access to high quality support from  Higher Education Institutions. South Bromsgrove High Teaching Alliance has experienced subject and professional mentors who are involved in the planning and development of the School Direct courses.  Every trainee is assigned a Professional and Subject Mentor who will be experienced in mentoring, coaching and giving feedback. You will meet with your mentor regularly, to review and set targets related to the teacher standards. ",
    "TrainWithDisability": "South Bromsgrove High Teaching School Alliance recognises that teachers with disabilities make an important contribution to schools, both in the classroom and in shaping the wider culture and ethos. We value diversity and the unique contribution that all staff and trainees bring. We welcome applications from candidates with disabilities or specific educational needs and we are committed to fulfilling our duty to make reasonable adjustments to ensure that all trainees can access all aspects of our training provision. We also work closely with our accredited providers to ensure that support mechanisms are in place for emerging needs of trainees throughout the course.\\r\n\\r\nSpecific support might include:\\r\n\\r\n* Training materials produced in advance or made available online;\\r\n* Specific print requirements, such as large print / coloured paper;   \\r\n* Flexible working hours;\\r\n* Wheelchair access to relevant training / classrooms;\\r\n* Designated quiet working areas.\\r\n\\r\nIt is a trainee's choice whether or not they disclose disabilities to us, but we would encourage you to do so in order that we can support you fully in completing your training.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "2B3"
      },
      {
        "Description": "The University of Worcester has a longstanding reputation of excellent in Initial Teacher Training. Their programmes offer the following:\\r\n\\r\n* Placements in at least two different schools, giving  a breadth of experience and the chance to specialise whilst developing self-reflection, self-criticism and self-confidence\\r\n* Opportunities to develop additional specialisms in areas such as special educational needs, technology enhanced learning, and leadership\\r\n* Extra-curricular opportunities, such as conferences and special projects, to boost employability\\r\n\\r\nThe course lasts for 10 months and there are excellent tax free training bursaries available         \\r\n",
        "UcasInstitutionCode": "W80"
      }
    ]
  },
  "has_inst": true
}
