{
  "locationType": "School",
  "accrediting": "University of Northampton",
  "provider": "Hatton Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1Y7/35C4",
  "providerCode": "1Y7",
  "programmeCode": "35C4",
  "schools": [
    {
      "name": "Main Site",
      "address": "The Pyghtle, Wellingborough, Northamptonshire, NN8 4RP",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "The Pyghtle, Wellingborough, Northamptonshire, NN8 4RP",
      "geocode": true,
      "formatted_address": "The Pyghtle, Wellingborough NN8 4RP, UK",
      "latitude": 52.30872600000001,
      "longitude": -0.6958401,
      "post_code": "NN8 4RP",
      "city": "Northamptonshire",
      "route": "The Pyghtle",
      "postal_town": "Wellingborough"
    }
  ],
  "providerAddress": {
    "inst_code": "1Y7",
    "addr_1": "Sir Christopher Hatton Academy",
    "addr_2": "The Pyghtle",
    "addr_3": "Wellingborough",
    "addr_4": "Northamptonshire",
    "postcode": "NN8 4RP ",
    "url": "http://www.hattonschool.org.uk",
    "geocode": true,
    "formatted_address": "The Pyghtle, Wellingborough NN8 4RP, UK",
    "latitude": 52.308816,
    "longitude": -0.6942452,
    "post_code": "NN8 4RP",
    "city": "Northamptonshire",
    "route": "The Pyghtle",
    "postal_town": "Wellingborough"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Throughout the PGCE Primary programme, you will be enhancing your subject knowledge in conjunction with curriculum and pedagogic knowledge to enable all children to make progress. There are two modules –Teaching, Learning and Assessment and Professional Studies. These are taught at our new Waterside Campus by experienced and expert tutors and aim to address ITT Content, National Curriculum coverage and national priorities in primary education. Over the year, there are blocks of centre-based learning events and four school experiences. There are four assignments, two in each Level 7 module, which are spread over the year. The School Experience Library is an excellent resource offered to students to enhance their use of research and resources to inform practice in the classroom.\\r\nAll students have access to purpose-built teaching and learning resources on the new Waterside Campus allowing them to develop their professional abilities. Facilities include fully equipped rooms; teaching and learning involves using technology, high quality teaching resources, workshops and group work relevant to the variety of educational settings in which students will be working.\\r\nThe University of Northampton is rated as Gold in the Teaching Excellence Framework. ",
    "CourseLength": "OneYear",
    "Qualifications": "You must hold an honours degree from a UK University (or equivalent) and whenever possible the classification should be a 2:1 or First. \\r\nYou will need to have a minimum of 5 GCSE passes at grade C or above/Grade 4 and these must include mathematics, English Language and science. You must have these before applying. If you do not hold the necessary GCSEs, or believe you have a suitable equivalent, please contact Admissions for advice prior to your application.\\r\n",
    "InterviewProcess": "Applicants selected for interview will have an individual interview with a member of staff and a teacher from a partnership school.  This will explore an applicant's commitment to teaching, prior experiences and awareness of current educational contexts.\\r\nIt is the policy of The University of Northampton that candidates should not be prejudiced as a result of any disability and reasonable adjustments will be made to mitigate unfair discrimination. Therefore, all candidates with disabilities are encouraged to identify and/or request support for actual or potential circumstances.\\r\nIn addition to the University interview applicants for a School Direct place will be interviewed at the Lead school if they are successful at the University interview. \\r\n",
    "OtherRequirements": "You must be interviewed, and we will explore your suitability for teaching including undertaking DBS and Disqualification by Association and Prohibition checks.\\r\nYou must pass the professional skills tests in numeracy and literacy prior to enrolling on the programme. If you are offered a place, we will provide sessions to support your preparation for these tests.\\r\n",
    "PersonalQualities": "To be considered for entry for the PGCE, prospective candidates must have the necessary personal attributes, meet the entry requirements required by the Teacher Regulation Agency for schools, provide suitable references to support their academic qualifications and/or their prior experiences.\\r\nPersonal attributes include commitment to working with children and making a difference to their progress, organisation and time management skills, ability to work with others and respond to advice, and use of standard spoken English.\\r\n",
    "HowSchoolPlacementsWork": "The University of Northampton works in partnership with over 150 schools. The PGCE programme includes three school experiences and one self organised experience. The normal pattern is referred to as ABA where the autumn term and summer term are based in school A in the same class and the spring term in school B in the alternative keystage. The self organised experience normally takes place in the spring term. The age ranges are 3-7 or 5-11. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Hatton Teaching School Alliance is founded on the principle of collaboration and an absolute belief that by working together we can improve life chances for all students in all of our schools.\\r\nOur School Direct training course is ideal for trainees who are looking for hands-on in-school training, learning from teachers who deliver lessons every day.  You will be allocated a school-based mentor and will also have a school-based professional tutor, who puts together a comprehensive in-school training programme.\\r\n\\r\nWe have consistently high employment rates, with many of our trainees going on to be employed within the Alliance. The combination of the school based mentoring programme and the University taught modules gives you a competitive advantage when applying for your first teaching position.\\r\n\\r\nYou will feel part of the school community from the start of your training to the end. We ensure you are supported to get Qualified Teacher Status giving you the best possible start to your teaching career. In addition to QTS you will also graduate with a PGCE which includes at least 60 credits towards a Masters degree.\\r\n\\r\nWe believe that we offer high quality training, giving sustained attention to developing the confidence of trainees to become reflective classroom practitioners who are confident subject specialists and all-round professionals. Constant monitoring, training and collaborative work between our partners and the Hatton Teaching School Alliance ensures close co-operation, and an excellent academic and professional partnership, which gives our School Direct student teachers varied but consistently rewarding experiences.",
    "TrainWithDisability": "The Hatton Teaching School Alliance provides a personalised approach to all our trainee teachers, working in partnership with the higher education institutes, specialist teams and with the trainee to ensure that the course is fully accessible to all potential trainees.  We do this by individualising a  support plan which is regularly reviewed and evaluated to account for the evolving nature of a trainee's journey. For example, a previous trainee with dyslexia was successfully supported through their course and by being provided with specialist software, 1:1 discussions with specialist teams to build self-esteem and to achieve their full potential.  Access for all is an integral characteristic of the HTSA as we believe we thrive on diversity. ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "L34"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "N42"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "B22"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "N38"
      }
    ]
  },
  "has_inst": true
}
