{
  "locationType": "School",
  "accrediting": "York St John University",
  "provider": "Calderdale Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "238/2HR7",
  "providerCode": "238",
  "programmeCode": "2HR7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Parkinson Lane, Halifax, West Yorkshire, HX1 3XL",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Parkinson Lane, Halifax, West Yorkshire, HX1 3XL",
      "geocode": true,
      "formatted_address": "Parkinson Ln, Halifax HX1 3XL, UK",
      "latitude": 53.7183144,
      "longitude": -1.8789377,
      "post_code": "HX1 3XL",
      "city": "West Yorkshire",
      "route": "Parkinson Lane",
      "postal_town": "Halifax"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "The tuition fees for the Calderdale Teaching School Alliance programme are £9,250.\\r\n\\r\n\\r\n\\r\n",
    "AboutCourse": "The programme is structured in phases (introductory, developmental and consolidation) and within each phase, you are expected to reflect upon your learning and make effective links with curriculum and pedagogy through relating theory to practice. Academic work will run alongside the school-centred programme of training.  Modules include: Understanding Learning and Teaching and School Experience, Emerging Professional and School Experience, Early Years and Primary Curriculum. \\r\n\\r\nSchool experience will closely complement taught elements of the programme, ensuring that student teachers, through reflection, observation and related tasks,  are able to deepen their pedagogical knowledge. \\r\n\\r\nCalderdale Teaching School Alliance and YSJU staff work closely together to support you in developing your professional practice and provide excellent opportunities for you to engage with professional issues related to both the primary curriculum and wider educational issues.  The provision of training is integrated to ensure that developing professional practice is underpinned by knowledge and understanding of educational theory and current local, national and international research.  All modules will be delivered by a combination of school and University-based staff. \\r\n\\r\nThe education and training programme ensures that you fulfil the requirements of the current teachers’ standards for the award of Qualified Teacher Status. The programme encourages you to engage critically with educational issues to enable you to develop as reflective practitioners who are able to evaluate and adapt your practice to meet the diverse needs of pupils in primary schools.  This is done through a range of learning, teaching and assessment strategies, including active learning and enquiry-based learning, which is considered essential in both modelling effective learning and teaching practice and also for equipping you with the skills that are essential for your continuing development as newly qualified teachers.\\r\n\\r\nOn this programme you are also provided with opportunities to consider how pupils from diverse backgrounds and in challenging contexts can be supported within educational settings. This aspect of education is embedded within your training and you will consider a range of current issues.  \\r\n\\r\nYou are supported throughout the programme to further develop subject knowledge and your understanding of current educational policy and initiatives.  School-based staff are involved in the development of the programme and this collaborative approach is key to the development of the school-centred route; it reflects effective practice on the university-centred route and also supports our quality assurance processes. \\r\n\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "GCSEs or (YSJU approved equivalent) at Grade C/Grade 4 or above\\r\nGCSE in English Language, Mathematics and Science.\\r\n\\r\nHonours degree 2:1 or above from a United Kingdom higher education institution or equivalent.  2.2 degrees may be considered.\\r\n\\r\nCandidates must pass professional skills tests in Literacy and Numeracy before commencing the course.  http://sta.education.gov.uk/\\r\n\\r\nIt is desirable that you should have at least two weeks relevant and recent (within the last two years) primary classroom experience before you apply. \\r\n\\r\nSuccessful candidates must undertake an enhanced DBS criminal records check and complete a medical questionnaire in order to assess your fitness to teach.  \\r\n\\r\n",
    "FinancialSupport": "Financial advice can also be provided by York St John University Funding Advice Team, please use the following e-mail: fundingadvice@yorksj.ac.uk\\r\n",
    "InterviewProcess": "Parkinson Lane Community Primary School is the lead school in the Calderdale Teaching School Alliance and will co-ordinate and participate in the recruitment process with York St John University. Applications will be shortlisted and the selection process takes place in schools with the involvement of school and university staff.\\r\n\\r\nThe recruitment process is rigorous and thorough. It is designed to enable the Calderdale Teaching School Alliance and York St John University assess candidates' suitability for training and to appoint the best candidates for the places available.  \\r\n\\r\nSelection is based on evidence given throughout the application process, for example the  personal statement, references, detailed breakdown of degree content, details of other academic, professional or vocational qualifications, evidence of prior experience and achievements.\\r\n\\r\nAt interview candidates will be required to engage with pupils in delivering a teaching task and undertake other tasks which assess your suitability to teach.  This will also include a formal interview to further explore the candidate's subject knowledge, knowledge of primary education and suitability for training. \\r\n\\r\nAfter the Selection Event, participating staff will collectively consider each candidate's suitability for a place on the course. Candidates will be advised of the outcome as soon as possible.\\r\n",
    "PersonalQualities": "Candidates will have an enthusiasm to teach primary age children and will  have some recent knowledge and understanding of primary education. Successful candidates will also have an ability to organise planning, teaching and classroom management; to reflect on their training experience and develop as critical professionals; to integrate their teaching approach and delivery with cross-curricular initiatives; to express ideas clearly and succinctly using appropriate language; to show personal initiative and work well with all stakeholders; to demonstrate an understanding of wider professional issues within education; to have a love of learning and to communicate this to pupils. \\r\n\\r\n\\r\n",
    "HowSchoolPlacementsWork": "The Calderdale Teaching School Alliance PGCE Primary School Direct programme is full time over the academic year (September - July). This course is run in partnership with York St John University and covers the 3 – 11 age range. Candidates can choose to focus on either the 3 – 7 or 7 – 11 age range. It is a postgraduate qualification which carries recommendation for Qualified Teacher Status (QTS).\\r\n\\r\nThe training programme consists of experience in two schools of the Calderdale Teaching School Alliance combined with taught sessions of subject knowledge, pedagogy and academic assignments at the university and partnership schools. You will have a comprehensive induction prior to commencing the course. \\r\n\\r\nPlacements involve opportunities to observe teaching, to work collaboratively, and to progressively increase the percentage of independent teaching.  We feel it is important for you to feel welcome in the school community and valued as members of staff from the start of your training. You will also attend school meetings e.g. staff meetings, participate in school training days and other professional development events as appropriate. You are given the opportunity to participate in all aspects of school life and the wider school context.\\r\n\\r\nThere is strong support provided by school staff and mentors and university staff.  The Calderdale Teaching School Alliance, partner schools and the university work together to ensure that student teachers become creative educators in a supportive and encouraging environment.\\r\n\\r\nThe key aim of the PGCE primary programme is to deliver a high quality, current and relevant programme of training that equips you with the professional knowledge, understanding, skills and attributes that you need to become outstanding teachers and leaders in our local and national primary schools.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "•\\tOur goal is to ensure that all trainees are good or better teachers by the end of the programme. \\r\n•\\tOur professional learning programme is designed and delivered by Specialist Leaders in Education and in partnership with York St. John’s University.\\r\n•\\tThe programme leads to Qualified Teacher Status (QTS) and a Post-Graduate Certificate of Education (PGCE).\\r\n•\\tWe have a track record of successfully supporting new and talented trainees into the profession through the delivery of excellent school-based innovative teacher training programmes.\\r\n•\\tOur trainees will receive outstanding support from school based and experienced mentors, tutors and coaches.    \\r\n•\\tTrainees will also have ample opportunity to meet, network and share experiences throughout the year.\\r\n•\\tFrom the beginning you will be treated like a member of staff. You will be in school from the first day of the school year so you will feel part of the team.\\r\n•\\tWorking within and across our diverse range of schools, each trainee will be fully equipped with the skills, knowledge and understanding needed to meet the needs of the children they teach and the communities they work within.\\r\n•\\tTrainees will undertake a minimum of two high quality school placements across our partnership.\\r\n•\\tThe Calderdale Teaching School Alliance is a partnership of more than 20 highly successful primary schools in West Yorkshire.\\r\n",
    "TrainWithDisability": "Applicants must satisfy York St John University that they have the intellectual capability for the demands of teaching, that they are physically and mentally fit for teaching and that there is no evidence of a criminal background that should prevent them from working with children or young people. \\r\n\\r\nAll successful applicants will need to satisfy the institution that they meet these criteria through an enhanced DBS check and the submission of a medical health questionnaire to the YSJU Medical Service, who may then require additional reports/examinations to determine fitness to undertake the programme.\\r\n\\r\nApplicants who would benefit from disabled access and reasonable adjustments in order to undertake the programme should indicate on application form in order to be considered for placements at appropriate schools.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "York St John University has been involved in teacher education since 1841 and currently runs primary and secondary training both as university-centred programmes and as school-centred programmes with School Direct Alliance partners.  The YSJU Initial Teacher Education (ITE) partnership works with approximately 450 schools across 15 local authorities in any given academic year.\\r\n\\r\nThe partnership supports and trains student teachers who are intelligent risk takers who base their professional decisions on a deep-rooted understanding of pupil’s learning and effective pedagogies.  \\r\n\\r\nYSJU's Ofsted report (October 2017) rated the primary partnership provision as  'outstanding' for leadership and management and ‘good’ overall.\\r\n\\r\n",
        "UcasInstitutionCode": "Y75"
      }
    ]
  },
  "has_inst": true
}
