{
  "locationType": "School",
  "accrediting": "The Shire Foundation",
  "provider": "Hillborough Junior School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Salary",
  "slug": "18H/2HKY",
  "providerCode": "18H",
  "programmeCode": "2HKY",
  "schools": [
    {
      "name": "Main Site",
      "address": "Hillborough Road, Luton, LU1 5EZ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Hillborough Road, Luton, LU1 5EZ",
      "geocode": true,
      "formatted_address": "Hillborough Rd, Luton LU1 5EY, UK",
      "latitude": 51.8727838,
      "longitude": -0.4232443,
      "post_code": "LU1 5EY",
      "city": "Luton",
      "route": "Hillborough Road",
      "postal_town": "Luton"
    }
  ],
  "providerAddress": {
    "inst_code": "18H",
    "addr_1": "Hillborough Junior School/Shire",
    "addr_2": "Hillborough Road",
    "addr_3": "Luton",
    "addr_4": "Bedfordshire",
    "postcode": "LU1 5EZ ",
    "url": "http://www.hillborough.org/",
    "geocode": true,
    "formatted_address": "Hillborough Rd, Luton LU1 5EZ, UK",
    "latitude": 51.8725642,
    "longitude": -0.4251481,
    "post_code": "LU1 5EZ",
    "city": "Bedford",
    "route": "Hillborough Road",
    "postal_town": "Luton"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "You will be employed as an unqualified teacher for the duration of the training year and as such will complete most of your training within your employing school, following a personalised training plan.\\r\n\\r\nIn the autumn term you will have responsibility for a maximum of 70% whole class teaching each week, with this rising to a maximum of 80% in the spring and summer terms.  In the second half of the spring term, you will complete a 6-week teaching practice in a second school, within a consecutive age phase.\\r\n\\r\nTraining time will be allocated each week.  This will include attending 23 days of centre-based training at The Shire Foundation training venue based at Hillborough Junior School.  These sessions include a focus on curriculum studies (core subject areas and the foundation subjects), alongside professional studies (planning, assessment, behaviour management, working with pupils with special educational needs and/or disabilities and working with pupils with English as an additional language).  Training activities will also take place within the employing school setting, including observations of good practice, discussions with other professionals, INSET training and opportunities to complete reading and research.\\r\n\\r\nYou will be allocated a school based tutor from your school, who will oversee your training and development over the course of the training year.  They will meet with you for at least an hour on a weekly basis, as well as observing your teaching, in collaboration with other members of your school staff. At the end of the training year you will be assessed against the Teachers' Standards through the submission of an evidence portfolio and a final assessment interview.\\r\n\\r\nShire will also nominate a Visiting Tutor who will support and monitor your progress.  They will spend a day each term visiting you within your school.\\r\n\\r\nTrainees following this route may also opt to complete a PGCE qualification alongside QTS.  60 credits at masters level, accredited by the University of Buckingham, will be awarded on the successful completion of 3 academic assignments.  Please note that there is an additional fee for this option.",
    "CourseLength": "OneYear",
    "SalaryDetails": "For the duration of the training year, trainees are employed as an unqualified teacher within their employing school.  The salary is at least point one on the unqualified teacher scale (or equivalent).\\r\n\\r\nThere are no course fees, payable by the trainee, for the School Direct (salaried) QTS route. However, for trainees undertaking the optional PGCE qualification, there will be an additional course fee.  Please contact Shire for details.",
    "Qualifications": "Degree\\r\nApplicants should have an Honours classification of 2:2 or above, or equivalent. \\r\n\\r\nGCSE\\r\nAll trainees must have GCSE Grade C/4 or above in English Language, Maths and Science (or equivalent). Hillborough Junior School will consider applicants who have one of these qualifications pending, but they must all be in place by the date of enrolment of the programme. Recognised equivalency tests are accepted. \\r\n\\r\nOverseas Qualifications\\r\nOverseas equivalent qualifications are accepted if they have been certified through NARIC. Hillborough Junior School will not call any candidate to interview until these qualifications have been verified. \\r\n\\r\n\\r\n\\r\n",
    "InterviewProcess": "The interview process\\r\nInterviews begin in November and continue until all places are filled. \\r\n\\r\nThere is a two stage interview process, both stages of which must be passed for a candidate to be offered a School Direct (Salaried) place. \\r\n\\r\nStage 1 is a day-long interview held at the Shire training centre based at Hillborough Junior School. It is conducted by a team of experienced Hillborough Junior School and Shire staff and includes an assessed presentation which tests oral communication and delivery skills, a test of maths and science subject knowledge and tests of written English, grammar and spelling. During the personal interviews applicants are asked to respond to a range of set questions designed to draw on their experience, ability to articulate their thoughts, opinions and ideas about various aspects of teaching, to assess personal qualities, emotional resilience and the potential to teach. Candidates are asked similar set questions. The interviews are scored according to set criteria and candidates meeting the criteria then proceed to the second stage interview. \\r\n\\r\nStage 2 is based at the potential employing school. This involves an assessment of suitability to teach by an observation of the candidate teaching a lesson in the school. This is then followed by an interview by the Head Teacher and members of the school Senior Management Team. \\r\n\\r\nThe interviews are scored according to set criteria and candidates meeting the criteria will then be offered a place, which may be subject to meeting criteria such as passing the Professional Skills tests. \\r\n",
    "OtherRequirements": "Professional Skills Tests\\r\nLiteracy and Numeracy professional skills tests must be passed within 12 weeks from the date of interview.\\r\n\\r\nSchool Experience\\r\nIt is highly beneficial if candidates for this route have at least 6 months experience of working within a school setting prior to application.  However this aspect is judged on an individual basis.\\r\n\\r\nDisclosure and Barring Service/Medical\\r\nWe are committed to safeguarding the welfare of children. All applicants who are offered a training place will be required to undertake a Disclosure and Barring Check and a medical check prior to the start of their employment in school. \\r\n\\r\n",
    "PersonalQualities": "Command of the English language\\r\nTrainees must demonstrate an ability to communicate clearly and grammatically in spoken and written English.",
    "HowSchoolPlacementsWork": "The Shire Foundation is accredited to award QTS within the 3-11 primary range and we work with nursery, primary, middle and special schools.\\r\nOn an annual basis, our School Direct (salaried) partnership consists of about 25 local schools.  The vast majority of these schools are within the Luton area, but we are also willing to work with any suitable schools within a 30-mile radius of Luton.  In recent years, we have worked with schools in Harpenden, Hemel Hempstead, Leighton Buzzard, Letchworth and Ampthill.\\r\n\\r\nMany candidates who apply for this route, already have a school who is willing to support them through the training year.  If this is not the case you may still apply.  You will be interviewed centrally by Shire/Hillborough Junior School and if you are successful your application will be circulated around prospective employing schools.  If they are interested you will be asked to visit the school and then attend a formal interview.\\r\n\\r\nWe endeavour to organise second school placements within our partnership of schools, but this cannot be guaranteed."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Hillborough Junior School has been judged to be Outstanding by Ofsted, and is the lead school for the Luton First Teaching School Alliance. The School Direct (Salaried) training is accredited by the Shire Foundation which is a well-established (since 1994) school-centred teacher training provider working with  schools (nursery, primary and special), within a 30 mile radius of Luton.  \\r\n\\r\nThis partnership has built up an excellent reputation in teacher training in the local area, and trainees consistently rate the quality of the course and support as very high. We have  a consistently excellent NQT employment rate (100% in recent years), with a high percentage of trainees securing a teaching job within their placement school.\\r\n\\r\nYou will be employed in a school which is approved for training by the Hillborough Junior School/ Shire Foundation Alliance and your school will work in partnership with us to provide your training and support your professional development. \\r\n\\r\n\\r\n\\r\n ",
    "TrainWithDisability": "Accommodation at the Hillborough Junior School base and the partner schools has appropriate disability access. \\r\n\\r\nEach year we work successfully with trainees with disabilities and other needs.  Our personalised approach to training ensures that support and provision is tailored to each trainee's particular needs, in order to facilitate success during all aspects of the training year.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The Shire Foundation is a well established (since 1994), school-centred teacher training provider working with primary, nursery and special schools, mainly within the Luton area. \\r\n\\r\nOfsted (March 2013) judged the provision as Good with many Outstanding features. Our training in mathematics and behaviour management was in particular cited as Outstanding.  Trainee course evaluations demonstrate a very high level of satisfaction.  In 2017-18, all trainees on the School Direct (salaried) course rated the overall quality of their training as at least Good, with 72% rating it as Outstanding.\\r\n\\r\nShire utilises a range of outstanding current primary practitioners to lead training sessions.\\r\n",
        "UcasInstitutionCode": "S25"
      }
    ]
  },
  "has_inst": true
}
