{
  "locationType": "School",
  "accrediting": null,
  "provider": "Carmel Teacher Training Partnership (CTTP)",
  "subjects": [
    "Computing",
    "Secondary"
  ],
  "name": "Computing",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "C23/IX99",
  "providerCode": "C23",
  "programmeCode": "IX99",
  "schools": [
    {
      "name": "Main site",
      "address": "The Headlands, Darlington, DL3 8RW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "The Headlands, Darlington, DL3 8RW",
      "geocode": true,
      "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
      "latitude": 54.5236052,
      "longitude": -1.5836444,
      "post_code": "DL3 8RP",
      "city": "Darlington",
      "route": "The Headlands",
      "postal_town": "Darlington"
    }
  ],
  "providerAddress": {
    "inst_code": "C23",
    "addr_1": "The Headlands",
    "addr_2": "Darlington",
    "addr_3": null,
    "addr_4": "Co. Durham",
    "postcode": "DL3 8RW ",
    "url": "http://www.carmel.org.uk",
    "geocode": true,
    "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
    "latitude": 54.52360299999999,
    "longitude": -1.5825947,
    "post_code": "DL3 8RP",
    "city": "Darlington",
    "route": "The Headlands",
    "postal_town": "Darlington"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Course introduction\\r\nThe University of Portsmouth's PGCE Initial Teacher Training Secondary in Computer Science is a one-year, full-time course for graduates who wish to train as secondary school computer science teachers. It is run by the University's School of Education and Continuing Studies and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level) or the Postgraduate Certificate in Education (with 60 credits towards a Master's degree). The most appropriate route for you can be discussed with the course leader. \\r\n\\r\nOn the PGCE course you will learn not only about issues related to Computer Science teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \\r\n\\r\nCourse aims\\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers' Standards. \\r\n\\r\nMode of study\\r\nThis is a one-year full-time course (36 weeks). \\r\n\\r\nCourse outline\\r\nThe Computer Science course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with mentors and other school staff. \\r\n\\r\nThroughout the year you will be engaged in considering a range of subjects including: \\r\n\\r\n*Subject knowledge enhancement\\r\n*ICT in the classroom\\r\n*Lesson planning\\r\n*Classroom management\\r\n*Research into the pedagogy of computer science.\\r\n*Special needs and inclusion\\r\n*Assessment\\r\n\\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school's teaching staff. You will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom. ",
    "CourseLength": "OneYear",
    "Qualifications": "A good honours degree or equivalent in a relevant subject, ideally with approximately 50% Computer Science content or other relevant experience. GCSE Mathematics and English language at grade C (Grade 4) or above, or equivalent. If in doubt about your qualifications or suitability for the course please contact the course leader for advice. ",
    "OtherRequirements": "All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. All applicants must pass the National College for Teaching and Leadership's professional skills tests in literacy and numeracy before starting the course.",
    "HowSchoolPlacementsWork": "School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Carmel Teacher Training Partnership (CTTP) is an outstanding Initial Teacher Training Provider based at Carmel College Darlington, an outstanding 11-18 college. Our training programmes are Primary 5-11 years and Secondary 11-16. We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary and secondary schools, widely spread across the North East of England. The CTTP School Centred Initial Teacher Training course aims to promote excellence in all aspects of education.  This is achieved through high quality central and school-based training activities, regular observations with developmental feedback, to secure progress throughout the training programme.  Central training takes place in clusters around our Lead Schools. Our overarching aim is to provide the most skilled and competent practitioners for our schools, improving the outcomes and life chances for young people. \\r\n\\r\nA very high percentage of trainees on our programme either gain employment in their placement schools, or within our Partnership of schools. Carmel Teacher Training Partnership is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees. Successful completion leads to Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards Masters accreditation, which is completed via the flying faculty of St.  Mary’s University Twickenham but delivered at Carmel College and one of our Northern Lead schools, St Cuthbert’s High, Newcastle.  \\r\n",
    "TrainWithDisability": "All Schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site. Please contact Claire Hutton on chutton@carmel.org.uk with any specific disability access requirements.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
