{
  "locationType": "School",
  "accrediting": "Suffolk and Norfolk Secondary SCITT",
  "provider": "Farlingaye & Kesgrave Teaching School Alliance",
  "subjects": [
    "Art and design",
    "Secondary"
  ],
  "name": "Art and Design",
  "financial_support": "Salary",
  "slug": "1GN/2VJ7",
  "providerCode": "1GN",
  "programmeCode": "2VJ7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Farlingaye & Kesgrave TSA, Suffolk, IP5 2PB",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Farlingaye & Kesgrave TSA, Suffolk, IP5 2PB",
      "geocode": true,
      "formatted_address": "Ransom Rd, Woodbridge IP12 4JX, UK",
      "latitude": 52.1005123,
      "longitude": 1.3037822,
      "post_code": "IP12 4JX",
      "city": "Suffolk",
      "route": "Ransom Road",
      "postal_town": "Woodbridge"
    }
  ],
  "providerAddress": {
    "inst_code": "1GN",
    "addr_1": "Main Road",
    "addr_2": "Kesgrave",
    "addr_3": null,
    "addr_4": "Ipswich",
    "postcode": "IP5 2PB ",
    "url": "http://www.farlingayekesgravetsa.co.uk/schoolsdirect.html",
    "geocode": true,
    "formatted_address": "Main Rd, Kesgrave, Ipswich IP5 1AG, UK",
    "latitude": 52.0664483,
    "longitude": 1.2435283,
    "post_code": "IP5 1AG",
    "city": "Kesgrave",
    "route": "Main Road",
    "postal_town": "Ipswich"
  },
  "options": [
    "PGCE with QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "\"Secondary SCITT Salaried trainees receive core and subject knowledge training on one day per week throughout the training period. You will receive at least six subject knowledge days led by a subect specialist. As a Secondary SCITT Salaried trainee you will become part of a team of experienced professionals in a school from the start of the academic year and will, therefore, benefit from opportunities to work and learn alongside experienced teachers.  Former trainees identify this as a particular strength: ‘On the job training is the best way to find out what works in practice’\\r\nSuffolk Secondary SCITT Salaried core training will be largely split between training venues in Ipswich and Norwich.\"\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "A UK first degree (or equivalent). Normally 2.2 or better (or equiv. 360 CAT points). \\r\nGCSE English Language Grade 4/C or above (or equivalent) \\r\nGCSE Mathematics Grade 4/C or above (or equivalent)\"\\r\n",
    "InterviewProcess": "After your application is shortlisted by the SCITT and Lead School team, you will be invited to a formal interview by SCITT. This interview may take place at a Lead School or it may take place at one of the SCITT venues in Norwich or Ipswich. The interview will  consist of  questions by an interview panel; a student panel; subject knowledge task and a reflective task.   If successful at the SCITT interview, you will be invited to the final part of the process known as Task Day which will be held in Norwich and Ipswich. You will complete group activities with other trainees, deliver a very short presentation and complete a couple of written tasks and you will be observed by senior members of the SCITT Team. If you are successful after Task Day and have attended an interview at a school then you will be made an offer which is agreed by the Lead School and Suffolk and Norfolk SCITT as the training provider. \\r\n",
    "OtherRequirements": "Passes in the professional skills tests in literacy and numeracy before starting the course. Confirmation of clear DBS check before you start the course. Meet the 'Fit to Teach' criteria. \\r\n",
    "PersonalQualities": "We find that successful trainees have a passion for their subject which they wish to pass onto secondary school students. Trainees should be motivated, well-organised and demonstrate resilience. Trainees should understand  the importance of developing strong learning relationships with teenagers and can demonstrate that they view teaching as a valuable career. Additionally trainees  should be reflective, able to take respond positively to feedback about their progress during their training year and also value being part of a team. \\r\n",
    "HowSchoolPlacementsWork": "On the salaried programme, in partnership with the Lead School and Suffolk and Norfolk SCITT as the training provider, we will find you  a training place in one of our local partnership schools, taking into account your home address and travel arrangements, as well as ensuring you have a high-quality school placement. Most trainees train in subjects within the 11-16 age range but there is also the opportunity to train in the 14-19 age phase in specific subjects. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Farlingaye and Kesgrave Teaching School Alliance was established in 2011 as part of the first cohort of Teaching Schools nationally.  We were the first Teaching School within Suffolk, and feel that we have established a positive working relationship across the county providing tailored support, raising achievement for pupils and developing staff.\\r\n\\r\nBy choosing to undertake your teaching training with us, you will find a welcoming, supportive and cutting edge environment in which to begin your career. A combination of working with excellent classroom practitioners, as well as the thorough programme of professional development that is in place will ensure your training year is rewarding and offers you the right opportunities to develop.  We also realise the importance of the support you receive in this crucial year and our supportive mechanisms for those new to their careers ensure that at every level substantial guidance, mentoring and coaching is in place to aid your development.  \\r\n\\r\nWe work with a variety of secondary schools within Suffolk, a full list depending on the training programme you choose can be found on our website. (http://www.farlingayekesgravetsa.co.uk/)\\r\n\\r\nOur long standing and collaborative working relationships with both our accrediting providers is second to none, which is reflected in the success rates of our trainees.\\r\n\\r\nIn the last 10 years 100% of our teacher training graduates, who completed their training programme, have secured teaching positions  after leaving us, with many remaining in our schools to enjoy the continued support that is offered beyond training and the NQT years.\\r\n\\r\n\\r\n",
    "TrainWithDisability": "We are committed to supporting trainees with disabilities. Please contact us to discuss any access requirements.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Suffolk & Norfolk Secondary SCITT Salaried PGCE programme has an excellent local reputation for providing training of the highest quality. It is the largest SCITT in the country training approximately 220 trainees each year across a range of partnership schools. \\r\n\\r\nAll trainees will obtain QTS, and the PGCE with 60 Masters’ credits is optional for Salaried trainees. 70% of Secondary Salaried trainees were graded as outstanding at the end of their training year in June 2018 and 100% of Salaried trainees are now working as newly qualified teachers in local partnership schools and in other areas.",
        "UcasInstitutionCode": "S14"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "E14"
      }
    ]
  },
  "has_inst": true
}
