{
  "locationType": "School",
  "accrediting": "University of Cumbria",
  "provider": "Teach Manchester",
  "subjects": [
    "Primary",
    "Special educational needs"
  ],
  "name": "Primary (Special Educational Needs)",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1HJ/2H49",
  "providerCode": "1HJ",
  "programmeCode": "2H49",
  "schools": [
    {
      "name": "Teach Manchester",
      "address": "Kirkmanshulme Lane, Manchester, M12 4WB",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Kirkmanshulme Lane, Manchester, M12 4WB",
      "geocode": true,
      "formatted_address": "Kirkmanshulme Ln, Manchester M12 4WB, UK",
      "latitude": 53.4596185,
      "longitude": -2.1960659,
      "post_code": "M12 4WB",
      "city": "Greater Manchester",
      "route": "Kirkmanshulme Lane",
      "postal_town": "Manchester"
    }
  ],
  "providerAddress": {
    "inst_code": "1HJ",
    "addr_1": "Kirkmanshulme Lane",
    "addr_2": "Gorton",
    "addr_3": null,
    "addr_4": "Manchester",
    "postcode": "M12 4WB ",
    "url": "http://www.stpetershigh.com/sp/home/school_direct",
    "geocode": true,
    "formatted_address": "Kirkmanshulme Ln, Manchester M12 4WB, UK",
    "latitude": 53.4604851,
    "longitude": -2.1923327,
    "post_code": "M12 4WB",
    "city": "Greater Manchester",
    "route": "Kirkmanshulme Lane",
    "postal_town": "Manchester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Our School Direct course consists of a variety of learning experiences, focused on practical training in teaching and learning related skills. This practical training is underpinned by the development of participant’s knowledge and understanding of education theories, ideas and concepts and by enhancing their awareness of current educational issues and developments. \\r\n\\r\nThis programme is delivered in partnership between the Teach Manchester Alliance and the University of Cumbria who will award both Qualified Teacher Status and a PGCE with up to 60 Masters credits on successful completion.  The programme team is led by Tracy Gallier who is the Professional Programme Lead at Piper Hill High School.  A variety of Specialist Leaders of Education  and expert practitioners also deliver training on this route.\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "• A first degree, or its equivalent with a minimum of 2:2 honours.\\r\n\\r\n• Three GCSEs at minimum grade C/4 or above to include English language, mathematics and science (including biology, chemistry or physics)",
    "InterviewProcess": "All programmes include a panel interview where we are looking to find our more about your skills, knowledge, experience and passion.\\r\n\\r\nThe interview process takes place over a half-day at our lead School Piper Hill High School.\\r\n\\r\n1.\\tliteracy task\\r\n2.\\tmini teach \\r\n3.\\tindividual interview\\r\nThe outcome of the interview will be informed by the quality of your engagement with all three components.\\r\n\\r\nIdentity and qualification checks (please provide photographic ID, proof of address and copies of your academic qualifications)\\r\n\\r\nAll offers we make after interview will be conditional on; successful completion of the professional skills tests, satisfactory medical clearance, clearance through the Disclosure and Barring service, validation of any declared qualification and the acquisition of any pending qualifications. Individual offers may have additional conditions and you are advised to carefully read these.",
    "OtherRequirements": "• Successful completion of the QTS skills test in literacy and numeracy before the start of the course.\\r\n\\r\n• A satisfactory academic (university) reference AND a satisfactory professional reference if more than three years since academic study\\r\n\\r\n• All candidates must demonstrate professional suitability through interview and must obtain medical and enhanced DBS clearance according to established university procedures\\r\n",
    "PersonalQualities": "Our strongest applicants have done some observation in a school and reflected on their experiences and the role of the teacher.",
    "HowSchoolPlacementsWork": "Piper Hill High School is leading a partnership of Manchester special and mainstream primary schools to deliver an innovative and exciting School Direct Primary PGCE with an SEN specialism. Trainees on the course will spend their year based in school, training to teach a primary curriculum to children with additional needs in both mainstream and special schools.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Teach Manchester is an experienced School Direct Alliance of primary, secondary, specialist and sixth form schools and colleges based in central Manchester, working in partnership to offer innovative and exciting Initial Teacher Education. We are committed to providing an outstanding programme of support to training teachers so that they develop into confident and competent teachers who can contribute to the culture of excellence across the alliance and beyond.\\r\n\\r\nWe work in partnership with Manchester Metropolitan University, University of Manchester and University of Cumbria to offer innovative and exciting Initial Teacher Education across primary, primary with SEND and secondary subject specialisms. Our programme equips new teachers with the skills and knowledge to be outstanding teachers and is delivered by our Specialist Leaders of Education, School Leaders and colleagues from our university partners. Upon successful completion of our programme you will be awarded both Qualified Teacher Status and 60 Masters Level Credits as a Postgraduate Certificate in Education (PGCE) by our partner universities.\\r\n\\r\nEvery child should be taught by an outstanding teacher.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "M40"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "M20"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "C99"
      }
    ]
  },
  "has_inst": true
}
