{
  "locationType": "School",
  "accrediting": null,
  "provider": "The Grand Union Training Partnership",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "G60/G1X1",
  "providerCode": "G60",
  "programmeCode": "G1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Sponne School, Brackley Road, Towcester, Northamptonshire, NN12 6DJ",
      "code": ""
    },
    {
      "name": "Campion School Campus.",
      "address": "Kislingbury Road, Bugbrooke, Northamptonshire, NN7 3QG",
      "code": "C"
    },
    {
      "name": "Caroline Chisholm Campus",
      "address": "Wooldale Road, Wootton Fields, Northamptonshire, NN4 6TP",
      "code": "D"
    },
    {
      "name": "Shenley Brook End",
      "address": "MK5 7ZT",
      "code": "E"
    },
    {
      "name": "Magdalen Campus",
      "address": "Waynflete Avenue, Brackley, Northamptonshire, NN13 6FB",
      "code": "F"
    },
    {
      "name": "Guilsborough Campus",
      "address": "West Haddon Road, Guilsborough, Northamptonshire, NN6 8QE",
      "code": "G"
    },
    {
      "name": "The Hazeley Academy",
      "address": "Emperor Drive, Hazeley, Milton Keynes, MK8 0PT",
      "code": "H"
    },
    {
      "name": "Elizabeth Woodville Campus",
      "address": "Stratford Road, Deanshanger, Milton Keynes, MK19 6HN",
      "code": "W"
    },
    {
      "name": "Moulton Campus",
      "address": "Pound Lane, Moulton, Northamptonshire, NN3 7SD",
      "code": "X"
    }
  ],
  "addresses": [
    {
      "address": "Sponne School, Brackley Road, Towcester, Northamptonshire, NN12 6DJ",
      "geocode": true,
      "formatted_address": "Brackley Rd, Towcester NN12 6DJ, UK",
      "latitude": 52.1321314,
      "longitude": -0.9936887,
      "post_code": "NN12 6DJ",
      "city": "Northamptonshire",
      "route": "Brackley Road",
      "postal_town": "Towcester"
    },
    {
      "address": "Kislingbury Road, Bugbrooke, Northamptonshire, NN7 3QG",
      "geocode": true,
      "formatted_address": "Kislingbury Rd, Bugbrooke, Northampton NN7 3QG, UK",
      "latitude": 52.2132301,
      "longitude": -1.0068512,
      "post_code": "NN7 3QG",
      "city": "Bugbrooke",
      "route": "Kislingbury Road",
      "postal_town": "Northampton"
    },
    {
      "address": "Wooldale Road, Wootton Fields, Northamptonshire, NN4 6TP",
      "geocode": true,
      "formatted_address": "Wooldale Rd, Northampton NN4 0TG, UK",
      "latitude": 52.20062309999999,
      "longitude": -0.8746777,
      "post_code": "NN4 0TG",
      "city": "Northamptonshire",
      "route": "Wooldale Road",
      "postal_town": "Northampton"
    },
    {
      "address": "MK5 7ZT",
      "geocode": false
    },
    {
      "address": "Waynflete Avenue, Brackley, Northamptonshire, NN13 6FB",
      "geocode": true,
      "formatted_address": "Waynflete Ave, Brackley NN13 6AG, UK",
      "latitude": 52.0297779,
      "longitude": -1.1511447,
      "post_code": "NN13 6AG",
      "city": "Northamptonshire",
      "route": "Waynflete Avenue",
      "postal_town": "Brackley"
    },
    {
      "address": "West Haddon Road, Guilsborough, Northamptonshire, NN6 8QE",
      "geocode": true,
      "formatted_address": "W Haddon Rd, Guilsborough, Northampton NN6 8QL, UK",
      "latitude": 52.35421580000001,
      "longitude": -1.0174614,
      "post_code": "NN6 8QL",
      "city": "Guilsborough",
      "route": "West Haddon Road",
      "postal_town": "Northampton"
    },
    {
      "address": "Emperor Drive, Hazeley, Milton Keynes, MK8 0PT",
      "geocode": true,
      "formatted_address": "Emperor Drive, Milton Keynes, Hazeley MK8 0PT, UK",
      "latitude": 52.0194674,
      "longitude": -0.8116337,
      "post_code": "MK8 0PT",
      "city": "Milton Keynes",
      "route": "Emperor Drive",
      "postal_town": "Hazeley"
    },
    {
      "address": "Stratford Road, Deanshanger, Milton Keynes, MK19 6HN",
      "geocode": true,
      "formatted_address": "Stratford Rd, Deanshanger, Milton Keynes MK19 6HN, UK",
      "latitude": 52.0505254,
      "longitude": -0.8793964,
      "post_code": "MK19 6HN",
      "city": "Deanshanger",
      "route": "Stratford Road",
      "postal_town": "Milton Keynes"
    },
    {
      "address": "Pound Lane, Moulton, Northamptonshire, NN3 7SD",
      "geocode": true,
      "formatted_address": "Pound Ln, Moulton, Northampton NN3 7PL, UK",
      "latitude": 52.28855309999999,
      "longitude": -0.8565856,
      "post_code": "NN3 7PL",
      "city": "Moulton",
      "route": "Pound Lane",
      "postal_town": "Northampton"
    }
  ],
  "providerAddress": {
    "inst_code": "G60",
    "addr_1": "Sponne School",
    "addr_2": "Brackley Road",
    "addr_3": "Towcester",
    "addr_4": "Northamptonshire",
    "postcode": "NN12 6DJ",
    "url": "http://www.gutp.co.uk",
    "geocode": true,
    "formatted_address": "Brackley Rd, Towcester NN12 6DJ, UK",
    "latitude": 52.1321314,
    "longitude": -0.9936887,
    "post_code": "NN12 6DJ",
    "city": "Northamptonshire",
    "route": "Brackley Road",
    "postal_town": "Towcester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The PGCE Secondary course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable trainees to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. All trainees undertaking the University-led PGCE route into teaching will work towards securing 60 Master’s level credits. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. Trainees on the PGCE Secondary programme will be well supported in becoming critically reflective teachers capable of inspiring their pupils to learn, achieve and flourish.\\r\n\\r\nAt the University of Hertfordshire, trainees will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for trainees to learn about pedagogical approaches relevant to their subject specialism and the professional responsibilities of all teachers.\\r\n\\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT).",
    "CourseLength": "OneYear",
    "Qualifications": "Honours degree (2.2 or higher), awarded by a UK university or an overseas award recognised as equivalent by NARIC.\\r\n\\r\nUsually we would expect the degree to have a minimum 50% content of the subject in which the applicant is applying. However, applicants whose degree does not meet this requirement should contact us to discuss further.\\r\n\\r\nEnglish Language and mathematics GCSE  grade 4 or above (grade C under the old grading structure).\\r\n\\r\nStudents from non-majority English speaking countries require proof of English language proficiency, equivalent to an overall IELTS Academic score of 6.5 with a minimum of 6.0 in each band. ",
    "InterviewProcess": "Suitability to train to teach is assessed at interview. \\r\n\\r\nWe are looking to select trainees who:\\r\n\\r\n* have the passion, commitment and enthusiasm to teach in secondary schools\\r\n* are resilient and able to work under pressure\\r\n* have good subject knowledge to train to teach in the area they are interested in\\r\n\\r\nThe day will begin with a talk about the PGCE programme and is followed by you completing a short written task. You will then lead a short lesson in your subject discipline, details will be sent with the letter inviting you to interview. Finally there is an individual interview.\\r\n\\r\n",
    "OtherRequirements": "You will be required to pass the [Professional Skills tests](http://sta.education.gov.uk/) in literacy and numeracy before starting the course.\\r\n\\r\nYou will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\\r\n\\r\nWe recommend that you undertake observation time in a state secondary school prior to interview but this is not essential. [Activities to support observation in school - either before or after interview - that you may find useful](https://www.herts.ac.uk/__data/assets/pdf_file/0006/164436/Secondary-School-experience-tasks.pdf)\\r\n\\r\n",
    "PersonalQualities": "Through the application and interview process, you will need to demonstrate your passion for teaching and potential to lead learning. Excellent interpersonal and communication skills are vital in classrooms of today alongside the ability to be organised, adaptable and resilient. As a successful candidate you will be able to provide evidence of empathy, respect and an inclusive attitude. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Grand Union Training Partnership is a school-centred initial teacher training (SCITT) consortium centred on a number of 11-18 comprehensive schools situated in villages and small towns West of Northampton and in Milton Keynes. \\r\n\\r\nWe provide Secondary PGCE courses in Business Studies, English, History, Modern Foreign Languages, Physical Education, Maths, Geography, Computer Science, Physics, Chemistry and Biology. \\r\n\\r\nWe aim to give trainees, whom we refer to as Associate Teachers, as much practical experience of working in the Partnership schools as possible. Each Associate Teacher's work and programme of study is supervised by a Mentor (School Based Tutor) who will take a close interest in their development as a subject teacher and colleague. This part of the course is complemented by general professional studies. \\r\n\\r\nOur overall aim is to produce reflective professionals confident in applying for and starting their first jobs as secondary school teachers. Over half of our Associate Teachers take up their first teaching posts in the scheme's Partnership schools. ",
    "TrainWithDisability": "In addition to supporting our Associate Teachers in any way we can, we are committed to providing additional support where possible and necessary.\\r\n\\r\nPrior to the start of our course, we ask all Associate Teachers to consider whether or not they have a disability within the statutory definition.  It is important that we gather this information because The GUTP is committed to ensuring that all of our Associate Teachers are treated fairly and that we do not inadvertently make decisions or have processes that may treat any one less well on the basis of any disability. We also wish to offer appropriate support to all our trainees, whatever their circumstances.  All information given to us is treated with sensitivity and held in confidence.  \\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
