{
  "locationType": "University",
  "accrediting": null,
  "provider": "Nottingham Trent University",
  "subjects": [
    "Design and technology",
    "Secondary"
  ],
  "name": "Design and Technology",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "N91/W9X1",
  "providerCode": "N91",
  "programmeCode": "W9X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Ada Byron King Building, Clifton Campus, Clifton Lane, Nottingham, NG11 8NS",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Ada Byron King Building, Clifton Campus, Clifton Lane, Nottingham, NG11 8NS",
      "geocode": true,
      "formatted_address": "Ada Byron King, Clifton, Nottingham NG11 8NS, UK",
      "latitude": 52.9111874,
      "longitude": -1.1850051,
      "post_code": "NG11 8NS",
      "city": "Clifton",
      "route": null,
      "postal_town": "Nottingham"
    }
  ],
  "providerAddress": {
    "inst_code": "N91",
    "addr_1": "50 Shakespeare Street",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Nottingham",
    "postcode": "NG1 4FQ ",
    "url": "http://www.ntu.ac.uk/education",
    "geocode": true,
    "formatted_address": "50 Shakespeare St, Nottingham NG1 4FP, UK",
    "latitude": 52.9581393,
    "longitude": -1.1542363,
    "post_code": "NG1 4FP",
    "city": "Nottinghamshire",
    "route": "Shakespeare Street",
    "postal_town": "Nottingham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "- Train for a rewarding career in secondary design and technology teaching.\\r\n- Undertake 120 days of school-based training in two different school settings.\\r\n- Participate in practical work in our well-equipped facilities to help you learn creative and innovative teaching methods.\\r\n- Attain a masters-level PGCE, or a PCE alongside Qualified Teacher status (QTS).\\r\n\\r\nThis course will help you to grow academically and professionally and has, as its primary aim, the development and supply of competent teachers who are capable of securing employment in an education setting. You graduate as an experienced and employable design and technology teacher, ready to inspire young people.\\r\n\\r\nThis course provides an advanced academic qualification alongside the real-world experience in school settings. Along with honing your subject skills, you'll learn crucial teaching techniques including behaviour management and student support. There are 120 days of school-based training that allow you to become used to the realities of teaching before graduation. You are assessed through supportive, collaborative means, helping you to grow and improve.\\r\n\\r\nYou learn through\\r\n\\r\n- 120 days of school based training across at least two settings\\r\n- classes in our well-equipped facilities\\r\n- seminars and lectures\\r\n- workshops\\r\n- school-based experiences\\r\n- independent study\\r\n- group work\\r\n- practical work\\r\n- written assessments and feedback",
    "CourseLength": "OneYear",
    "FeeInternational": 13500.0,
    "InterviewProcess": "If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\\r\n\\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\\r\n\\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\\r\n\\r\n",
    "HowSchoolPlacementsWork": "This course ensures that you'll have the real-life experience you need to enter teaching. You'll spend 120 days across two or more sites, with school-based mentors and campus-based tutors monitoring your progress and providing support. Upon graduating, some of our students go into full-time employment at their placement school.\\r\n\\r\nYou will take responsibility for your own development against the statutory requirements for QTS and will record your progress in a Professional Development Portfolio (PDP). This collaborative process involves you, university-based tutors and school-based mentors. As you complete the course you will review your progress, plan for your entry to the teaching profession and for your ongoing development as a Newly Qualified Teacher (NQT)."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Nottingham Trent University's (NTU) reputation is long established. We've been training teachers and educational professionals for well over 50 years. Our greatest strength is our extensive links with schools and educational settings. These relationships enable every student to gain experience through placement in a wide variety of educational environments.\\r\n\\r\nWhy choose NTU?\\r\nWorking with schools\\r\nA great strength of our courses is the extensive partnership links that we have with over 600 primary, secondary and post-16 settings across the East Midlands. These relationships enable you to gain a wide experience of teaching in many different educational environments. Experiences vary from city centre to suburban and semi-rural settings, laying a sound foundation for future professional development.\\r\n\\r\nStudent diversity\\r\nWe are committed to promoting a diverse body of teacher trainees. Our students are made up of different backgrounds, nationalities and faiths.\\r\n\\r\nExperienced lecturers and informed courses\\r\nNTU is home to an enthusiastic, expert group of academic staff who are leading researchers and practitioners in the education field. This means that, not only is your course informed by the latest thinking, but also that you will learn from people with a real passion for their subject.",
    "TrainWithDisability": "You will receive lots of support based around your school placements, with planning sessions, mentors and pastoral support from your tutors and colleagues. You can also tap into a range of services at any time, including: \\r\nFinancial Support Services, Counselling, Disability Support, Support, Mature Student Support and Mental Health Support. ",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
