{"data":[{"id":"12971169","type":"courses","attributes":{"accredited_body_code":null,"age_maximum":16,"age_minimum":11,"bursary_amount":"24000","bursary_requirements":["a degree of 2:2 or above in any subject"],"created_at":"2022-03-23T12:53:17Z","funding_type":"fee","gcse_subjects_required":["maths","english"],"level":"secondary","name":"Engineers Teach Physics","program_type":"higher_education_programme","qualifications":["qts","pgce"],"scholarship_amount":"26000","study_mode":"full_time","uuid":"e00bfdff-8735-463e-b710-92dbe8e65ab6","degree_grade":"third_class","degree_subject_requirements":"An undergraduate engineering or material science degree at class 2:2 or above preferred, or equivalent, is required to apply to this pilot course.  \r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","accept_pending_gcse":false,"accept_gcse_equivalency":false,"accept_english_gcse_equivalency":false,"accept_maths_gcse_equivalency":false,"accept_science_gcse_equivalency":false,"additional_gcse_equivalencies":null,"can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"about_accredited_body":null,"applications_open_from":"2021-10-12","changed_at":"2022-08-02T13:55:45Z","code":"V473","findable":true,"has_early_career_payments":false,"has_scholarship":true,"has_vacancies":false,"is_send":false,"last_published_at":"2022-06-28T11:30:30Z","open_for_applications":false,"required_qualifications_english":"not_set","required_qualifications_maths":"not_set","required_qualifications_science":"not_set","running":true,"start_date":"September 2022","state":"published","summary":"PGCE with QTS full time","subject_codes":["F3"],"required_qualifications":"Grade 4 (C) or above in English and maths, or equivalent qualification.\nWe will not consider candidates with pending GCSEs.\nWe do not accept equivalency tests.\n\nAn undergraduate degree, or equivalent. This should be an honours degree (Third or above), or equivalent.\nAn undergraduate engineering or material science degree at class 2:2 or above preferred, or equivalent, is required to apply to this pilot course.  \r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","about_course":"Engineers Teach Physics is a new one-year PGCE (QTS) initial teacher course. It has been tailored to support trainees with a background in engineering and material science.\r\n\r\nThe course will focus on physics subject knowledge that engineers and materials science graduates are not likely to have studied at undergraduate level.\r\n\r\nThe course will also utilise the fantastic practical experience and knowledge that engineers have, which can help to make physics teaching come alive.\r\n\r\nIf you choose physics as your main specialism, you’ll learn how to approach teaching difficult topics in an engaging and exciting way. We’ll help you to find your own style as a physics teacher; we will encourage you to use your own strategies, drawing on your experience as an engineer to make learning physics a fun and positive experience. \r\n\r\nAs an engineer, you’ll be given specific support to help you use your expertise effectively. You will also be given support for teaching outside specialism, with additional subject knowledge sessions in all three sciences, delivered in our bespoke school labs on campus.\r\n\r\nPlease note, due to the popularity of this course all of our international places have been filled and we are no longer accepting new international applications. There are still spaces for UK students, although we would encourage you to apply quickly to avoid disappointment. ","course_length":"38 weeks","fee_details":"For any additional course costs at the University of East Anglia please [visit our website](https://www.uea.ac.uk/about/university-information/finance-and-procurement/finance-information-for-students/tuition-fees/additional-course-fees)","fee_international":22400,"fee_domestic":9250,"financial_support":"","how_school_placements_work":"School experience takes place in our partnership schools across the region.\r\n \r\nDuring the two extensive placements in our partnership schools, you will gain a broad range of practical teaching experience. You will learn to put ideas and theory into practice.","interview_process":"Interviews are part of the formal selection process. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\r\n\r\n* An introductory talk\r\n* An individual interview\r\n* A written task\r\n* Engage in small group discussion\r\n\r\nYou may also be asked to complete other relevant tasks such as:\r\n\r\n* Giving a presentation\r\n* A group interview\r\n* Literacy, numeracy and subject knowledge questions","other_requirements":"Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\r\n\r\nApplicants must also obtain:\r\n* An Enhanced Criminal Records check from the [Disclosure and Barring Service](https://www.gov.uk/government/organisations/disclosure-and-barring-service) \r\n* A satisfactory Health Check. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach.\r\n\r\nAll trainee teachers must have the health and physical capacity to teach and not put children and young people at risk of harm.","personal_qualities":"Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\r\n\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.","salary_details":null},"relationships":{"accredited_body":{"meta":{"included":false}},"provider":{"data":{"type":"providers","id":"18044"}},"recruitment_cycle":{"meta":{"included":false}}}},{"id":"12971159","type":"courses","attributes":{"accredited_body_code":null,"age_maximum":16,"age_minimum":11,"bursary_amount":"24000","bursary_requirements":["a degree of 2:2 or above in any subject"],"created_at":"2022-03-18T08:30:18Z","funding_type":"fee","gcse_subjects_required":["maths","english"],"level":"secondary","name":"Engineers Teach Physics","program_type":"higher_education_programme","qualifications":["qts","pgce"],"scholarship_amount":"26000","study_mode":"full_time","uuid":"f8cbebb2-92cf-4db2-a9ae-70647f23f99e","degree_grade":"not_required","degree_subject_requirements":"An undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course. \r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","accept_pending_gcse":true,"accept_gcse_equivalency":true,"accept_english_gcse_equivalency":true,"accept_maths_gcse_equivalency":true,"accept_science_gcse_equivalency":null,"additional_gcse_equivalencies":"Grade 4 (C) or above in English and maths, or equivalent qualification. \r\n\r\nWe’ll consider candidates with pending GCSEs. \r\n\r\nWe’ll consider candidates who need to take a GCSE equivalency test in English or maths. \r\n\r\nWe will only consider the University of Wolverhampton equivalency test/s. ","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"about_accredited_body":null,"applications_open_from":"2021-10-12","changed_at":"2022-08-04T10:14:50Z","code":"P367","findable":true,"has_early_career_payments":false,"has_scholarship":true,"has_vacancies":false,"is_send":false,"last_published_at":"2022-03-25T08:58:19Z","open_for_applications":false,"required_qualifications_english":"not_set","required_qualifications_maths":"not_set","required_qualifications_science":"not_set","running":true,"start_date":"September 2022","state":"published","summary":"PGCE with QTS full time","subject_codes":["F3"],"required_qualifications":"Grade 4 (C) or above in English and maths, or equivalent qualification.\nWe will consider candidates with pending GCSEs.\nWe will accept equivalency tests in English and maths.\nGrade 4 (C) or above in English and maths, or equivalent qualification. \r\n\r\nWe’ll consider candidates with pending GCSEs. \r\n\r\nWe’ll consider candidates who need to take a GCSE equivalency test in English or maths. \r\n\r\nWe will only consider the University of Wolverhampton equivalency test/s. \nAn undergraduate degree, or equivalent.\nAn undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course. \r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","about_course":"Engineers Teach Physics is a new one-year PGCE (QTS) initial teacher course. It has been tailored to support trainees with a background in engineering and material science.\r\n\r\nThe course will focus on physics subject knowledge that engineers and materials science graduates are not likely to have studied at undergraduate level. The course will utilise the fantastic practical experience and knowledge that engineers have, which can help to make physics teaching come alive.  If you are an engineer who has interest in all aspects of science, but in particular physical sciences associated with forces, energy, mechanics, electrical effects, and enjoy investigating them in a practical setting, then this course will suit you.\r\n\r\nOur Postgraduate Certificate in Education (PGCE) in Secondary Education provides a high standard of training for those preparing to take up a teaching post in the secondary school sector. The course complies with statutory guidance from the Department for Education for Initial Teacher Training courses, covering the 5 core areas of the ITT Core Content Framework of behaviour management, pedagogy, curriculum, assessment and professional behaviours. \r\n\r\nThe PGCE in Secondary Education is specifically designed to ensure that those who are successful will be recommended for the award of Qualified Teacher Status (QTS) - the professional award required by those who wish to teach in a maintained school. \r\n\r\nEngineering applies mathematics and areas of science to solve real world problems in different contexts. Whether you are a career changer, or recently graduated having studied engineering, this course will prepare and develop you to become ready for teaching. With your subject knowledge and commercial experience, engineers will be able to present contexts that will engage and enthuse students. Transferable skills which you will have developed in an engineering background, will give you a strong position to progress your career within a school environment into positions of responsibility.  \r\n\r\nOur course looks at  key ideas which underpin the teaching of physics in schools and the way children's understanding of concepts develops. As a trainee you will learn how to teach physics to pupils in the 11-16 age range within the secondary age phase, with additional primary and post-16 enhancements. You will learn how to develop skills, knowledge, and understanding for teaching physics through a combination of university-led and school-led training. \r\n\r\nSuccessful completion of the course will lead to recommendation for the award of Qualified Teacher Status (QTS), along with 60 credits at Master’s level. ","course_length":"OneYear","fee_details":"You could be eligible for either: \r\n\r\na scholarship of £26,000 \r\n\r\na bursary of £24,000 \r\n\r\nTo qualify for a scholarship you’ll need a degree of 2:1 or above in Engineering  or material science or a related subject. For a bursary you’ll need a 2:2 or above in Engineering or material science. \r\n\r\nYou cannot claim both a bursary and a scholarship - you can only claim one. \r\n\r\nFind out more about bursaries and scholarships. You do not need to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. \r\n\r\nYou may also be eligible for a loan while you study. \r\n\r\nFind out about financial support if you’re from outside the UK. ","fee_international":12250,"fee_domestic":9250,"financial_support":"","how_school_placements_work":"One of our strengths is that we have a vast network of high quality partnership schools in which to place you for the extended school placements. We ensure that you receive high quality school-based training by selecting schools with highly trained mentors and a proven track record of excellent trainee outcomes. We will also take other factors into consideration when placing you, such as your geographical location and transportation, to provide you with the best possible experience in a convenient and suitable setting.\r\n\r\nThe University-led elements of the course take place at our Walsall Campus. Our PGCE starts in early September and ends in June, and it is an intensive academic and professional training course that effectively prepares you for your first teaching post and beyond.\r\n\r\nThe course comprises of  two extended school placements in your subject specialism and two periods of University-based teaching – September to October and January to February. The programme also includes a short Primary school placement and additional opportunities for a range of enhancements to your course; for example, experience of teaching pupils with special educational needs or teaching pupils for whom English is an additional language.\r\n","interview_process":"Interview and Selection\r\n\r\nFirst Stage: All applicants that are successful with their application will be invited to complete a set of short professional scenarios involving reading, writing and numerical tasks. These will provide us with an audit of your existing strengths as well as indicate any areas where you need to develop your knowledge and understanding during your course. If you are offered a place following interview, you will be required to demonstrate your professional readiness through successful completion of all of the tasks as one of your conditions of acceptance before the course starts. This may mean that you are asked to attend support sessions in English and mathematics during your course to enable you to demonstrate a satisfactory level of proficiency by the completion of your course.\r\n\r\nAny work to address shortfalls in English and mathematics must be undertaken by the trainee teacher in addition to other aspects of their training. It is the trainee’s responsibility to secure these fundamental skills before being recommended for Qualified Teacher Status.\r\n\r\nSecond Stage: You will undertake either an observed group task or a subject-specific activity (if you are applying for secondary teacher training).\r\n\r\nThird Stage: You will engage in individual face to face interview.\r\n\r\nWe will be assessing your ability to be able to meet the Teachers’ Standards by the completion of your course.","other_requirements":"Those successful in the audits and at interview will be subsequently required to meet enhanced DBS checks, fitness to teach and medical check and prohibition order check requirements. You will be expected to complete these forms once you have been successful and have a Conditional Offer. If you have accepted a Conditional Offer made by the University of Wolverhampton you will receive correspondence asking you to complete an enhanced Disclosure and Barring Service (DBS) check. The charge for this will be a DBS fee of £44.00 and a £6.00 ID check service fee. ","personal_qualities":"You will have interest in all aspects of science along with a particular aptitude for physics from your engineering background, along with an ability to think creatively about presenting the subject to others in original and practical ways, utilising contexts from the field of engineering. Candidates will be expected to teach the whole science curriculum, but with a particular focus on physical processes. Above all, you will need a real commitment to the education of young people. ","salary_details":null},"relationships":{"accredited_body":{"meta":{"included":false}},"provider":{"data":{"type":"providers","id":"17566"}},"recruitment_cycle":{"meta":{"included":false}}}},{"id":"12971171","type":"courses","attributes":{"accredited_body_code":null,"age_maximum":16,"age_minimum":11,"bursary_amount":"24000","bursary_requirements":["a degree of 2:2 or above in any subject"],"created_at":"2022-03-24T12:10:59Z","funding_type":"fee","gcse_subjects_required":["maths","english"],"level":"secondary","name":"Engineers Teach Physics","program_type":"scitt_programme","qualifications":["qts","pgce"],"scholarship_amount":"26000","study_mode":"full_time","uuid":"c0e5ae56-25df-4dcf-891a-e018b5bc5c03","degree_grade":"two_two","degree_subject_requirements":"An undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course.\r\n\r\nIf your degree is not in engineering or a related subject, please apply to our Physics course.","accept_pending_gcse":true,"accept_gcse_equivalency":true,"accept_english_gcse_equivalency":true,"accept_maths_gcse_equivalency":true,"accept_science_gcse_equivalency":null,"additional_gcse_equivalencies":"","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":false,"about_accredited_body":null,"applications_open_from":"2021-10-12","changed_at":"2022-08-03T15:08:18Z","code":"R576","findable":true,"has_early_career_payments":false,"has_scholarship":true,"has_vacancies":false,"is_send":false,"last_published_at":"2022-03-25T08:57:42Z","open_for_applications":false,"required_qualifications_english":"not_set","required_qualifications_maths":"not_set","required_qualifications_science":"not_set","running":true,"start_date":"September 2022","state":"published","summary":"PGCE with QTS full time","subject_codes":["F3"],"required_qualifications":"Grade 4 (C) or above in English and maths, or equivalent qualification.\nWe will consider candidates with pending GCSEs.\nWe will accept equivalency tests in English and maths.\n\nAn undergraduate degree at class 2:2 or above, or equivalent.\nAn undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course.\r\n\r\nIf your degree is not in engineering or a related subject, please apply to our Physics course.","about_course":"Engineers Teach Physics is a new one-year PGCE and QTS initial teacher course.  It has been tailored to support trainees with a background in engineering and material science.\r\n\r\nThe course will focus on Physics subject knowledge that engineers and materials science graduates are not likely to have studied at undergraduate level.\r\n\r\nThe course will also utilise the fantastic practical experience and knowledge that engineers have, which can help to make Physics teaching come alive.\r\n\r\n[The National Mathematics and Physics SCITT (NMAPS)](http://www.nmapscitt.org.uk/), led by [Wycombe High School](https://www.whs.bucks.sch.uk/), offers high quality specialist teacher training.  School placements are in an extensive network of state and independent schools, clustered around each of our [Regional Training Hubs](http://www.nmapscitt.org.uk/partnership-structure/).\r\n\r\nYou will benefit from a bespoke programme focused on your subject, with enhanced specialist subject knowledge and pedagogical training to ensure your career gets off to a flying start.  Trainees will gain teaching experience with students aged 11-16 and sixth form.\r\n\r\nSubject Knowledge and Professional Studies training is delivered by tutors who have been chosen because of the high quality of their own teaching practice and experience.  These weekly sessions will be delivered in your local Hub School and will develop your subject specific pedagogical skills and theories of education.  Trainees will be individually supported by a mentor from their placement school who they will meet weekly to discuss progress and offer support.\r\n\r\nOur programme allows trainee teachers to develop an understanding of their pupils, the education system in England today and to experience first-hand collaboration between the state and independent sectors.\r\n\r\nOn successful completion of the training year, trainees are awarded QTS by NMAPS and a PGCE (Postgraduate Certificate in Education) by [The University of Buckingham](https://www.buckingham.ac.uk/), England's oldest independent university and highly acclaimed by its students.\r\n\r\nThe programme also provides regular professional networking and social opportunities, based in English cities including London, throughout the PGCE training year and beyond.  Links with key professional associations, including [The Institute of Physics](https://www.iop.org/), [The Mathematical Association](https://www.m-a.org.uk/) and [The National Centre for Excellence in the Teaching of Mathematics (NCETM)](https://www.ncetm.org.uk/) will provide ongoing high quality professional development.\r\n\r\nYour relationship with the NMAP SCITT does not end with gaining QTS and a PGCE; former trainees continue to benefit from a range of alumni events and career support.","course_length":"OneYear","fee_details":"","fee_international":null,"fee_domestic":9250,"financial_support":"","how_school_placements_work":"We carefully match trainees to placement schools, taking into consideration location and individual trainee needs. \r\n\r\nThe majority of time will be spent in the main placement school, with a second placement in a contrasting school. Full time trainees will spend four days a week in school, supported by a subject mentor, who they will meet with every week; this will vary for part time trainees. \r\n\r\nSubject Knowledge and Professional Studies training will take place on the fifth day in their local Hub Lead School.\r\n\r\nAdditional short placements will ensure that trainees gain exposure to the full range of English teaching organisations: state comprehensive and selective schools; independent, primary and special schools; and pupil referral units. Trainees will gain teaching experience across all key stages, including Sixth Form.","interview_process":"The NMAPS recruitment process is a rigorous and thorough process, normally lasting half a day and designed to match the best candidates appropriately to the places available. \r\n\r\nThe selection process will be led by NMAPS staff and, where possible, a subject knowledge expert from the school offering the main training place; it will comprise: \r\n* A 30-minute teaching activity to establish the applicant's ability to engage and communicate with young people.\r\n* A 30-minute written subject knowledge task. \r\n* A 20-minute written communication task.\r\n* A 45-minute interview to determine the applicant's aptitude for teaching in terms of intellectual and academic capabilities and the personal qualities, values and ethics needed to work in a school setting. The interview will also explore the applicant's resilience, time-management and organisational skills; it will include a subject knowledge conversation, led by the relevant subject leader, to ascertain the applicant's potential to meet the Teachers' Standards by the end of their training. \r\n \r\nIf you are successful at interview, a conditional offer of a place will be made. Conditions will include: verification of your qualifications, a criminal record check (DBS) and an on-line occupational health assessment. Further conditions, such as Subject Knowledge Enhancement (SKE) training  may be discussed with you at interview as appropriate.\r\n\r\nInterviews may take place in person or online.","other_requirements":"DBS Clearance and Occupational Health Check - all applicants will be required to undergo Disclosure Barring Service (DBS) and Enhanced Disclosure checks and an on-line Occupational Health Check. If you have lived overseas in the last 10 years additional checks are likely to be required. \r\n\r\nEnglish Language proficiency requirements - applicants must demonstrate an excellent command of both written and spoken English. \r\n\r\nPlease visit our website for further details.","personal_qualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject with a desire to share that with young people of all abilities. Applicants should be confident and articulate communicators, who are keen to contribute to their subject team and the wider school community. \r\n\r\nPrevious school experience is not required, but applicants are advised to give details of all meaningful experience of working with young people. This may be school experience, but could also include any unpaid volunteering with, for example, a sports team, drama or youth club. ","salary_details":null},"relationships":{"accredited_body":{"meta":{"included":false}},"provider":{"data":{"type":"providers","id":"17275"}},"recruitment_cycle":{"meta":{"included":false}}}},{"id":"12971180","type":"courses","attributes":{"accredited_body_code":null,"age_maximum":18,"age_minimum":11,"bursary_amount":"24000","bursary_requirements":["a degree of 2:2 or above in any subject"],"created_at":"2022-03-25T10:12:22Z","funding_type":"fee","gcse_subjects_required":["maths","english"],"level":"secondary","name":"Engineers Teach Physics","program_type":"higher_education_programme","qualifications":["qts","pgde"],"scholarship_amount":"26000","study_mode":"full_time","uuid":"94b67c63-5c99-440b-a634-8235aac7aed3","degree_grade":"two_two","degree_subject_requirements":"An undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course.\r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","accept_pending_gcse":false,"accept_gcse_equivalency":true,"accept_english_gcse_equivalency":true,"accept_maths_gcse_equivalency":true,"accept_science_gcse_equivalency":null,"additional_gcse_equivalencies":"You will need to undertake and pass your equivalency test prior to making an application.\r\nPlease use this website to undertake the test: https://www.equivalencytesting.com ","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"about_accredited_body":null,"applications_open_from":"2021-10-12","changed_at":"2022-07-29T11:06:57Z","code":"H546","findable":true,"has_early_career_payments":false,"has_scholarship":true,"has_vacancies":false,"is_send":false,"last_published_at":"2022-03-25T13:03:56Z","open_for_applications":false,"required_qualifications_english":"not_set","required_qualifications_maths":"not_set","required_qualifications_science":"not_set","running":true,"start_date":"September 2022","state":"published","summary":"PGDE with QTS full time","subject_codes":["F3"],"required_qualifications":"Grade 4 (C) or above in English and maths, or equivalent qualification.\nWe will not consider candidates with pending GCSEs.\nWe will accept equivalency tests in English and maths.\nYou will need to undertake and pass your equivalency test prior to making an application.\r\nPlease use this website to undertake the test: https://www.equivalencytesting.com \nAn undergraduate degree at class 2:2 or above, or equivalent.\nAn undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course.\r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","about_course":"Engineers Teach Physics is a new one-year PGDipEd (QTS) initial teacher course. It has been tailored to support trainees with a background in engineering and material science.\r\nThe course will focus on physics subject knowledge that engineers and materials science graduates are not likely to have studied at undergraduate level.\r\nThe course will also utilise the fantastic practical experience and knowledge that engineers have, which can help to make physics teaching come alive.","course_length":"36 weeks","fee_details":"When you apply for this course, it is important that you also take into account living costs and should ensure that you will have sufficient funds to finance the full duration of your studies. Our PGDipEd programmes include a significant amount of time spent on placements in a variety of schools at different locations, and so when budgeting to study you should also allow for travel to and from placements, as well as textbooks, printing, photocopying and stationery that you may need.","fee_international":18450,"fee_domestic":9250,"financial_support":"","how_school_placements_work":"School-based work is an important part of the programme, with students normally spending a total of 24 weeks in schools. During the programme you benefit from both carefully supported introductory work in different schools and the experience of spending a significant length of time in two schools.\r\n\r\nThe final assessment of teaching is based on the spring/summer term school placement. Assessment is shared between University tutors, staff responsible for students in schools, and external examiners. All aspects of your contribution to the life of the school are taken into account, in particular the teaching of your main subject.\r\n\r\nDuring the course supervised experience and practice are arranged in schools of various kinds across the 11–18 age range. We are fortunate in being able to work with a wide range of partnership schools, including mixed comprehensives, single-sex schools, sixth-form colleges and our own University Training School (www.uobschool.org.uk). Many of the schools offer opportunities to work with pupils from a wide variety of cultural backgrounds.","interview_process":"Selection is rigorous and designed to identify candidates with the strongest aptitude. Successful applicants will undertake an online interview where you will:\r\n\r\n* meet course tutors\r\n* find out more about the course\r\n* complete a written task (where relevant)\r\n* have a one to one interview\r\n* show GCSE and Degree certificates (where these are available).\r\n\r\nWe work closely with partner schools to select candidates and applicants will often have the opportunity to meet senior colleagues from partner schools when they join us for interview day. \r\n","other_requirements":"*If not already obtained, GCSE English (Grade 4) must be attained as a condition of entry. If you are offering an alternative qualification check with us before applying.\r\n\r\nYou must also :\r\n\r\n* complete an enhanced Disclosure and Barring Service (DBS) check.\r\n\r\n* complete relevant checks to ensure you have the health and physical capacity to teach.\r\n\r\n* agree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise. ","personal_qualities":"In selecting candidates for a place on a University of Birmingham ITE programme, University and school-based colleagues look for: \r\n\r\n* Relevant academic profile and intellectual capacity\r\n* Strong subject knowledge\r\n* Relevant work/volunteering experience\r\n* Awareness of contemporary educational issues\r\n* Motivation, enthusiasm and a clear rationale for teaching\r\n* Responsibility, maturity, open-mindedness\r\n* Appropriate ethics and values, including equal opportunities awareness\r\n* Effective spoken and written Standard English\r\n* Commitment to teaching as a career.\r\n","salary_details":null},"relationships":{"accredited_body":{"meta":{"included":false}},"provider":{"data":{"type":"providers","id":"17196"}},"recruitment_cycle":{"meta":{"included":false}}}},{"id":"12971164","type":"courses","attributes":{"accredited_body_code":null,"age_maximum":16,"age_minimum":11,"bursary_amount":"24000","bursary_requirements":["a degree of 2:2 or above in any subject"],"created_at":"2022-03-22T08:47:00Z","funding_type":"fee","gcse_subjects_required":["maths","english"],"level":"secondary","name":"Engineers Teach Physics","program_type":"scitt_programme","qualifications":["qts","pgce"],"scholarship_amount":"26000","study_mode":"full_time","uuid":"378fd1d3-8b1c-4478-9f23-fedba5aba6c1","degree_grade":"two_two","degree_subject_requirements":"An undergraduate engineering or material science degree at class 2:2 or above, or \r\nequivalent, is required to apply to this pilot course. \r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","accept_pending_gcse":true,"accept_gcse_equivalency":true,"accept_english_gcse_equivalency":true,"accept_maths_gcse_equivalency":true,"accept_science_gcse_equivalency":null,"additional_gcse_equivalencies":"","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":false,"about_accredited_body":null,"applications_open_from":"2021-10-12","changed_at":"2022-07-14T08:12:12Z","code":"E218","findable":true,"has_early_career_payments":false,"has_scholarship":true,"has_vacancies":false,"is_send":false,"last_published_at":"2022-03-22T11:22:25Z","open_for_applications":false,"required_qualifications_english":"not_set","required_qualifications_maths":"not_set","required_qualifications_science":"not_set","running":true,"start_date":"September 2022","state":"published","summary":"PGCE with QTS full time","subject_codes":["F3"],"required_qualifications":"Grade 4 (C) or above in English and maths, or equivalent qualification.\nWe will consider candidates with pending GCSEs.\nWe will accept equivalency tests in English and maths.\n\nAn undergraduate degree at class 2:2 or above, or equivalent.\nAn undergraduate engineering or material science degree at class 2:2 or above, or \r\nequivalent, is required to apply to this pilot course. \r\nIf your degree is not engineering or a related subject, please apply to our Physics course.","about_course":"Engineers Teach Physics is a new one-year PGCE (QTS) initial teacher course. It has been tailored to support trainees with a background in engineering and material science.\r\nThe course will focus on physics subject knowledge that engineers and materials science graduates are not likely to have studied at undergraduate level. \r\nThe course will also utilise the fantastic practical experience and\r\nknowledge that engineers have, which can help to make physics teaching come alive.\r\n","course_length":"OneYear","fee_details":"","fee_international":null,"fee_domestic":9250,"financial_support":"","how_school_placements_work":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on the programme have the opportunity to experience the 16-18 phase on one of their placements.","interview_process":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","other_requirements":null,"personal_qualities":null,"salary_details":null},"relationships":{"accredited_body":{"meta":{"included":false}},"provider":{"data":{"type":"providers","id":"17172"}},"recruitment_cycle":{"meta":{"included":false}}}},{"id":"12971154","type":"courses","attributes":{"accredited_body_code":null,"age_maximum":18,"age_minimum":11,"bursary_amount":"24000","bursary_requirements":["a degree of 2:2 or above in any subject"],"created_at":"2022-03-14T12:51:04Z","funding_type":"fee","gcse_subjects_required":["maths","english"],"level":"secondary","name":"Engineers Teach Physics","program_type":"higher_education_programme","qualifications":["qts","pgce"],"scholarship_amount":"26000","study_mode":"full_time","uuid":"405b638b-579f-4f34-b862-6fb3c2fd3fc5","degree_grade":"two_two","degree_subject_requirements":"An undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course.  \r\n \r\nIf your degree is not engineering or a related subject, please apply to our Physics course. \r\n\r\nA grade B in physics at A-level (or equivalent), or grade C if you can demonstrate sustained academic progression since A-level, and at least one other science or maths A-level will also be required. ","accept_pending_gcse":true,"accept_gcse_equivalency":true,"accept_english_gcse_equivalency":true,"accept_maths_gcse_equivalency":true,"accept_science_gcse_equivalency":null,"additional_gcse_equivalencies":"Currently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers: \r\n\r\nhttps://www.equivalencytesting.com/\r\n\r\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\r\n\r\nhttps://astarequivalency.co.uk/ \r\n\r\n","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"about_accredited_body":null,"applications_open_from":"2021-10-12","changed_at":"2022-08-24T14:50:56Z","code":"F3X2","findable":true,"has_early_career_payments":false,"has_scholarship":true,"has_vacancies":false,"is_send":false,"last_published_at":"2022-05-05T09:00:13Z","open_for_applications":false,"required_qualifications_english":"not_set","required_qualifications_maths":"not_set","required_qualifications_science":"not_set","running":true,"start_date":"September 2022","state":"published","summary":"PGCE with QTS full time","subject_codes":["F3"],"required_qualifications":"Grade 4 (C) or above in English and maths, or equivalent qualification.\nWe will consider candidates with pending GCSEs.\nWe will accept equivalency tests in English and maths.\nCurrently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers: \r\n\r\nhttps://www.equivalencytesting.com/\r\n\r\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\r\n\r\nhttps://astarequivalency.co.uk/ \r\n\r\n\nAn undergraduate degree at class 2:2 or above, or equivalent.\nAn undergraduate engineering or material science degree at class 2:2 or above, or equivalent, is required to apply to this pilot course.  \r\n \r\nIf your degree is not engineering or a related subject, please apply to our Physics course. \r\n\r\nA grade B in physics at A-level (or equivalent), or grade C if you can demonstrate sustained academic progression since A-level, and at least one other science or maths A-level will also be required.","about_course":"Engineers Teach Physics is a new one-year PGCE (with QTS) initial teacher course. It has been tailored to support trainees with a background in engineering and material science. \r\n \r\nThe course will focus on physics subject knowledge that engineers and materials science graduates are not likely to have studied at undergraduate level.  \r\n \r\nThe course will also utilise the fantastic practical experience and knowledge that engineers  have, which can help to make physics teaching come alive. \r\n\r\nExperienced teachers will work alongside PGCE tutors, plus visitors from exam boards and the Institute of Physics.\r\n\r\nSome sessions are run with the University's science departments to benefit fully from the University's resources, and also with Manchester Museum and the Museum of Science and Industry in Manchester.\r\n\r\nFor more information please visit our website: \r\nhttps://www.manchester.ac.uk/study/masters/humanities-campaigns/engineers-teach-physics/ \r\n","course_length":"10 Months [Full-time] ","fee_details":"","fee_international":20000,"fee_domestic":9250,"financial_support":"","how_school_placements_work":"As a trainee teacher you’ll spend two-thirds of your course in schools or colleges, and the remaining time in University-based study. The course is a partnership between the University and schools and colleges drawn from a wide area, including Bolton, Bury, Cheshire, Deeside, Lancashire, Manchester, Merseyside, Oldham, Rochdale, Salford, Staffordshire, Stockport, Tameside, Trafford, Warrington and Wigan. They include 11-18 and 11-16 comprehensive schools, academies, further education colleges, sixth-form colleges, specialist schools (e.g technology colleges, arts colleges) and independent schools, and you will be placed in two contrasting institutions in the course of your training. \r\n\r\nThe University of Manchester Partnership curriculum is delivered jointly by the university and by our partnership schools and colleges. You will observe and teach classes under the guidance of experienced subject mentors, and both your mentors and university tutors will give you feedback to help you to record your achievements and set targets. During each placement, a University tutor will observe you teach, and at the end of each school experience, you will receive a report from your mentor, giving formative feedback on subject and curriculum knowledge, teaching and planning, assessment and wider professional responsibilities. These reports, together with your record of achievement and development, facilitate your progression as a teacher towards meeting the required standards for Qualified Teacher Status at the end of the programme.\r\n","interview_process":"Your application will be assessed by our admissions team and if successful, we will invite you to an online interview and share the relevant information.  \r\nThe interview process will involve a personal interview with an academic member of staff. You will be also asked to conduct a short teaching task and complete a subject knowledge assessment.\r\n","other_requirements":null,"personal_qualities":null,"salary_details":null},"relationships":{"accredited_body":{"meta":{"included":false}},"provider":{"data":{"type":"providers","id":"17841"}},"recruitment_cycle":{"meta":{"included":false}}}}],"included":[{"id":"18044","type":"providers","attributes":{"ukprn":"10007789","urn":"133853","postcode":"NR4 7TJ","provider_type":"university","region_code":"eastern","train_with_disability":"UEA operates an equal opportunities policy and welcomes applications from people with disabilities. \r\n\r\nAll PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach. All candidates offered a place are required to complete a health declaration form. If this reveals a need, UEA will consider reasonable adjustments, which may include particular school placements, and other support and monitoring during the course.\r\n\r\n[Find out more about the information and advice available through UEA's Wellbeing Service](https://www.uea.ac.uk/uea-life/student-support/wellbeing)\r\n\r\n","train_with_us":"UEA is a top UK university with an international reputation for excellence in teaching and research. We're ranked among the top 182 universities in the world (Times Higher Education World University Rankings 2022). \r\n\r\nThe School of Education and Lifelong Learning is internationally recognised for the quality of its educational research. Our research has made a difference in schools across the country, influencing approaches to managing classroom behaviour, understanding students' motivation, and creating effective communities for learning.\r\n\r\nAll of our PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. You will be well-supported throughout your PGCE, both during your time on placement and on campus.\r\n\r\n\r\nImagine a career where you inspire, motivate, and unlock the full potential of those around you. Teaching is something that can truly make a difference.","website":"https://www.uea.ac.uk/web/about/school-of-education-and-lifelong-learning/initial-teacher-education","latitude":52.6219215,"longitude":1.2391761,"telephone":"(+44) (0)1603 592855","email":"edu.pgce.admiss@uea.ac.uk","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"accredited_body":true,"changed_at":"2022-08-02T13:57:37Z","city":"Norwich","code":"E14","county":"Norfolk","created_at":"2021-07-06T10:57:07Z","name":"University of East Anglia","street_address_1":"University of East Anglia","street_address_2":"Norwich Research Park"},"relationships":{"recruitment_cycle":{"meta":{"included":false}}}},{"id":"17566","type":"providers","attributes":{"ukprn":"10007166","urn":null,"postcode":"WS1 3BD","provider_type":"university","region_code":"west_midlands","train_with_disability":"We have a dedicated Student Support and Wellbeing department within the university offering support services in:\r\n\r\n- Mental Health and Wellbeing: Staff are equipped in supporting students who have mental health needs, or students with an Autism Spectrum Condition. Often, these difficulties overlap and therefore we are here to support you with your overall wellbeing whilst at university.  \r\n\r\n- Disabilities and Specific Learning Difficulties: Including\r\nSpecific learning difficulties: Dyslexia, Dyspraxia, Dyscalculia and\r\nMental Health conditions, Autism Spectrum Conditions including Asperger syndrome, Sensory disabilities including those affecting sight or hearing and Long term medical conditions \r\n\r\n- Counselling: Help is offered in developing your strengths, making decisions and developing the skills and resources to cope. As counsellors, we help you to find the answers.\r\n\r\n- Chaplaincy : Whether you are a person of faith, someone who is searching, someone with questions and doubts, or of no faith, you are welcome in our Chaplaincy building and to receive the support of the Chaplaincy team. We are a team of multi-faith Chaplains and between us we cover all of the University sites.\r\n\r\nFind out more at www.wlv.ac.uk/ssw","train_with_us":"'Be Informed,  Be Inspiring, Be Influential'\r\n\r\nThe University of Wolverhampton is one of the West Midlands’ largest providers of teacher education, with many of our graduates going on to work within the region. Our tutors are all experienced teachers who have worked with our partnership and family schools for many years.\r\n\r\nWe are proud of our long-standing tradition of training teachers of Early Years, Primary, Secondary and Post Compulsory Education. \r\n\r\nAccess to high quality, bespoke subject knowledge enhancement courses.   \r\n\r\nAccess to free Professional Skills Test Support.\r\n\r\nHigh quality learning facilities, including well equipped teaching rooms, cutting edge learning spaces, lecture theatres and a social learning environment.\r\n\r\nA clear progression to  the Early Careers Framework and Master’s degree study, with opportunities to use PGCE credits to embark upon further study following successful completion of the course.\r\n\r\nAccess to leading research in the field of Education that enables trainees to develop as reflective practitioners.\r\n\r\nOFSTED May 2021 said:\r\n \"The partnership provides effective training, both in the university and partner settings, that prepares trainees well to teach their subjects. Trainees learn how to apply relevant research to their teaching. They become reflective practitioners, committed to ongoing professional development. Trainees are also well prepared for the realities of teaching.\"\r\n\r\n \"Staff provide excellent support. University tutors provide effective help with issues such as managing workload and maintaining good mental health and well-being. In partner settings, mentors help to develop trainees’ teaching skills while providing strong professional role models.\"","website":"http://www.wlv.ac.uk/teaching","latitude":52.5739518,"longitude":-1.9710029,"telephone":"01902 321000","email":"enquiries@wlv.ac.uk","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"accredited_body":true,"changed_at":"2022-08-04T10:14:50Z","city":"Walsall","code":"W75","county":"United Kingdom","created_at":"2021-07-06T10:52:11Z","name":"University of Wolverhampton","street_address_1":"Gorway Road","street_address_2":null},"relationships":{"recruitment_cycle":{"meta":{"included":false}}}},{"id":"17275","type":"providers","attributes":{"ukprn":"10058686","urn":null,"postcode":"HP11 1TB","provider_type":"scitt","region_code":"south_east","train_with_disability":"The National Mathematics and Physics SCITT (NMAPS) is committed to equal opportunities and is able to support trainees with additional needs. We will work with trainees to arrange a suitable placement school that can accommodate their needs.\r\n","train_with_us":"[The National Mathematics and Physics SCITT (NMAPS)](http://www.nmapscitt.org.uk/), led by [Wycombe High School](https://www.whs.bucks.sch.uk/), offers high quality specialist teacher training. \r\n\r\nTraining is delivered via our growing network of [Regional Training Hubs](http://www.nmapscitt.org.uk/partnership-structure/). Our current Hub Lead Schools are:\r\n[Bolton School](https://www.boltonschool.org/),\r\n[Camden School for Girls](http://www.camdengirls.camden.sch.uk/)/[Queen Elizabeth's Girls' School - North London Hub](https://www.qegschool.org.uk/),\r\n[Charterhouse](https://www.charterhouse.org.uk/),\r\n[Cheadle Hulme School](https://www.cheadlehulmeschool.co.uk/), [Dulwich College](https://www.dulwich.org.uk/senior-school),\r\n[Oundle School](https://www.oundleschool.org.uk/),\r\n[Warwick School](https://www.warwickschool.org/)/[King's High Warwick](http://www.kingshighwarwick.co.uk/) and\r\n[Wycombe High School](https://www.whs.bucks.sch.uk/)/[Headington School - Chiltern Hub](https://www.headington.org/).\r\n \r\nTraining is delivered by outstanding, practising, teachers of Mathematics and Physics, in this unique collaboration between the state and independent sectors, and in partnership with subject associations such as The Institute of Physics, The Mathematical Association and the National Centre for Excellence in the Teaching of Mathematics (NCETM).\r\n\r\nBecause we only offer training in Maths and Physics, you will benefit from a bespoke programme focused on your subject, with enhanced specialist subject knowledge and pedagogical training to ensure your career gets off to a flying start. NMAPS trainees learn 'on the job' from the very beginning and benefit immediately from the insight into what teaching involves. Trainees are supported to 'find their feet' before delivering classes; schools in the NMAPS network do not require trainees to deliver a lesson unsupported until they are ready so. \r\n\r\nThe NMAPS programme begins with a 3 day residential Induction Course at Headington School in Oxford in late August to prepare you for the year ahead.\r\n","website":"http://nmapscitt.org.uk/","latitude":51.6200519,"longitude":-0.762828,"telephone":"01494 897330","email":"enquiries@nmapscitt.org.uk","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":false,"accredited_body":true,"changed_at":"2022-08-05T10:11:36Z","city":"High Wycombe","code":"2H8","county":"Buckinghamshire","created_at":"2021-07-06T10:48:42Z","name":"The National Mathematics and Physics SCITT","street_address_1":"Marlow Road","street_address_2":""},"relationships":{"recruitment_cycle":{"meta":{"included":false}}}},{"id":"17196","type":"providers","attributes":{"ukprn":"10006840","urn":"133784","postcode":"B15 2TT","provider_type":"university","region_code":"west_midlands","train_with_disability":"The University of Birmingham strives to be an inclusive learning community. Whatever your disability, mental health  or learning support needs, the Disability, Mental Health and Learning Support Service can provide assistance to make sure you that you can access appropriate support. Find out more at: https://www.intranet.birmingham.ac.uk/student/your-wellbeing/disability/index.aspx\r\n","train_with_us":"Our Primary and Secondary teacher training pathways prepare top graduates for a career inspiring learning and transforming lives. We work in partnership with a wide range of primary and secondary schools, sixth form colleges and special schools across Birmingham and the surrounding authorities, to offer both core and School Direct routes into teaching.\r\n\r\nThe School of Education at the University of Birmingham has a long tradition of delivering teacher training courses. Its teaching has been graded as 'outstanding' for the third consecutive time by Ofsted inspectors, reaffirming the University’s status as one of the UK’s leading institutions for excellence in teacher training. ","website":"https://www.birmingham.ac.uk/schools/education/teacher-education/index.aspx","latitude":52.4492736,"longitude":-1.930777,"telephone":"0121 414 4883","email":"iteadmissions@contacts.bham.ac.uk","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"accredited_body":true,"changed_at":"2022-08-17T13:42:54Z","city":"Edgbaston","code":"B32","county":"Birmingham","created_at":"2021-07-06T10:47:52Z","name":"University of Birmingham","street_address_1":"Admissions","street_address_2":"The University of Birmingham"},"relationships":{"recruitment_cycle":{"meta":{"included":false}}}},{"id":"17172","type":"providers","attributes":{"ukprn":"10058551","urn":null,"postcode":"HU14 3HS","provider_type":"scitt","region_code":"yorkshire_and_the_humber","train_with_disability":"Yorkshire Wolds Teacher Training is committed to delivering high quality teacher training that meets the diverse needs of its trainee population, ensuring that no individual or group is disadvantaged. All Yorkshire Wolds trainees are allocated a tutor who will work with each individual throughout the programme, celebrating progress, devising bespoke programmes to respond to individual needs and helping them overcome the challenges they may face.","train_with_us":"Yorkshire Wolds Teacher Training offers an exciting and innovative teacher training programme based in bespoke training facilities at South Hunsley School, an outstanding 11-18 school in the East Riding of Yorkshire. Yorkshire Wolds teacher training is privileged to work with a partnership of over twenty schools, giving trainees the opportunity to work with exceptional teachers in a variety of educational settings across the region. Our programme is designed to prepare trainees to become highly effective teachers, with a love of learning, who will continue to develop their skills throughout their career, through exposure to excellent practice, observation, mentoring, coaching, practice, reflection and sharing with peers. YWTT offers a bespoke training package, where excellent practitioners from across the partnership support the development of our trainees through the professional studies and the school based aspects of the programme. Trainees receive a high level of support throughout the programme to help them develop effective teacher wellbeing strategies as well as application support and interview practice, which result in an excellent employment record. YWTT works closely with Wolds Teaching School Alliance, ensuring our trainees gain the best possible start to their teaching career and access to continued professional development opportunities beyond the initial training year. Last year 100% of our trainees were graded good or better at the end of the training course, with almost 50% being graded outstanding. Please join us on our “Get into Teaching” days to find out more, see https://www.ywtt.org.uk for further details.","website":"ywtt.org.uk","latitude":53.7284536,"longitude":-0.5349145,"telephone":"01482 636720","email":"sally.cooper@ywtt.org.uk","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":false,"accredited_body":true,"changed_at":"2022-07-14T08:13:07Z","city":"Melton","code":"2EV","county":"East Riding of Yorkshire","created_at":"2021-07-06T10:47:35Z","name":"Yorkshire Wolds Teacher Training","street_address_1":"The Education Alliance","street_address_2":"East Dale Road"},"relationships":{"recruitment_cycle":{"meta":{"included":false}}}},{"id":"17841","type":"providers","attributes":{"ukprn":"10007798","urn":null,"postcode":"M13 9PL","provider_type":"university","region_code":"north_west","train_with_disability":"Disabled students make up over 15% of University of Manchester students, and we’re proud to offer an accessible and inclusive service.\r\n\r\nThe Disability Advisory and Support Service (sometimes called the DASS) supports a variety of different people, whether students, staff or supporters. We want to help you succeed - in your studies, work, and the rest of your University experience.\r\n\r\nFor more information please follow this link: http://www.dso.manchester.ac.uk/ \r\n","train_with_us":"The University of Manchester is part of the prestigious Russell Group of universities and our research and teaching quality is recognised across the globe.\r\n\r\nChoose Manchester and you’ll put yourself ahead of the competition when the time comes to begin your career. With an award-winning careers service and courses built with your employability in mind, it’s no surprise that 94% of our trainees find employment at the end of the course. \r\n\r\nBy choosing a PGCE with us, you'll benefit from postgraduate-level study at a highly regarded university and significant school-based teaching experience. We are:\r\n\r\n- Rated as outstanding by Ofsted.\r\n- Best university provider of postgraduate teacher training in the North of England (The Good Teacher Training Guide 2017).\r\n\r\n","website":"https://www.seed.manchester.ac.uk/education/study/pgce/","latitude":53.4668498,"longitude":-2.2338837,"telephone":"0161 306 1311","email":"pgce@manchester.ac.uk","can_sponsor_skilled_worker_visa":false,"can_sponsor_student_visa":true,"accredited_body":true,"changed_at":"2022-09-06T13:14:04Z","city":"Manchester","code":"M20","county":"Greater Manchester","created_at":"2021-07-06T10:55:19Z","name":"The University of Manchester","street_address_1":"Manchester Institute of Education","street_address_2":"Oxford Road"},"relationships":{"recruitment_cycle":{"meta":{"included":false}}}}],"meta":{"count":6}}
