{
  "locationType": "School",
  "accrediting": "2Schools Consortium",
  "provider": "2Schools Consortium (Oakthorpe Primary)",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "151/2THJ",
  "providerCode": "151",
  "programmeCode": "2THJ",
  "schools": [
    {
      "name": "Main Site",
      "address": "Tile Kiln Lane, London, N13 6BY",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Tile Kiln Lane, London, N13 6BY",
      "geocode": true,
      "formatted_address": "Tile Kiln Ln, London N13 6BY, UK",
      "latitude": 51.6145718,
      "longitude": -0.0913377,
      "post_code": "N13 6BY",
      "city": "Greater London",
      "route": "Tile Kiln Lane",
      "postal_town": "London"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "All trainees on the 2Schools Consortium School Direct Salaried Programme have the opportunity to work towards a PGCE (Primary Education) award which will be validated by the University of East London as well as Qualified Teacher Status (awarded by 2Schools Consortium, the Teacher Training provider). \\r\n\\r\nSchool Direct Salaried is an employed (on a minimum of Point 1 on the Unqualified Teacher Scale) training route into becoming a qualified teacher and achieving QTS. The course lasts for one year full-time, from September to July. Most of the course is spent in school, where successful applicants are placed in a class under the supervision and guidance of a mentor.\\r\n\\r\nTRAINING SESSIONS\\r\nTrainees will be required to attend a weekly training session ( at Hazelwood Sports Centre and 2 at UEL Stratford campus) delivered  by a range of experienced teachers and experts.\\r\n\\r\nASSESSMENT\\r\nAssessment of the teaching is carried out regularly through observations of lessons, discussion and feedback on academic tasks and assignments.\\r\n\\r\nTeaching is assessed against Qualified Teacher Status (QTS) Standards, on three teaching practices across two school placements. \\r\n\\r\nA personalised training plan guides the trainee through weekly expectations in and out of class.\\r\n\\r\nCOURSE TIMETABLE\\r\n\\r\nTerm 1:        \\r\n\\r\n* 4 days per week in school, observing and increasing to teaching a minimum of 4 sessions per week\\r\n\\r\n* Every Thursday- training all day\\r\n\\r\n* 2 academic assignments and weekly academic tasks \\r\n\\r\n* Collation of evidence for Standards files \\r\n\\r\nTerm 2:        \\r\n\\r\n* 4 days per week in school in a different KS, then in a different school observing and increasing to 3-4 days teaching\\r\n\\r\n* Most Thursdays- training all day\\r\n\\r\n* 1 academic assignment and weekly academic tasks \\r\n\\r\n* Collation of evidence for Standards files \\r\n\\r\nTerm 3: \\r\n\\r\n* 5 days teaching up to 85% of the week in main placement school\\r\nTraining will take place up to 3 times over the course of the term\\r\n\\r\n* Collation of evidence for Standards files \\r\n\\r\n* Final moderation: one lesson observation, discussion and scrutiny of Standards Files\\r\n\\r\nIf you would like to find out more or have questions please contact us by [post, phone, fax or email](http://www.2schools.org/contact/).\\r\n\\r\nSarah Chuckla, NQT 2018 at Wilbury says: Schools Direct provides you with so many opportunities to observe and learn from other practitioners. The weekly training sessions are filled with useful and practical information for you to use. There is an excellent balance between gaining theoretical knowledge and practical experience. ",
    "CourseLength": "OneYear",
    "SalaryDetails": "Trainee teachers will be employed by their placement school on a minimum of Point 1 on the Unqualified Teacher Scale. The trainee Teacher will not incur any fees.",
    "Qualifications": "* First Degree of a United Kingdom Higher education institution or equivalent, passed at 2.2 or above\\r\n\\r\n* English, Maths and Science GCSE grade 4 or above or the equivalent \\r\n\\r\n* Professional Skills Test in Maths and English \\r\n\\r\nIf your qualifications were awarded abroad, you must submit proof of equivalency from NARIC with your application\\r\n",
    "InterviewProcess": "Applicants are shortlisted by the strategic training team according to a scoring system against our (person specification)[http://www.2schools.org/school-direct/what-are-we-looking-for/].\\r\nand if successful are invited for interview. The interview lasts half a day and usually takes place at the lead school Oakthorpe Primary.\\r\n\\r\nIf successful at interview  candidates will be invited to the next stage in the interview process, which involves the delivery of a half hour literacy or maths session observed by one of the school's leaders and a member from the provider's management board. There will also be time spent in class and candidates will need to take our internally set maths and literacy tests. Maths will be at approximately KS3 level and literacy will be an extended writing task.\\r\n\\r\nApplicants who are successful at interview, are offered a conditional place. These are subject to:\\r\n\\r\n* Satisfactory references\\r\n\\r\n* Satisfactory medical assessment and Disclosure and Barring Service check (DBS)\\r\n\\r\n* National and Local Terms and Conditions of Employment\\r\n\\r\n* Satisfactory completion of between 1 and 5 days in one of our schools (this will depend on your experience)\\r\n\\r\nThe purpose of the additional days in school is to ensure that following the School Direct Programme (Salaried) with us is the right decision for both the candidate and the Consortium. It is also an opportunity for the Consortium to gain information about the candidate to inform the initial needs analysis and the setting of pre-course tasks.\\r\n\\r\nWe run information sessions to support applicants. Please check in our [News & events section](http://www.2schools.org/information-sessions/).",
    "OtherRequirements": "\\r\nSatisfactory criminal record (DBS) check \\r\n",
    "PersonalQualities": "* Ability to work on own initiative and manage own work load \\r\n\\r\n* Ability to combine work and study\\r\n\\r\n* Ability to work cooperatively and effectively with colleagues\\r\n\\r\n* Ability to build relationships with children that promote learning\\r\n\\r\n* Clear and accurate verbal and written communication skills\\r\n\\r\n* An interest in and enjoyment of working with children \\r\n\\r\n* Ability to reflect on own practice and learning and listen to advice \\r\n\\r\n* An understanding of children’s needs\\r\n\\r\n* An understanding of the professional boundaries related to child protection procedures\\r\n\\r\n* Willingness to implement and promote equal opportunities policies\\r\n",
    "HowSchoolPlacementsWork": "Most of the course is spent at the main placement school which will be one of the 30+ primary schools in the partnership across North London in a class under the supervision and guidance of an experienced and supportive mentor (often the class teacher or a senior member of the school’s staff).\\r\n\\r\nTrainees on the course can choose to focus on EYFS and KS1 (3-7) or KS1 and 2 (5-11) but all trainees will be exposed to the primary curriculum and the focai are flexible.\\r\n\\r\nThe course will include a minimum of three placements/practices. One of these practices will take place in a partnership school and in a different KS. Our partnership includes around 40 schools across North London and regularly expands. \\r\n\\r\nExperience in school progresses from observing and working alongside the class teacher, to taking full responsibility, initially for individuals and groups, and later, for a whole class.\\r\n\\r\nThroughout this experience trainees acquire the skills, knowledge and understanding of the range of elements which make an outstanding teacher, as specified in the Teachers’ Standards; from developing good relationships with children that promote learning, with other colleagues to working within a framework and national and school policies to deliver the Curriculum.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The 2Schools Consortium consists of a lead school, Oakthorpe Primary School, Enfield, and a number of partnership schools across North London (Enfield, Harringay, Barnet and Hertfordshire) where trainees are placed.\\r\nOakthorpe has been successfully involved in teacher training since 2002 and has a wealth of experience in mentoring trainees and in delivering training.\\r\nAll trainees on the 2Schools Consortium School Direct Salaried Programme have the opportunity to work towards a PGCE award which will be validated by the University of East London.\\r\n\\r\nQuotes:\\r\n'I’ve had so much fun this year and although it sounds crazy, I just wish I could do it all over again! '\\r\nI feel that this year has changed me in so many different ways and made me so much more comfortable and confident in my teaching'.\\r\nLorne-Rhys Jones, Qualified Teacher, Worcesters Primary School, School Direct Salaried 2017.18\\r\n'Once again very pleased with this year’s trainee. I have been using school direct for 6 years and half my staff next year are from the programme. Without it would not be able to recruit. It has produced wonderful teacher. Thank you.'\\r\nMaria Jay, Headteacher St Michael at Bowes Junior School, June 2018\\r\n",
    "TrainWithDisability": "At 2Schools we want to enable everyone to reach their full potential. After all teaching is the profession that unlocks potential in children. If you do have and declare a disability we will do everything we reasonably can to make special arrangements. Please provide details on your application form so that we can ensure this happens. This will not affect your application.\\r\nWe are committed to provide equality and fairness for all in our recruitment and employment practices and not to discriminate on grounds of age, disability, gender reassignment, marriage/civil partnership status, pregnancy and maternity, race, religion or belief, sex, or sexual orientation. We oppose all forms of unlawful and unfair discrimination.\\r\nWe have regularly successfully supported a number of trainee with dyslexia, mental health conditions and learning difficulties and will continue to provide high level of support for any disability.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "T92"
      }
    ]
  },
  "has_inst": true
}
