{
  "locationType": "School",
  "accrediting": "King's College London (University of London",
  "provider": "Tonbridge Grammar School",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "slug": "1LX/2T56",
  "providerCode": "1LX",
  "programmeCode": "2T56",
  "schools": [
    {
      "name": "Main Site",
      "address": "Deakin Leas, Tonbridge, TN9 2JR",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Deakin Leas, Tonbridge, TN9 2JR",
      "geocode": true,
      "formatted_address": "Deakin Leas, Tonbridge TN9 2JR, UK",
      "latitude": 51.1835912,
      "longitude": 0.2730175,
      "post_code": "TN9 2JR",
      "city": "Kent",
      "route": "Deakin Leas",
      "postal_town": "Tonbridge"
    }
  ],
  "providerAddress": {
    "inst_code": "1LX",
    "addr_1": "Tonbridge Grammar School",
    "addr_2": "Deakin Leas",
    "addr_3": null,
    "addr_4": "Tonbridge",
    "postcode": "TN9 2JR ",
    "url": "https://www.tgs.kent.sch.uk/wanttobeateacher/",
    "geocode": true,
    "formatted_address": "Deakin Leas, Tonbridge TN9 2JR, UK",
    "latitude": 51.1837732,
    "longitude": 0.2736904000000001,
    "post_code": "TN9 2JR",
    "city": "Kent",
    "route": "Deakin Leas",
    "postal_town": "Tonbridge"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "n/a",
    "AboutCourse": "The PGCE Mathematics is a full-time course that consists of four required modules and two blocks of teaching experience based in secondary schools within West Kent. You will complete the course within ten months, studying September to June. You must take modules totalling 120 credits to meet the requirements of the qualification. Two assessed pieces of coursework give you 60 Master’s-level credits – a third of an MA – which puts you well on the way to a Master’s degree in your chosen profession\\r\n\\r\nThe principle of the mathematics course at King’s is a view of teaching based on the process of planning ‐ teaching ‐ reflection. The process looks at relevant research, the principles of the mathematical topic which is being taught and links with other areas of the mathematical curriculum. In general mathematics sessions are workshops where we consider how to build upon pupils’ prior knowledge and address any misconceptions they might have. A sequence of lessons can then be planned to enable successful learning and teaching. Suitable responses from pupils are identified to assess their progress and understanding, and the effectiveness of the teaching approach used.\\r\n\\r\nAdditional areas covered in the mathematics programme include:\\r\n\\r\n-Growth mindset\\r\n-Motivation and engagement\\r\n-Mathematical modelling\\r\n-Problem solving\\r\n-Reasoning and proof\\r\n-Assessment methods\\r\n-Resources beyond textbook\\r\n-Government initiatives\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Ideally you will have a good degree in mathematics. However, there is a significant difference between school mathematics and the wide variety of topics which are studied in mathematics degrees. Therefore degrees with a significant mathematical element are also acceptable (for example, physics, engineering, chemistry, economics). \\r\n\\r\nAll applicants must possess a grade C/ grade 4 in GCSE English and Maths (or equivalent).\\r\n",
    "FeeInternational": 19320.0,
    "FinancialSupport": "n/a",
    "InterviewProcess": "SCHOOL DIRECT: Stage 1 - interview and lesson starter at the training location - Tonbridge. We offer school experience to support potential candidates in their application.\\r\n\\r\nKINGS: Before a place is offered all applicants will be invited to for an interview. The interview is looking to see whether you have a reasonable understanding of mathematics for teaching pupils aged 11‐18 years, to see if you can communicate with an audience, to see that you have prepared yourself for taking a career move towards teaching and to look at your commitment to teaching. You will complete a written task and a mathematics task and an individual interview. The individual interview will explore your views about teaching in general and more specifically teaching some aspects of the secondary mathematics curriculum. \\r\nDuring the individual interview and the mathematics task, we will be looking for:\\r\n-An ability to explain concepts at a school level\\r\n-How you engage with the audience\\r\n-Understanding of the subject you wish to teach\\r\n-Confidence\\r\n\\r\nIn your written task we will be looking for:\\r\n-An ability to express yourself clearly\\r\n-A considered view of the profession you wish to enter\\r\n-Accurate grammar and spelling\\r\n",
    "OtherRequirements": "All applicants for teacher training programmes must pass the Department for Education’s Literacy and Numeracy Skills Tests prior to commencing their teacher training course.\\r\n\\r\nThe Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\\r\n",
    "PersonalQualities": "Personal qualities we look for include:\\r\n-Ability to engage interest and communicate your own enthusiasm for mathematics\\r\n-Commitment to working with young people\\r\n-Ability to explain ideas clearly and to think on your feet\\r\n-Evidence of good interpersonal skills\\r\n-Awareness of current educational issues\\r\n",
    "HowSchoolPlacementsWork": "You will have two different school placements during the course. We work with a large number of schools around West K|ent within easy reach of London and we select school placements carefully, taking into account the teachers who act as mentors and the subjects they offer. \\r\n\\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "School Direct is a route into teaching which moves the focus of study from a university to a school. With School Direct, you are selected by us from day one and we make a commitment not only to your training but to your subsequent employment.\\r\n\\r\nWe are a high achieving selective grammar school with academy status, educating girls between the ages of 11 and 16 and girls and boys in the Sixth Form. We prepare students for GCSEs and the International Baccalaureate. In addition to an extensive curriculum, there is an extensive range of extracurricular activities. [SCHOOL VISION](https://www.tgs.kent.sch.uk/school-vision/)\\r\n\\r\nWe work in partnership with King's College London to provide a tailored programme of training. \\r\n\\r\nDo have a look at our other ITT places with the Kaizen Alliance - under Weald of Kent Grammar School.\\r\n\\r\nAdditionally as a lead school we are able to provide the following :\\r\n\\r\n* Popular school experience placements prior to the starting of the course.\\r\n* Focused school-based Professional Studies.\\r\n* Subject Knowledge knowledge development in a high performing school \\r\n* The opportunity to gain 70 Masters Credits.\\r\n* Training opportunities across our ITT contact schools and the Kaizen Teaching School Alliance.\\r\n* School Placements in differing contexts across our network of schools and Pupil Referral Unit.\\r\n* An SEN experience.\\r\n* Support to secure a teaching position on completion of the course.\\r\n",
    "TrainWithDisability": "To comply with equality legislation, we ensure that interview procedures promote equality of opportunity and avoid discrimination. It is a two stage process with KCL.\\r\n\\r\nApplicants with disabilities are under no obligation to disclose their disabilities. We, together with KCL will ensure that our provision does not place applicants with declared disabilities at a disadvantage. We will consider making anticipatory adjustments to promote positively equality of access for disabled applicants, including access to benefits, facilities and services. \\r\n\\r\nWe will support candidates with disabilities and other needs within our Equality Policy and we have well developed staff well-being programmes.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We have worked with KCL for a number of years. You will do your PGCE taught elements in Central London.  [KING'S INFO](https://www.kcl.ac.uk/sspp/departments/education/study/schooldirect/Information-for-Trainees.aspx)",
        "UcasInstitutionCode": "K60"
      }
    ]
  },
  "has_inst": true
}
