{
  "locationType": "School",
  "accrediting": "Canterbury Christ Church University",
  "provider": "Dover Deal Sandwich Partnership",
  "subjects": [
    "Secondary"
  ],
  "name": "Computing",
  "slug": "1CG/3743",
  "providerCode": "1CG",
  "programmeCode": "3743",
  "schools": [
    {
      "name": "Sandwich Technology School",
      "address": "Deal Road, Sandwich, CT13 0FA",
      "code": "V"
    }
  ],
  "addresses": [
    {
      "address": "Deal Road, Sandwich, CT13 0FA",
      "geocode": true,
      "formatted_address": "Deal Rd, Sandwich CT13 0FA, UK",
      "latitude": 51.2641874,
      "longitude": 1.337717,
      "post_code": "CT13 0FA",
      "city": "Kent",
      "route": "Deal Road",
      "postal_town": "Sandwich"
    }
  ],
  "providerAddress": {
    "inst_code": "1CG",
    "addr_1": "Dover Deal Sandwich Partnership",
    "addr_2": "Sandwich Technology School",
    "addr_3": "Deal Road",
    "addr_4": "Sandwich",
    "postcode": "CT13 0FA",
    "url": null,
    "geocode": true,
    "formatted_address": "Deal Rd, Sandwich CT13 0FA, UK",
    "latitude": 51.265011,
    "longitude": 1.335203,
    "post_code": "CT13 0FA",
    "city": "Kent",
    "route": "Deal Road",
    "postal_town": "Sandwich"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 5960.0,
    "FeeDetails": "Non-salaried trainees fund training fees themselves, unless the partner school offer to pay. Depending on bursaries and scholarships available, students may find the non-salaried route more financially attractive than a salaried position.",
    "AboutCourse": "Why School Direct?\\r\nSchool Direct is a training programme for both graduates and career changers, where you can be fully immersed in the life of a teacher from day one. It gives the trainee the chance to work and learn alongside teachers within the full time setting of a school. It is a popular choice for those training to be a teacher who hope to secure a teaching post in the network of schools where they are training.\\r\nSchool Direct courses within the DDS Partnership are designed in partnership with Canterbury Christ Church University based on the skills they are looking for in a newly qualified teacher. We are part of a growing number of schools leading the way for more school-led teacher training. This is really important to us because it means we can choose the very best talent and develop them into teachers. Being able to choose who we train as teachers helps us to deliver the best outcomes for the students.\\r\nWhat will I learn?\\r\nBy the end of your training course you will:\\r\n- Set high standards which inspire, motivate and challenge pupils\\r\n- Promote good progress and outcomes by pupils\\r\n- Demonstrate good subject and curriculum knowledge\\r\n- Plan and teach well-structured lessons\\r\n- Adapt teaching to respond to the strengths and needs of all pupils\\r\n- Make accurate and productive use of assessment\\r\n- Manage behaviour effectively to ensure a good and safe learning environment\\r\nThis course is offered as school direct non salaried (tuition fee)\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "The minimum criteria is:\\r\n-\\tA good honours degree (at least 2:2)\\r\nWe look for 50% of the degree in the subject you intend to teach but if your degree isn’t in the subject you wish to teach, you may be eligible for a funded course to increase your subject knowledge before starting training.\\r\n-\\tGCSE’s in Math’s, English, grade C or above.\\r\n-\\tNARIC equivalency certificates for any degree or school qualification gained outside the United Kingdom. For further information visit [www.naric.org.uk/naric]\\r\n-\\tFor the Salaried route - 3 years full time work experience\\r\n",
    "FeeInternational": 12000.0,
    "FinancialSupport": "Your eligibility for financial support, and the amount you can expect to receive, will depend on the subject you choose to teach and your degree classification or highest relevant academic qualification. Any applications for bursaries and Student Finance are the responsibility of the individual trainee.",
    "InterviewProcess": "Once you have applied through UCAS applicants will know as to whether they have been successful within 40 school days. If your initial application is of interest, you will have a formal interview at the Partner school that you have applied to. Each school will send you in advance the full details of their individual process. On that day you will be asked to undertake Literacy and Numeracy tests provided by Canterbury Christ Church University (different from the Skills Tests you have done/will do online). You will also be asked to lead part of a lesson - details of the observation year group (including SEN), the topic and focus will be provided in advance. The interview process is not designed to test your abilities to teach now, but on your potential to be trained on the programme.\\r\nThe interview day is likely to include a tour of the school and meet with departmental staff to give you an idea of the environment you will be working in.\\r\nIf you would like to visit any of the schools within the partnership prior to submitting an application, we would be happy to organize for you to come in and have a chat with us about the exciting teacher training opportunities available.\\r\nWe can also provide you with support and guidance on your application form and offer you school experience if you just want a taster of what teaching could be like.\\r\n",
    "OtherRequirements": "The DDS Partnership is committed to safeguarding and promoting the welfare of children. Applicants must be willing to undergo child protection screening, including an enhanced disclosure check.\\r\nFor further information on what becoming a teacher might involve more generally, you can also visit\\r\n[www.education.gov.uk/get-into-teaching]\\r\n",
    "PersonalQualities": "A great teacher is one a student remembers and cherishes forever; teachers have long-lasting impacts on the lives of their students. As a partnership we have successfully trained teachers from a wide range of backgrounds, all with different experiences prior to making the decision to teach. Whatever your background you will need to be patient and caring with a love of your subject. A willingness to dedicate yourself to the success and well-being of the students is essential.",
    "HowSchoolPlacementsWork": "The key feature of this course is that the majority of the year is spent on placement working alongside experienced colleagues in schools. The course aims to harness the knowledge and experience of school colleagues in the delivery of courses, working in partnership with the experience of an accredited ITT provider. Each trainee is allocated a mentor who will support you over the course of the year. They will design a training programme based on your needs, ensuring that you have a broad and varied experience. Each trainee will also spend at least 20 days in a second school within the partnership in order to gain experience of a different setting."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Dover, Deal and Sandwich Partnership is a group of like-minded schools that work together for the good of the students in our community. We believe in giving our young people access to first class teachers and, collectively, are committed to investing in the teachers of the future.  \\r\n\\r\nA training course within our partnership includes:\\r\n* A placement at the school of your choice\\r\n* An induction programme based on your own training needs\\r\n* Classroom experience at two contrasting schools within the Partnership\\r\n* Support from fully trained mentors and experienced teachers\\r\n* A fully comprehensive and up to date curriculum studies and professional studies programme enabling you to meet regularly with other Partnership student teachers\\r\n* Access within your training to a range of teaching styles and methodology\\r\n* Continued support to achieve QTS\\r\n\\r\nDDS schools within our partnership:\\r\n\\r\n* Astor College\\r\n* Barton Junior School\\r\n* Dover Christ Church Academy\\r\n* Dover Grammar School for Boys\\r\n * Dover Grammar School for Girls\\r\n* Eastry Primary School\\r\n* Goodwin Academy\\r\n* Preston Primary School\\r\n* Sandwich Infant School\\r\n* Sandwich Technology School\\r\n* Shatterlocks Infant & Nursery School\\r\n* Sir Roger Manwood’s School\\r\n* St Joseph’s Catholic Primary School\\r\n* White Cliffs Primary College for the Arts\\r\n\\r\nAn overview of the schools within our partnership can be found on our website [DDSPartnership.org] (www.ddspartnership.org)",
    "TrainWithDisability": "As a partnership we are committed to equal opportunities and supporting both students and staff with disabilities and learning needs. Each of our partner schools will be happy to discuss any requirements you may have to ensure a successful training experience.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "At Canterbury Christ Church University, courses are designed to give you the higher education you want, and the skills you need. You will experience high quality teaching, as shown by the Silver Teaching Excellence Framework (TEF) rating, and you can be assured that you are choosing a university with a strong track record for ensuring students of all abilities, and from all backgrounds, succeed and reach their full potential. ",
        "UcasInstitutionCode": "C10"
      }
    ]
  },
  "has_inst": true
}
