{
  "locationType": "School",
  "accrediting": "The Pilgrim Partnership School Centred Teacher Training",
  "provider": "The Pilgrim Learning Teaching School Alliance",
  "subjects": [
    "French",
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages (French)",
  "slug": "235/2PMR",
  "providerCode": "235",
  "programmeCode": "2PMR",
  "schools": [
    {
      "name": "Main Site",
      "address": "Station Road, Oakley, Bedford, Bedfordshire, MK43 7RE",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Station Road, Oakley, Bedford, Bedfordshire, MK43 7RE",
      "geocode": true,
      "formatted_address": "Station Rd, Oakley, Bedford MK43 7RE, UK",
      "latitude": 52.16845619999999,
      "longitude": -0.5198112,
      "post_code": "MK43 7RE",
      "city": "Oakley",
      "route": "Station Road",
      "postal_town": "Bedford"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "The School Direct (salaried) route is for trainees with experience of working for at least two years after completing their degree.  If a school feels you have the necessary knowledge and skills to teach, and they cannot find a suitably qualified alternative they can employ you as a salaried trainee for four days a week and give you ownership of your own classes from the start of the course. \\r\n\\r\nThe training sessions will be led by expert practitioners who work in our excellent partner schools to develop your knowledge, skills and understanding of effectively teaching lessons in a secondary school across all key stages where applicable.\\r\n\\r\nAt school you will have an appointed mentor who will work in the school and provide support for planning and delivering your own lessons.  You will receive regular feedback to further develop your teaching and learning strategies and be fully supported by your school, department and by the Pilgrim team.\\r\n\\r\nAs part of the programme trainees will complete a contrasting school placement and have focus days to enhance your expertise and understand SEND and for other specialist areas of education.\\r\nA programme of continuous formative assessment of trainees' subject knowledge and ability to teach, as recorded within the portfolio, culminates in a rigorous assessment of the Teachers' Standards for Qualified Teacher Status (QTS) as specified by the Department for Education (DfE).  As an accredited provider, the partnership recommends trainees, on successful completion of their training programme for Qualified Teacher Status (QTS).\\r\n\\r\nSome trainees will also be able to study for a PGCE alongside the QTS, this is dependent on the qualification criteria being met.\\r\n",
    "CourseLength": "OneYear",
    "SalaryDetails": "The trainee will be paid at xxxx on the unqualified teacher's  pay scale.\\r\n\\r\nYou will not be required to pay any fees.",
    "Qualifications": "Candidates are required to have:\\r\n\\r\n* GCSE or equivalent qualification, at Grade C/level 4 or above in English and mathematics\\r\n* A level or equivalent Level 3 qualification in the subject or a related subject they wish to train to teach\\r\n* A lower second class degree in the subject they wish to train to teach in or a degree in a related subject.  We would also consider a third class degree for candidates who demonstrate a real aptitude for teaching.\\r\n* Professional Skills Tests in Literacy and Numeracy\\r\n\\r\nOverseas qualifications should be verified by NARIC\\r\n",
    "InterviewProcess": "Candidates who meet the entry requirements will be invited to interview.\\r\n\\r\nThe interview will take place at a partner school and involve staff from both SAF Pilgrim Partnership and one or more partner schools.\\r\n\\r\nPlease note that the venue of your interview has no bearing on the school you will be placed in should you be successful.\\r\n\\r\nFurther information will be forwarded to candidates invited to interview to enable them to prepare for the interview.\\r\n",
    "OtherRequirements": "\\r\n* Declaration of any convictions declared on your UCAS application\\r\n* An Enhanced DBS Disclosure will be required follow an offer of a place\\r\n* A satisfactory health questionnaire will be required follow an offer of a place\\r\n* Satisfactory clearance for registration\\r\n",
    "PersonalQualities": "SAF Pilgrim Partnership, as the accredited provider, and its partners are looking for ambitious trainee teachers who are passionate and enthusiastic about working with students.  The programme is challenging, and so we are looking for candidates with a wide range of skills, knowledge, experiences and an aptitude for teaching\\r\n\\r\nAs a minimum, the provider would like candidates to have completed some classroom observation or have some experience of working with students in a teaching/leading role before making an application but this is not compulsory.  Candidates should be aware of contemporary issues in education.\\r\n",
    "HowSchoolPlacementsWork": "Trainees will have two school placements in addition to other placements visits during the programme and will be supported by mentors and the Pilgrim team, trainees will also spend time in a special school.\\r\n\\r\nTrainees will be allocated a school taking into account where they live and the school will be either 11-16 age range or 11 to 18.\\r\n\\r\nInitially trainees will spend three days in the school placements and two days in training sessions/workshops.  This increases to four days in a school placement and one day training each week.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "If you are considering teacher training on a one year course leading to Qualified Teacher Status (QTS) with a PGCE, SAF Pilgrim Partnership as part of Sharnbrook Academy Federation (SAF) may be the provider for you.  We pride ourselves in being able to offer a personalised training programme with a journey that begins as soon as you contact us.  We will guide you all the way, from 'just thinking about teaching', getting your first job, to offering you advice and guidance about your continuing career development.\\r\n\\r\nWe offer a variety of training programmes to suit individual needs.  This includes the Schools Direct - salaried and tuition fee routes and the SCITT route.  If you are interested in working with children with Special Educational Needs and Disabilities (SEND), we work with a number of Special Schools.\\r\n\\r\nWith us, you will be choosing a provider with a proven track record for producing outstanding teachers for schools within our partnership which covers Bedfordshire, Northamptonshire, Hertfordshire, Cambridgeshire, Milton Keynes and beyond.\\r\n\\r\nTrainee experiences are designed to meet individual needs from the start of the course, encouraging trainees to progress quickly and effectively into proficient teachers. \\r\n\\r\nOur courses are highly effective in nurturing the talents of future generations of outstanding teachers.  We believe in fostering reflective, self-assured trainees who are confident in questioning and rationalising their progress and ability as teachers.\\r\n\\r\nTrainees will be trained in a highly supportive and aspirational environment, and will develop the rigour, professional knowledge, understanding and skills necessary for teaching.\\r\n",
    "TrainWithDisability": "SAF Pilgrim Partnership is committed to the employment and career development of disabled people.\\r\n\\r\nWhat do we mean by disability?\\r\nThe Disability Discrimination Act, 1995 defines a disabled person as someone who has a physical or mental impairment, which has a substantial and adverse long-term effect on his or her ability to carry out normal day-to-day activities.\\r\n\\r\nWe have been successful in working with trainees who have either a physical or mental impairment to become effective classroom practitioners.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "P57"
      }
    ]
  },
  "has_inst": true
}
