{
  "locationType": "School",
  "accrediting": "The University of Reading",
  "provider": "Wokingham Secondary Federation",
  "subjects": [
    "Art and design",
    "Secondary"
  ],
  "name": "Art and Design",
  "financial_support": "Student finance if you’re eligible",
  "slug": "152/2JV4",
  "providerCode": "152",
  "programmeCode": "2JV4",
  "schools": [
    {
      "name": "Main Site",
      "address": "Twyford Road, Wargrave, Reading, RG10 8DS",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Twyford Road, Wargrave, Reading, RG10 8DS",
      "geocode": true,
      "formatted_address": "Reading RG10 8DS, UK",
      "latitude": 51.4903831,
      "longitude": -0.8712631,
      "post_code": "RG10 8DS",
      "city": "Wokingham",
      "route": null,
      "postal_town": "Reading"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK).  You will also need to have achieved Grade 4 (or C) or above in GCSE Mathematics and English Language (or equivalent qualifications).\\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.\\r\n",
    "InterviewProcess": "Applicants called to interview will be interviewed in one of its schools on behalf of The Federation.\\r\n\\r\nThe interview process, which typically takes about 3 hours, will consist of:\\r\n\\r\n* an introductory meeting\\r\n* a written task\\r\n* a teaching task with a small group of students\\r\n* a formal interview\\r\n\\r\nSome candidates may also be asked to answer questions from a student panel and others may be asked to observe a lesson and share observations of the lesson later on.\\r\n\\r\n",
    "PersonalQualities": "We are looking for applications from people who have the desire, passion and determination to be outstanding teachers. The Wokingham Federation is proud of its schools and they are keen to work with trainees who would like to be a part of it, at least for a year and possibly for longer.",
    "HowSchoolPlacementsWork": "Trainees will work in two of The Federation's eight mainstream secondary schools. Please see [http://wokinghamfederation.co.uk/home/schools/] for details of the schools.\\r\n\\r\nDuring the course of the year, all trainees will have experience of teaching all years from Years 7 - 13 and will work with both GCSE and A Level groups.\\r\n\\r\nTo ensure they are fully supported during the course, trainees have a mentor at their schools and a tutor with the University, both of whom work closely with them throughout the year.\\r\n\\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Wokingham Secondary Federation is a close partnership of schools whose aim is to support collaboration in order to raise the standards of students’ achievement across the borough. High quality ITT provision is an integral part of its work. \\r\n\\r\nPlease see [The Wokingham Federation](www.wokinghamfederation.co.uk) to see more detail of our schools.\\r\n\\r\nThe Federation is extremely proud of its work with ITT trainees, many of whom stay on each year to work as teachers in one of our schools.\\r\n\\r\nAny applicant successfully awarded a place with us will work in two Federation schools, all of which are in close proximity of Wokingham, a town which is often named as one of the best places in the country to live.\\r\n",
    "TrainWithDisability": "Both The Wokingham Federation and its partner providers are committed to equal opportunities.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The University of Reading’s Institute of Education is an established provider of high-quality training and research.  it is ranked 8th in the UK for Education (The Guardian University League Table 2019) and has been consistently in the top 10 for over a decade.\\r\n\\r\nCommitted to developing caring, reflective, professional teachers, it has well-established partnerships with over 300 schools in Berkshire and the surrounding area. \\r\n\\r\nOfsted report that the \"effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region's schools.'' I(TE inspection report, September 2016.)\\r\n \\r\n",
        "UcasInstitutionCode": "R12"
      },
      {
        "Description": "Teach SouthEast delivers high quality bespoke school-centred programmes for aspiring teachers. All involved in the programme are passionate about training and developing outstanding teachers of the future and 100% of all trainees completing the course have passed with QTS.\\r\n\\r\nFor the PGCE, Teach SouthEast works in partnership with the University of Sussex. Trainees have the opportunity to go to the University on a number of occasions to work there and to access keynote lectures. \\r\n\\r\nEvery trainee benefits from a strong support system as well as having individual named tutors to whom they can turn for advice and support. \\r\n",
        "UcasInstitutionCode": "2EW"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "U80"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "O33"
      }
    ]
  },
  "has_inst": true
}
