{
  "locationType": "School",
  "accrediting": null,
  "provider": "The Grand Union Training Partnership",
  "subjects": [
    "English",
    "Secondary"
  ],
  "name": "English",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "G60/Q3X1",
  "providerCode": "G60",
  "programmeCode": "Q3X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Sponne School, Brackley Road, Towcester, Northamptonshire, NN12 6DJ",
      "code": ""
    },
    {
      "name": "Caroline Chisholm Campus",
      "address": "Wooldale Road, Wootton Fields, Northamptonshire, NN4 6TP",
      "code": "D"
    },
    {
      "name": "Shenley Brook End",
      "address": "MK5 7ZT",
      "code": "E"
    },
    {
      "name": "Magdalen Campus",
      "address": "Waynflete Avenue, Brackley, Northamptonshire, NN13 6FB",
      "code": "F"
    },
    {
      "name": "Guilsborough Campus",
      "address": "West Haddon Road, Guilsborough, Northamptonshire, NN6 8QE",
      "code": "G"
    },
    {
      "name": "The Hazeley Academy",
      "address": "Emperor Drive, Hazeley, Milton Keynes, MK8 0PT",
      "code": "H"
    },
    {
      "name": "Elizabeth Woodville Campus",
      "address": "Stratford Road, Deanshanger, Milton Keynes, MK19 6HN",
      "code": "W"
    },
    {
      "name": "Moulton Campus",
      "address": "Pound Lane, Moulton, Northamptonshire, NN3 7SD",
      "code": "X"
    }
  ],
  "addresses": [
    {
      "address": "Sponne School, Brackley Road, Towcester, Northamptonshire, NN12 6DJ",
      "geocode": true,
      "formatted_address": "Brackley Rd, Towcester NN12 6DJ, UK",
      "latitude": 52.1321314,
      "longitude": -0.9936887,
      "post_code": "NN12 6DJ",
      "city": "Northamptonshire",
      "route": "Brackley Road",
      "postal_town": "Towcester"
    },
    {
      "address": "Wooldale Road, Wootton Fields, Northamptonshire, NN4 6TP",
      "geocode": true,
      "formatted_address": "Wooldale Rd, Northampton NN4 0TG, UK",
      "latitude": 52.20062309999999,
      "longitude": -0.8746777,
      "post_code": "NN4 0TG",
      "city": "Northamptonshire",
      "route": "Wooldale Road",
      "postal_town": "Northampton"
    },
    {
      "address": "MK5 7ZT",
      "geocode": false
    },
    {
      "address": "Waynflete Avenue, Brackley, Northamptonshire, NN13 6FB",
      "geocode": true,
      "formatted_address": "Waynflete Ave, Brackley NN13 6AG, UK",
      "latitude": 52.0297779,
      "longitude": -1.1511447,
      "post_code": "NN13 6AG",
      "city": "Northamptonshire",
      "route": "Waynflete Avenue",
      "postal_town": "Brackley"
    },
    {
      "address": "West Haddon Road, Guilsborough, Northamptonshire, NN6 8QE",
      "geocode": true,
      "formatted_address": "W Haddon Rd, Guilsborough, Northampton NN6 8QL, UK",
      "latitude": 52.35421580000001,
      "longitude": -1.0174614,
      "post_code": "NN6 8QL",
      "city": "Guilsborough",
      "route": "West Haddon Road",
      "postal_town": "Northampton"
    },
    {
      "address": "Emperor Drive, Hazeley, Milton Keynes, MK8 0PT",
      "geocode": true,
      "formatted_address": "Emperor Drive, Milton Keynes, Hazeley MK8 0PT, UK",
      "latitude": 52.0194674,
      "longitude": -0.8116337,
      "post_code": "MK8 0PT",
      "city": "Milton Keynes",
      "route": "Emperor Drive",
      "postal_town": "Hazeley"
    },
    {
      "address": "Stratford Road, Deanshanger, Milton Keynes, MK19 6HN",
      "geocode": true,
      "formatted_address": "Stratford Rd, Deanshanger, Milton Keynes MK19 6HN, UK",
      "latitude": 52.0505254,
      "longitude": -0.8793964,
      "post_code": "MK19 6HN",
      "city": "Deanshanger",
      "route": "Stratford Road",
      "postal_town": "Milton Keynes"
    },
    {
      "address": "Pound Lane, Moulton, Northamptonshire, NN3 7SD",
      "geocode": true,
      "formatted_address": "Pound Ln, Moulton, Northampton NN3 7PL, UK",
      "latitude": 52.28855309999999,
      "longitude": -0.8565856,
      "post_code": "NN3 7PL",
      "city": "Moulton",
      "route": "Pound Lane",
      "postal_town": "Northampton"
    }
  ],
  "providerAddress": {
    "inst_code": "G60",
    "addr_1": "Sponne School",
    "addr_2": "Brackley Road",
    "addr_3": "Towcester",
    "addr_4": "Northamptonshire",
    "postcode": "NN12 6DJ",
    "url": "http://www.gutp.co.uk",
    "geocode": true,
    "formatted_address": "Brackley Rd, Towcester NN12 6DJ, UK",
    "latitude": 52.1321314,
    "longitude": -0.9936887,
    "post_code": "NN12 6DJ",
    "city": "Northamptonshire",
    "route": "Brackley Road",
    "postal_town": "Towcester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Course introduction\\r\nThe University of Portsmouth's PGCE Initial Teacher Training Secondary in English is a one-year, full-time course for graduates who wish to train as secondary school English teachers. It is run by the University's School of Education and Continuing Studies and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level) or the Postgraduate Certificate in Education (with 60 credits towards a Master's degree). \\r\n\\r\nEnglish is a core subject of the secondary curriculum at Key Stage 3 and 4. English is an engaging and constantly evolving subject in the school curriculum. On the PGCE course you will learn not only about issues related to English teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \\r\n\\r\nCourse aims\\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers' Standards. \\r\n\\r\nMode of study\\r\nThis is a one-year full-time course (36 weeks). \\r\n\\r\nCourse outline\\r\nThe English course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with mentors and other school staff. \\r\n\\r\nThroughout the year you will be engaged in considering a range of subjects including: \\r\n\\r\n*subject knowledge enhancement\\r\n*ICT in the classroom\\r\n*lesson planning\\r\n*classroom management\\r\n*special needs and inclusion\\r\n*assessment\\r\n*creative learning\\r\n\\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school's teaching staff. You will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom. ",
    "CourseLength": "OneYear",
    "Qualifications": "An honours degree in a relevant subject, with approximately 50% English content and a classification of at least 2:1.  GCSE Mathematics and English language at grade C (Grade 4) or above, or equivalent. ",
    "OtherRequirements": "All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. All applicants must pass the National College for Teaching and Leadership's professional skills tests in literacy and numeracy before starting the course.",
    "HowSchoolPlacementsWork": "School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Grand Union Training Partnership is a school-centred initial teacher training (SCITT) consortium centred on a number of 11-18 comprehensive schools situated in villages and small towns West of Northampton and in Milton Keynes. \\r\n\\r\nWe provide Secondary PGCE courses in Business Studies, English, History, Modern Foreign Languages, Physical Education, Maths, Geography, Computer Science, Physics, Chemistry and Biology. \\r\n\\r\nWe aim to give trainees, whom we refer to as Associate Teachers, as much practical experience of working in the Partnership schools as possible. Each Associate Teacher's work and programme of study is supervised by a Mentor (School Based Tutor) who will take a close interest in their development as a subject teacher and colleague. This part of the course is complemented by general professional studies. \\r\n\\r\nOur overall aim is to produce reflective professionals confident in applying for and starting their first jobs as secondary school teachers. Over half of our Associate Teachers take up their first teaching posts in the scheme's Partnership schools. ",
    "TrainWithDisability": "In addition to supporting our Associate Teachers in any way we can, we are committed to providing additional support where possible and necessary.\\r\n\\r\nPrior to the start of our course, we ask all Associate Teachers to consider whether or not they have a disability within the statutory definition.  It is important that we gather this information because The GUTP is committed to ensuring that all of our Associate Teachers are treated fairly and that we do not inadvertently make decisions or have processes that may treat any one less well on the basis of any disability. We also wish to offer appropriate support to all our trainees, whatever their circumstances.  All information given to us is treated with sensitivity and held in confidence.  \\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
