{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Worcester",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Student finance if you’re eligible",
  "slug": "W80/X9C6",
  "providerCode": "W80",
  "programmeCode": "X9C6",
  "schools": [
    {
      "name": "Main Site",
      "address": "Henwick Grove, Worcester, WR2 6AJ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Henwick Grove, Worcester, WR2 6AJ",
      "geocode": true,
      "formatted_address": "Worcester WR2 6AJ, UK",
      "latitude": 52.1975549,
      "longitude": -2.2430422,
      "post_code": "WR2 6AJ",
      "city": "Worcestershire",
      "route": null,
      "postal_town": "Worcester"
    }
  ],
  "providerAddress": {
    "inst_code": "W80",
    "addr_1": "Henwick Grove",
    "addr_2": "Worcester",
    "addr_3": "Worcestershire",
    "addr_4": null,
    "postcode": "WR2 6AJ ",
    "url": "http://www.worcester.ac.uk",
    "geocode": true,
    "formatted_address": "Henwick Grove, Worcester WR1 3JE, UK",
    "latitude": 52.201139,
    "longitude": -2.237474,
    "post_code": "WR1 3JE",
    "city": "Worcestershire",
    "route": null,
    "postal_town": "Worcester"
  },
  "options": [
    "PGCE with QTS, full time or part time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Physical Education course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of physical education; these staff are supported by expert practitioners from local schools.\\r\n\\r\nOur excellent teaching facilities, including a sports hall and gymnasium with extensive resources and equipment, will provide the setting for your practical teaching.\\r\n\\r\nThe content of the programme is grounded in the evidence-based principles of teaching and learning. You will examine a range of pedagogical approaches to physical education teaching, including workshop-led and informal approaches to learning. Other teaching methods include a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education at the University of Worcester has a long-standing reputation for training excellent, highly employable teachers. You will be supported by a dynamic team of tutors who have been outstanding school teachers and are now regarded as education experts with national profiles in a wide range of secondary subjects. \\r\n\\r\nOur courses provide unique opportunities. Trainee teachers may if they wish add depth to their qualifications by involvement in additional enhancement programmes in key areas, such as Special Educational Needs and Disabilities; working with learners who have English as an Additional Language; developing expertise in Citizenship; developing skills in a second STEM subject; preparing to be Education Leaders, or developing skills in Technology Enhanced Learning. These popular enhancements to your training build your confidence as well as greatly enhancing your employability. \\r\n\\r\nYou will benefit from our excellent partnerships with secondary schools across the West Midlands, where our highly-trained mentors pay close attention to your individual development within a friendly and professional context. We also offer pre-training Subject Knowledge Enhancement courses in a range of subjects (Biology, Chemistry, Computer Science, Design and Technology (Food & Textiles), English, French, Geography, Mathematics, Physics) for those who need them and our PGCE offers Master's-level credits as well as Qualified Teacher Status. ",
    "TrainWithDisability": "The University of Worcester offers a wide range of support and advice to disabled students and also to parents, staff and those external agencies supporting disabled students.\\r\n\\r\nOur Disability and Dyslexia Service offers support, advice and guidance to students who have a disability, medical condition or Specific Learning Difficulty (SpLD). This support lasts throughout a student’s studies at the University of Worcester. We also work with and offer support and advice to University staff on how to meet the needs of disabled students.\\r\n \\r\n* Supporting disabled students with general enquiries\\r\n* Implementing special arrangements for lectures, exams and field trips. This might include notes in advance or special arrangements in exams.\\r\n* Where appropriate, we can arrange note takers, academic support tutors, library assistance, interpreters and transcribers.\\r\n* Help with applying for the Disabled Students Allowance (DSA) which is there to fund these types of support in higher education.\\r\n* Limited loans of equipment\\r\n* Confidential advice and support for students and staff\\r\n* Training and awareness raising workshops\\r\n* Assistive technology ",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
