{
  "locationType": "School",
  "accrediting": "University of Southampton",
  "provider": "Bitterne Park Teaching School Alliance",
  "subjects": [
    "French",
    "German",
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages (French and German)",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1F6/37FV",
  "providerCode": "1F6",
  "programmeCode": "37FV",
  "schools": [
    {
      "name": "Pewsey Vale School",
      "address": "Wilcot Road, Pewsey, Wiltshire, SN9 5EW",
      "code": "V"
    }
  ],
  "addresses": [
    {
      "address": "Wilcot Road, Pewsey, Wiltshire, SN9 5EW",
      "geocode": true,
      "formatted_address": "Wilcot Rd, Pewsey SN9 5NL, UK",
      "latitude": 51.3405717,
      "longitude": -1.7746259,
      "post_code": "SN9 5NL",
      "city": "Wiltshire",
      "route": "Wilcot Road",
      "postal_town": "Pewsey"
    }
  ],
  "providerAddress": {
    "inst_code": "1F6",
    "addr_1": "Bitterne Park School",
    "addr_2": "1 Copsewood Road",
    "addr_3": "Bitterne Park",
    "addr_4": "Southampton",
    "postcode": "SO18 1BU",
    "url": "http://www.bitterneparkschool.org.uk/teaching-schools",
    "geocode": true,
    "formatted_address": "Bitterne Park School, Dimond Rd, Southampton SO18 1BU, UK",
    "latitude": 50.9296638,
    "longitude": -1.3694176,
    "post_code": "SO18 1BU",
    "city": "Southampton",
    "route": "Dimond Road",
    "postal_town": "Southampton"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Trainees on a School Direct non-salaried training course currently pay tuition fees of £9250. You will be eligible for the same financial support as other fee paying postgraduate teacher training routes. There are bursaries and scholarships of up to £28000 depending on your subject choice. More information can be found at: https://getintoteaching.education.gov.uk/funding-and-salary/overview\\r\n \\r\nTrainees on a School Direct salaried course are employed by their school. Salaried trainees are paid on point one of the unqualified teacher pay scale and will normally be issued with a 0.8 fte contract. The cost of your training to achieve QTS and PGCE is covered by the school. This route is only available in English and mathematics, and is open to graduates with three years' career experience. \\r\n\\r\nInternational students currently pay tuition fees of £17546",
    "AboutCourse": "Working in partnership with the University of Southampton, we have developed a bespoke teacher training package to maximise the strengths of the schools across our alliance.  Our School Direct training programme combines the best elements of a traditional university-led PGCE training model with the benefits of a school-centred approach.  Southampton University has a long-established record of excellent initial teacher training, and successful completion of course will lead to Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE).  The programme also contributes towards Master's level accreditation.\\r\n\\r\nOur core training involves: \\r\n\\r\n* a half term induction at the start of the programme;\\r\n* a progressive training programme delivered each Friday throughout the year;\\r\n* a half term second school placement in a contrasting school; and\\r\n* a primary, sixth form and SEN school experience.\\r\n\\r\nOur course encompasses the following strands: \\r\n\\r\n* Developing subject knowledge\\r\n* The trainee's subject, school and the wider context\\r\n* Understanding pupil learning\\r\n* Planning and evaluation for teaching and learning\\r\n* Classroom strategies for teaching and learning\\r\n* Assessment, recording and reporting\\r\n* The wider professional role\\r\n\\r\nThroughout the programme, you will be supported by a highly skilled and trained mentor at your school, a professional mentor (a member of your school's senior leadership team) and a university tutor.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "The minimum entry requirements are as follows: \\r\n\\r\n* You should have an honours degree from a UK university, HE institution or an acceptable recognised equivalent, with a minimum of a 2:2 or above.\\r\n* The subject content of your degree should meet the requirements of your chosen specialist subject. (If you are unsure, please contact us.)\\r\n*  If you have an overseas qualification, you should apply for a NARIC Statement of Comparability to confirm its comparable level in the UK.\\r\n* You should have GCSE grade C or 4 in English Language and Mathematics, or an acceptable recognised equivalent. ",
    "FeeInternational": 17546.0,
    "InterviewProcess": "Once shortlisting has taken place, we will contact you to confirm whether you have been selected for interview. The interview process consists of: \\r\n\\r\n* a formal interview with representatives from our partnership schools and the University of Southampton; \\r\n* a written task or presentation; and\\r\n* a teaching activity. \\r\n\\r\nThe selection panel will take evidence from all aspects of the interview into consideration when making their judgement. \\r\n\\r\nIf you are successful at interview, you may request a visit the school where your main placement will be, so that you can meet the staff that will be involved in your training. \\r\n\\r\nUnsuccessful applicants will be offered feedback on their interview.",
    "OtherRequirements": "Before you start our course, we will ask you to complete:\\r\n\\r\n* A DBS criminal records check to prove you have no criminal convictions that might prevent you from working with children or young people;\\r\n* A Declaration of Health questionnaire to confirm that you are physically and mentally fit to teach, and are capable of undertaking a course of study to become a qualified teacher;\\r\n* Professional Skills Tests. http://sta.education.gov.uk/\\r\n\\r\nYou should demonstrate the ability to:\\r\n\\r\n* communicate clearly and accurately in both written and spoken English;\\r\n* cope with the demands and rigours of the profession. \\r\n",
    "PersonalQualities": "Personal qualities that we are looking for:\\r\n\\r\n* A genuine desire to teach and enthuse young people \\r\n* Commitment \\r\n* A strong subject-based academic background \\r\n* Good communication skills \\r\n* Experience of working with young people \\r\n* Energy, perseverance and stamina \\r\n* Flexibility and humour \\r\n* An ability to learn, reflect on your practice and act on advice \\r\n* An ability to work collaboratively \\r\n",
    "HowSchoolPlacementsWork": "Our partnership currently consists of 10 secondary schools, predominantly in Hampshire with two schools in Wiltshire.  During your training year, you will have two school placements.  You will be placed in a host school for your main placement, and will undertake a half term second placement in another school in our partnership.  You will also be offered a primary, sixth form and SEN school experience during your training year.\\r\n\\r\nYou will have the opportunity to apply to a specific school on your UCAS application, or alternatively you can submit an ‘open’ application and discuss the various options available at interview.  We are happy to arrange for you to visit any of our partner schools prior to submitting your application form.\\r\n\\r\nSecondary Schools in the Bitterne Park Teaching School Alliance:\\r\n\\r\n* Bitterne Park School, Southampton – age range 11-19, languages: French/Spanish\\r\n* The Burgate School, Fordingbridge – age range 11-19, languages: French/German\\r\n* Hounsdown School, Totton – age range 11-16, languages: French/Spanish\\r\n* Matravers School, Westbury – age range 11-19, languages: French/Spanish\\r\n* Regents Park Community College, Southampton – age range 11-16, languages: French/Spanish\\r\n* St George Catholic VA College, Southampton – age range 11-16, languages: French/Spanish\\r\n* The Petersfield School, Petersfield – age range 11-16, languages: French/Spanish/German\\r\n* Pewsey Vale School, Pewsey – age range 11-16, languages: French/German\\r\n* Woodlands Community College, Southampton – age range 11-16, languages: French/Spanish\\r\n* Cantell School, Southampton – age range 11-16, languages: French/Spanish\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Bitterne Park Teaching School Alliance is a growing partnership comprising a diverse range of primary and secondary schools across Hampshire and Wiltshire which present dynamic and exciting training possibilities for those wishing to pursue a career in teaching. Our School Direct training programme is delivered in partnership with the Universities of Southampton and Chichester, and combines the best elements of a traditional university-led PGCE training model with the benefits of a school-centred approach.  \\r\n\\r\nTrainees on our course are fully immersed in their placement schools and are treated like any other member of the teaching staff. This approach allows trainees to experience all aspects of the role of a teacher, both inside and outside the classroom. The practical nature of our course, combined with the opportunity to work alongside and learn from experienced, outstanding practitioners, constantly reinforces the link between theory and practice. Our training programme is designed to encourage you to challenge your own preconceptions and help you to develop as an informed and reflective teacher. We aim to ensure that by the end of the course you can teach your subject confidently and successfully by developing your skills as a problem solver, and by encouraging you to explore theoretical ideas and apply them to the practicalities of the classroom.",
    "TrainWithDisability": "If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.  Disability access varies across the alliance sites, so you may wish to contact individual schools for further information.  Successful candidates will be required to complete a pre-placement Health Declaration before starting our teacher training programme, and based upon the responses provided, may be invited to attend an assessment.  This will assist us to make workplace adjustments, where possible.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The University of Southampton has a long-established record of excellent initial teacher training, and successful completion of our course will lead to Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE). The programme also contributes towards Master's level accreditation.   We work in partnership with the University of Southampton for all subjects except English (which is with the University of Chichester). ",
        "UcasInstitutionCode": "S27"
      },
      {
        "Description": "The University of Chichester is recognised as one of the leading institutions in the country for teacher training,  We work in partnership with the University of Chichester to provide our School Direct English programme, and successful completion of our course will lead to the award of a Postgraduate Certificate in Education (PGCE) with recommendation for Qualified Teacher Status (QTS).  The programme also contributes towards Master’s level accreditation.  All university-led subject specific training on our English programme is based at Bitterne Park School in Southampton.",
        "UcasInstitutionCode": "C58"
      }
    ]
  },
  "has_inst": true
}
