{
  "locationType": "School",
  "accrediting": "Tes Institute",
  "provider": "Havering Train2Teach",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "178/2YX2",
  "providerCode": "178",
  "programmeCode": "2YX2",
  "schools": [
    {
      "name": "Main Site",
      "address": "Severn Drive, Cranham, Upminster, Essex, RM14 1SW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Severn Drive, Cranham, Upminster, Essex, RM14 1SW",
      "geocode": true,
      "formatted_address": "Severn Dr, Upminster RM14 1SW, UK",
      "latitude": 51.5708976,
      "longitude": 0.2666913,
      "post_code": "RM14 1SW",
      "city": "Greater London",
      "route": "Severn Drive",
      "postal_town": "Upminster"
    }
  ],
  "providerAddress": null,
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 8500.0,
    "FeeDetails": "The course with PGCE Option will be £9,000",
    "AboutCourse": "Our teacher training programme is run over a one-year period within schools in partnership with the TES Institute. The one year course is delivered with a mix of in-school experience, online learning, tutor support and in-school mentor support.\\r\n\\r\nWhy chose our TES institute course?\\r\n\\r\nThe TES institute programme is a unique opportunity to work as a member of a school team and learn about teaching from dedicated, experienced professionals in schools. Your practical teacher training will be supplemented by high quality online learning sessions written by practising teachers and academics from the world of education.\\r\n\\r\nTES Institute’s School Direct ITT programme will allow you to:\\r\n\\r\nWork in a school alongside teaching professionals, learning from experienced practitioners as part of a team\\r\nTrain to prepare and deliver your own lessons and in time, take shared responsibility for your own classes\\r\nGain contrasting experience in a second partnership school\\r\nAccess supporting online study sessions 24/7 that focus on the theory and practice of teaching and learning\\r\nBenefit from the support of an in-school mentor and a TES Institute pathway tutor to guide and facilitate effective progress towards QTS\\r\nBe part of a network of School Direct partnership schools\\r\nGain QTS with an option to add PGCE\\r\nIncrease your subject knowledge with online Subject Knowledge Enhancement (SKE)",
    "CourseLength": "OneYear",
    "Qualifications": "GCSE English (Grade C or above)(equivalents will be considered)\\r\nGCSE Maths (Grade C or above)(equivalents will be considered)\\r\nGCSE Science (Grade C or above)(equivalents will be considered)\\r\nAn undergraduate degree, either 1st, 2:1 or 2:2 or another qualification of equivalent academic standard\\r\n",
    "InterviewProcess": "Once your application is received on UCAS and references received,  we will contact you to invite you to a selection/interview morning or afternoon.  This will consist of a mixture of a 5 minute presentation (the topic of which will be given to you prior to the day) followed by an interview, some time in the classroom and a 30 minute written test. ",
    "PersonalQualities": "Have the appropriate qualities, attitudes and values expected of a teacher.\\r\nHave the ability to demonstrate English language proficiency (reading, writing and speaking)\\r\nHave sufficient knowledge to pass the Professional Skills Tests by the time you enrol on a programme – Information on the professional skills test required for all prospective teachers – http://sta.education.gov.uk/\\r\n\\r\n\\r\n",
    "HowSchoolPlacementsWork": "If selected, a primary school (your home school) within Havering  will be chosen based on your skill set and preferences you give at the interview stage.  During term 2, you will have a second placement at a different primary school in the opposite key stage to which you have chosen.  This ensures that by the end of the course you are confident and capable of teaching all ranges within a primary school setting. You also have a one day placement at a special needs school and a two day placement at a secondary school, again all within Havering."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Havering Train2Teach is a trainee teacher programme within the London Borough of Havering.\\r\nHavering Train2Teach are located in the London Borough of Havering and the Lead school is Engayne Primary.  As a trainee you will be based in a Primary school within Havering, areas  include Romford, Hornchurch, Upminster, Cranham and Rainham.  \\r\nOur teacher training programme is run over a one-year period (September to July) in partnership with the TES Institute. The one year course is delivered with a mix of in-school experience, online learning, tutor support and in-school mentor support.\\r\nThe TES institute programme is a unique opportunity to work as a member of a school team and learn about teaching from dedicated, experienced professionals in schools. TES Institute’s School Direct ITT programme will allow you to:\\r\n•\\tWork in a school alongside teaching professionals, learning from experienced practitioners as part of a team\\r\n•\\tTrain to prepare and deliver your own lessons and in time, take shared responsibility for your own classes\\r\n•\\tGain contrasting experience in a second partnership school\\r\n•\\tAccess supporting online study sessions 24/7 that focus on the theory and practice of teaching and learning\\r\n•\\tBenefit from the support of an in-school mentor and a TES Institute pathway tutor to guide and progress towards QTS\\r\n•\\tBe part of  School Direct partnership schools\\r\n•\\tGain QTS with an option to add PGCE\\r\n•\\tIncrease your subject knowledge with online Subject Knowledge Enhancement (SKE)\\r\n•\\t\\r\n\\r\nwww.haveringtrain2teach.com\\r\n",
    "TrainWithDisability": "Havering Train2Teach recognises, celebrates and plans for diversity and equality. Our partnership schools are ones in which well-being and the principles of inclusion matter. All schools in the partnership are dedicated to achieving equality of opportunity where access hinges not on treating trainees in the same way, but on taking positive action to redress the inequalities faced by some trainees.\\r\nHavering Train2Teach schools are located across the borough in a variety of buildings, all with different facilities allowing for a suitable placement for trainees with disabilities to be found. We have been able to accommodate trainees with mobility issues who have needed to be located on a ground floor or who have had trouble standing for long periods of time. Practical adjustments to physical environments are part of each school’s accessibility plan and will be considered in individual cases.\\r\nBy working closely with TES, reasonable variations can be made to allow access to the training plan and the delivery of information. Each new trainee has an initial need assessment (INA) which leads to a more individualised program for all. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Tes Institute is currently work with partnerships across England to provide their trainee teachers with an accessible and personalised initial teacher training (ITT) programme that leads to Qualified Teacher Status (QTS) and an optional Postgraduate Certificate in Education (PGCE).  Our unique approach means that we can create a bespoke online virtual learning environment (VLE) within which the School Direct teacher training course can be housed and delivered. Access to our comprehensive online content means that your school can offer an accessible and flexible ",
        "UcasInstitutionCode": "H40"
      }
    ]
  },
  "has_inst": true
}
