{
  "locationType": "School",
  "accrediting": "University of Wolverhampton",
  "provider": "The Earls High School",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "1L5/2F4Q",
  "providerCode": "1L5",
  "programmeCode": "2F4Q",
  "schools": [
    {
      "name": "The Earls High School",
      "address": "Furnace Lane, Halesowen, West Midlands, B63 3SL",
      "code": "1"
    }
  ],
  "addresses": [
    {
      "address": "Furnace Lane, Halesowen, West Midlands, B63 3SL",
      "geocode": true,
      "formatted_address": "Furnace Ln, Halesowen B63 3SL, UK",
      "latitude": 52.453059,
      "longitude": -2.0523842,
      "post_code": "B63 3SL",
      "city": "West Midlands",
      "route": "Furnace Lane",
      "postal_town": "Halesowen"
    }
  ],
  "providerAddress": {
    "inst_code": "1L5",
    "addr_1": "The Earls High School",
    "addr_2": "Furnace Lane",
    "addr_3": "Halesowen",
    "addr_4": "West Midlands",
    "postcode": "B63 3SL ",
    "url": "http://www.earlshighschool.org/",
    "geocode": true,
    "formatted_address": "Furnace Ln, Halesowen B63 3SL, UK",
    "latitude": 52.452765,
    "longitude": -2.051101,
    "post_code": "B63 3SL",
    "city": "West Midlands",
    "route": "Furnace Lane",
    "postal_town": "Halesowen"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "In 2012, the Government introduced financial arrangements which led to the withdrawal of most of the public funding for higher education.\\r\n\\r\nFees at Worcester reflect the cost of efficiently providing an excellent education. Our philosophy is that once a student is selected to study here, they become a member of our community. This informs everything we do.\\r\n\\r\nAt Worcester, we are committed to providing our future students with an outstanding education, facilities and opportunities.\\r\n\\r\nThe University remains committed to providing more opportunities for highly talented, ambitious students regardless of their financial circumstances.\\r\n\\r\nTuition fees are reviewed annually and undergraduate tuition fees usually increase in line with inflation.\\r\n\\r\n ",
    "AboutCourse": "This course provides an immersive and inspiring, school-centred training route into teaching.  The innovative design and delivery of the course places the trainee at the heart of a thriving school community from day one.\\r\n\\r\nAt Worcester you will benefit from our excellent partnerships with schools throughout the West Midlands region and beyond. We also provide state of the art facilities to support your research, subject knowledge and communication skills - enabling you to deliver teaching with impact.\\r\n\\r\nGraduates enjoy excellent employability prospects as the majority of our partner schools offer early career teaching posts to our PGCE trainees.\\r\n\\r\nKey features\\r\n\\r\n* full immersion in the daily life of a school and all the existing challenges that it brings\\r\n* course elements exploring wider issues of education and society enhance your prospects as a future leader in the profession\\r\n* our choice of additional specialisms help enhance your expertise and career prospects, from citizenship, English as an additional language, special educational needs and disability, technology enhanced learning\\r\n* unparalleled personal and academic support throughout the programme that continues beyond your study and in to the early stages of your career\\r\n* with 60 credits at postgraduate level and a strong international reputation, a PGCE can take you anywhere, from Masters study to a job on the other side of the world\\r\n* breadth and depth of experience across a range of schools\\r\n\\r\n[The University of Worcester](https://www.worcester.ac.uk/courses/pgce-school-direct-secondary.html#section-2)",
    "CourseLength": "OneYear",
    "Qualifications": "Most specialisms ask for:\\r\nHonours degree normally (2:2) or higher from a United Kingdom higher education institution or equivalent qualification, in a relevant subject area.\\r\nApplicants with a 3rd class degree will be considered on an individual basis.\\r\nGrade C/4 at GCSE in English Language, Mathematics (or equivalent) passed at the time of application\\r\n All applicants for teacher training courses need to pass the numeracy and literacy professional skills tests before the start of the course.\\r\n",
    "FeeInternational": 12100.0,
    "FinancialSupport": "You can get help with the costs of teacher training. A student finance package will include a Tuition Fee Loan and a Maintenance Loan. You may also be eligible for extra help if you have children or are disabled. Most course are also eligible for a tax-free bursary or scholarship depending on your subject, degree classification or highest academic qualification.\\r\n\\r\nThe University's Money Advice Service is available to you even before you apply. If you'd like confidential, one-to-one advice, contact our Money Advice office through Firstpoint on:\\r\n\\r\nTel: 01905 542551\\r\n[email:](firstpoint@worc.ac.uk)\\r\n\\r\nIf you have a question about tuition fees and how to pay for them, please contact our Finance Department on 01905 542474 or 01905 855115 or [email:](creditcontrol@worc.ac.uk)",
    "OtherRequirements": "Please note all successful applicants will be subject to a criminal records check.",
    "PersonalQualities": "We are looking to train, develop and support School Direct candidates who have the potential to be outstanding practitioners.\\r\n\\r\nSchool experience is desirable, but not essential prior to an interview. At interview we will discuss relevant prior school experience or opportunities applicants have had to work with school aged children. It is at this point that we would discuss with a candidate whether additional school experience would support an individual in their decision that teaching is right for them.",
    "HowSchoolPlacementsWork": "\\r\n* placements in at least two different schools, giving you a breadth of experience and the chance to specialise while you develop self-reflection, self-criticism and self-confidence\\r\n* opportunities to develop additional specialisms in areas such as special educational needs, technology enhanced learning, and leadership\\r\n* extra-curricular opportunities, such as conferences and special projects, to boost your chances of employment\\r\n* core and School Direct routes and the option to study full-time or part-time\\r\n* the course lasts for 10 months and there are excellent tax free training bursaries available\\r\n\\r\nYour time will predominantly be spent on school placement (a minimum of 120 days).  When you are not in school you will be in university attending either subject sessions or professional studies (for school direct professional studies is delivered in school)\\r\n\\r\nTypically university contact time will be structured around a range of teaching, learning and assessment methods including \\r\n\\r\n* lectures\\r\n* workshops\\r\n* peer group activities\\r\n* seminars\\r\n* directed reading\\r\n* independent research\\r\n* directed study\\r\n* presentations\\r\n* posters\\r\n* tutorials\\r\n* fieldwork"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "As an Ofsted rated Outstanding school, The Earls promotes a challenging and stimulating environment that aims to fully engage students in their learning. \\r\n\\r\nWe believe passionately that education has one, deeply important characteristic, that nothing else can match: a good education gives the opportunity for any individual to transcend their starting point. Education is the one thing that allows us all to enhance our natural talents, gifts and abilities. That is what we strive for at The Earls, creating enhanced life chances for our students. \\r\n\\r\nThe school motto: 'Ut filii lucis fiatis', almost literally 'to become the children of light', that's what we want for our students: to become enlightened. \\r\n\\r\nAs an Ofsted rated Outstanding school, The Earls promotes a challenging and stimulating environment that aims to fully engage students in their learning. We are looking to train, develop and support School Direct candidates who have the potential to be outstanding practitioners. \\r\n\\r\nWe are looking to train, develop and support School Direct candidates who have the potential to be outstanding practitioners. \\r\n  \\r\nSchool Direct is available at The Earls High School and  with our partner schools: Olive Hill; Newfield Park; Aldridge; The Dormston; Lyng Hall; St. Matthias and The Mercian Trust. \\r\n\\r\nSuccessful completion of a School Direct course will lead to the award of qualified teacher status (QTS). School Direct programmes may also include a postgraduate certificate in education (PGCE). \\r\n\\r\nIf you have the knowledge, passion and commitment required to become an outstanding practitioner, then apply to The Earls High School.\\r\n",
    "TrainWithDisability": "We are committed to supporting candidates with disabilities and other needs including candidates with dyslexia; physical, hearing, and visual impairments and : mental health conditions. \\r\n\\r\nWe will seek advice and support as necessary from professional bodies and advice services.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "School Direct \\r\nThis course provides an immersive and inspiring, school-centred training route into teaching.  The innovative design and delivery of the course places the trainee at the heart of a thriving school community from day one.\\r\n\\r\nAt Worcester you will benefit from our excellent partnerships with schools throughout the West Midlands region and beyond. We also provide state of the art facilities to support your research, subject knowledge and communication skills - enabling you to deliver teaching with impact.\\r\n\\r\nGraduates enjoy excellent employability prospects as the majority of our partner schools offer early career teaching posts to our PGCE trainees",
        "UcasInstitutionCode": "W80"
      },
      {
        "Description": "Could inspire the next generation of teenagers?\\r\n\\r\nTraining as a Secondary school teacher, upon successful completion, will allow you to teach across the eleven to sixteen age range within the secondary age phase. For some of the non-compulsory subjects within schools,you will be taught to teach those from year ten into sixth form level (14 to 19 within the secondary age range).\\r\n\\r\n“The quality of training reflects the strengths of the partnership and how the relevant expertise of mentors and tutors is deployed skilfully”. (Ofsted, 2013)",
        "UcasInstitutionCode": "W75"
      },
      {
        "Description": "Birmingham City University offers trainees a unique training package carefully tailored to suit the needs of the schools, their pupils and their future teachers. Trainees will study and work in schools within the network and the university, and their learning will be supported by teachers, mentors and university tutors from across the partnership.\\r\n\\r\nSchool Direct enables schools to grow their own teachers and future leaders. From the beginning of the programme trainees become part of a network of schools.\\r\n\\r\n‘Birmingham City University School of Education has a powerful commitment to working with its partners to raise standards.’ \\r\nOfsted, March 2010",
        "UcasInstitutionCode": "B25"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "2B3"
      },
      {
        "Description": "This initial teacher training programme enables lead schools to choose the provider they want to work with. These schools play a key role in recruiting and selecting trainees and they work with the University to provide a high-quality training programme which leads to the award of the Postgraduate Certificate in Education (PGCE) with Qualified Teacher Status (QTS) at Primary level and PGDipEd with QTS at Secondary level. Applicants apply direct to a lead school and undertake their placements within the lead school’s partnership.  Partnerships may include a mix of primary, secondary and special schools",
        "UcasInstitutionCode": "B32"
      }
    ]
  },
  "has_inst": true
}
