{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Bristol",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "B78/V1X1",
  "providerCode": "B78",
  "programmeCode": "V1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "B78",
    "addr_1": "PGCE Programme",
    "addr_2": "35 Berkeley Square",
    "addr_3": null,
    "addr_4": "Bristol",
    "postcode": "BS8 1JA ",
    "url": "http://www.bristol.ac.uk/education/students/ite/",
    "geocode": true,
    "formatted_address": "35 Berkeley Square, Bristol BS8 1JA, UK",
    "latitude": 51.4551014,
    "longitude": -2.6048463,
    "post_code": "BS8 1JA",
    "city": "City of Bristol",
    "route": "Berkeley Square",
    "postal_town": "Bristol"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary English course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYour tutors are active researchers in matters relating to history education. They are regarded as experts in the field, both nationally and internationally, and have been consulted by a number of national and international organisations, such as the Historical Association, QCA and QCDA, the TDA, Ofqual, the Department for Education and Council of Europe on matters relating to the history curriculum.\\r\n\\r\nYour assignments are designed to help you plan your teaching effectively and imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils. Tutors weave together personal experience, practice and research into challenging but highly practical and relevant sessions.\\r\n\\r\nYou will learn in first-class facilities through a series of practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n*gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Partnership offers subject-specialist training in 8 secondary subjects. We are currently rated ‘Outstanding’ by Ofsted and our programme was ranked in the Top 5 of the Good Teacher Training Guide 2017. As a designated 11-19 provider you are guaranteed training and direct experience of A level/BTEC teaching as part of your programme. We also offer comprehensive training in generic elements such as behaviour management, pastoral care and working with pupils with SEND.\\r\n\\r\nThroughout the year, you will be supported by a subject specialist university tutor, as well as dedicated mentors in Partnership schools. The support that we offer is highly praised by our student teachers, and in the last two years, 99% of student teachers rated the quality of their training with us as either good or very good.\\r\n\\r\nYou are also able to take advantage of being part of a research-intensive university which offers the opportunity to benefit from cutting edge research in areas such as neuroscience and education. As part of the University’s Green Apple Project, we encourage our student teachers to focus on ‘sustainable education’ for the future.\\r\n\\r\nTypically, over 50% of those qualifying with us choose to remain in the Bristol area and have successfully secured teaching posts within our partnership schools by the end of the PGCE year. Many of our student teachers progress quickly in their careers, taking on roles such as subject leader and head of year. A number have gone beyond this, joining senior leadership teams.",
    "TrainWithDisability": "We welcome applications from candidates with disabilities and other needs and, within the context of University of Bristol support structures, we make reasonable adjustments to ensure that the programme is accessible to all. When a specific need is declared, offer holders are assessed by the University’s Occupational Health department and recommended to liaise with our Disability Service to ensure a Learning Support Plan can be put in place.\\r\n\\r\nMany lectures are audio-recorded and are made available via our VLE. When possible, lecture slides and handouts are made available to the whole cohort at least 24 hours in advance of the session. All University buildings are accessible including ramp/lift access. In cases where student teachers are required to move around the University campus to attend lectures, provision is made to support them, as appropriate. The University works closely with placement schools to ensure that needs are met whilst on teaching practice. For example, a student teacher with hearing disabilities was placed in a school that could provide carpeted classrooms.\\r\n\\r\nThe University has a comprehensive support structure to support students with a wide range of medical conditions, including mental health. This includes support from the Personal Tutor, the Senior Tutor and Programme Director, Professional Services staff as well asdepartment-based Student Welfare Advisors. If appropriate, student teachers can be referred to the University’s specialist Counselling Service or Occupational Health team. Further information on student wellbeing can be found here: \\r\n[Student health and wellbeing](http://www.bristol.ac.uk/students/wellbeing/)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
