{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Bristol",
  "subjects": [
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "B78/T9X1",
  "providerCode": "B78",
  "programmeCode": "T9X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "B78",
    "addr_1": "PGCE Programme",
    "addr_2": "35 Berkeley Square",
    "addr_3": null,
    "addr_4": "Bristol",
    "postcode": "BS8 1JA ",
    "url": "http://www.bristol.ac.uk/education/students/ite/",
    "geocode": true,
    "formatted_address": "35 Berkeley Square, Bristol BS8 1JA, UK",
    "latitude": 51.4551014,
    "longitude": -2.6048463,
    "post_code": "BS8 1JA",
    "city": "City of Bristol",
    "route": "Berkeley Square",
    "postal_town": "Bristol"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Because of a large cohort size and the availability of specialist tutors for each of the main languages offered (French, Spanish and German), we are able to offer MFL students a wide range of opportunities to prepare them effectively for their future lives as teachers of MFL. MFL specific content is delivered by the MFL tutors and by guest speakers who are often practising teachers in our partnership schools. In the autumn term a wide range of subject specific areas are covered, including: the national curriculum, presenting new language, teaching grammar, differentiation, transition from primary and using the target language in the classroom. Students are also given a through grounding in the requirements of the new GCSE and A level examinations.\\r\n\\r\nFor a number of these topics, 90-minute lectures are followed by language specific workshops, often run in the student’s main language. In the summer term the emphasis is on encouraging students to experiment and go ‘out of the box’ with sessions on film making, drama and CLIL (teaching another subject through the medium of the foreign language.\\r\n\\r\nWe prioritise subject knowledge development throughout the course, asking students to track progress and set targets in their languages with the help of a working document known as a ‘subject knowledge log’. Initial targets are often set on the basis of an oral assessment carried out on the first day at university. In the autumn and summer terms there are dedicated peer teaching sessions for language development in which students coach each other.",
    "CourseLength": "OneYear",
    "Qualifications": "Applicants for the programme normally have two foreign languages. Only one needs to be to final degree level or equivalent. We accept strong applications from candidates with one language; such applicants will normally be asked to register on a subject knowledge enhancement (SKE) course in order to study a second foreign language before joining the programme. these applicants are strongly advised to apply early.\\r\nWe also accept applications from native speakers of one of the languages below who hold a good degree in another subject.\\r\nThe languages offered are French, Spanish and German: the main subjects taught in UK schools.",
    "FeeInternational": 18100.0,
    "FinancialSupport": "In addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\\r\n\\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)",
    "InterviewProcess": "If the potential to be a good MFL teacher is evident in your application, we will invite you for a half day interview session at the University. These sessions take place every 3-4 weeks and in line with our commitment to collaborative learning we typically invite up to 8 applicants at any one time. You will be interviewed by one of the University MFL tutors and often, a teacher mentor from a local school. \\r\n\\r\nThe interview for the MFL course consists of 3 parts. Firstly, we ask candidates to teach a 5 minute language lesson to tutors and other candidate. Secondly there is a face to face interview lasting approximately 40 minutes; this includes some discussion in the language(s) offered, after which immediate feedback is given. Thirdly, candidates are asked to complete 2 written tasks in the language(s) offered.",
    "OtherRequirements": "In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child and adult workforce, as well as clearance by our Occupational Health department.\\r\n\\r\nIf there any concerns with either of the above, applicants will be referred to the University’s suitability panel.",
    "PersonalQualities": "We look for applicants with passion who want to inspire the next generation. The PGCE is demanding but we'll support and guide you to become an excellent qualified teacher.\\r\n\\r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for: \\r\n\\r\n* good subject skills\\r\n* good understanding of the secondary curriculum\\r\n* awareness of current effective teaching and learning in your subject\\r\n* interest and awareness of what working with young people involves\\r\n* commitment to the state sector\\r\n* communication skills\\r\n* critical analysis\\r\n* good organisation\\r\n* reflection\\r\n* resilience.",
    "HowSchoolPlacementsWork": "Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (up to one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g. Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year including schools with high numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.\\r\n\\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and that will offer you the opportunity to thrive. The majority of student teachers are required to travel for at least one placement and we offer some assistance with the cost of travel where appropriate.\\r\n\\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. In the Summer Term, you will complete a final, shorter placement (5 weeks) as part of the Extension Phase. Typically, this is based in the main placement school, but also often involves additional experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Partnership offers subject-specialist training in 8 secondary subjects. We are currently rated ‘Outstanding’ by Ofsted and our programme was ranked in the Top 5 of the Good Teacher Training Guide 2017. As a designated 11-19 provider you are guaranteed training and direct experience of A level/BTEC teaching as part of your programme. We also offer comprehensive training in generic elements such as behaviour management, pastoral care and working with pupils with SEND.\\r\n\\r\nThroughout the year, you will be supported by a subject specialist university tutor, as well as dedicated mentors in Partnership schools. The support that we offer is highly praised by our student teachers, and in the last two years, 99% of student teachers rated the quality of their training with us as either good or very good.\\r\n\\r\nYou are also able to take advantage of being part of a research-intensive university which offers the opportunity to benefit from cutting edge research in areas such as neuroscience and education. As part of the University’s Green Apple Project, we encourage our student teachers to focus on ‘sustainable education’ for the future.\\r\n\\r\nTypically, over 50% of those qualifying with us choose to remain in the Bristol area and have successfully secured teaching posts within our partnership schools by the end of the PGCE year. Many of our student teachers progress quickly in their careers, taking on roles such as subject leader and head of year. A number have gone beyond this, joining senior leadership teams.",
    "TrainWithDisability": "We welcome applications from candidates with disabilities and other needs and, within the context of University of Bristol support structures, we make reasonable adjustments to ensure that the programme is accessible to all. When a specific need is declared, offer holders are assessed by the University’s Occupational Health department and recommended to liaise with our Disability Service to ensure a Learning Support Plan can be put in place.\\r\n\\r\nMany lectures are audio-recorded and are made available via our VLE. When possible, lecture slides and handouts are made available to the whole cohort at least 24 hours in advance of the session. All University buildings are accessible including ramp/lift access. In cases where student teachers are required to move around the University campus to attend lectures, provision is made to support them, as appropriate. The University works closely with placement schools to ensure that needs are met whilst on teaching practice. For example, a student teacher with hearing disabilities was placed in a school that could provide carpeted classrooms.\\r\n\\r\nThe University has a comprehensive support structure to support students with a wide range of medical conditions, including mental health. This includes support from the Personal Tutor, the Senior Tutor and Programme Director, Professional Services staff as well asdepartment-based Student Welfare Advisors. If appropriate, student teachers can be referred to the University’s specialist Counselling Service or Occupational Health team. Further information on student wellbeing can be found here: \\r\n[Student health and wellbeing](http://www.bristol.ac.uk/students/wellbeing/)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
