{
  "locationType": "School",
  "accrediting": null,
  "provider": "Gateshead Primary SCITT",
  "subjects": [
    "Primary"
  ],
  "name": "Gateshead Primary SCITT",
  "slug": "G10/34RJ",
  "providerCode": "G10",
  "programmeCode": "34RJ",
  "schools": [
    {
      "name": "Main Site",
      "address": "Lobley Hill Primary School, Rothbury Gardens, Gateshead, NE11 0AT",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Lobley Hill Primary School, Rothbury Gardens, Gateshead, NE11 0AT",
      "geocode": true,
      "formatted_address": "Rothbury Gardens, Gateshead NE11 0AT, UK",
      "latitude": 54.9384982,
      "longitude": -1.6360689,
      "post_code": "NE11 0AT",
      "city": "Tyne and Wear",
      "route": "Rothbury Gardens",
      "postal_town": "Gateshead"
    }
  ],
  "providerAddress": {
    "inst_code": "G10",
    "addr_1": "Rothbury Gardens",
    "addr_2": "Gateshead",
    "addr_3": "Tyne and Wear",
    "addr_4": null,
    "postcode": "NE11 0AT",
    "url": "http://www.gatesheadscitt.org.uk",
    "geocode": true,
    "formatted_address": "Rothbury Gardens, Gateshead NE11 0AU, UK",
    "latitude": 54.9373908,
    "longitude": -1.6376902,
    "post_code": "NE11 0AU",
    "city": "Tyne and Wear",
    "route": "Rothbury Gardens",
    "postal_town": "Gateshead"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "Tuition fees for the PGCE course are £9000. If you are from the UK, you should be eligible for a student loan to cover the cost of tuition fees, available through Student Finance England.\\r\n\\r\n",
    "AboutCourse": "Gateshead Primary SCITT is a one year, full-time course which trains approximately 40 trainees each year. Trainees can choose whether to specialise in Early Years and Key Stage one (ages 3-7) or Key Stages one and two (ages 5-11). \\r\nYour academic studies provide an opportunity for you to explore topics in greater depth. \\r\nRegular assignments of varying length are set throughout the course and full tutorial support is given. \\r\nYou will be assessed against Masters level criteria leading to Qualified Teacher Status and 60 credits at Master's Level. \\r\nOur PGCE is validated by the University of Northumbria at Newcastle. \\r\n\\r\nOur centre-based training sessions are delivered by experienced teachers, advisors and lecturers. Throughout the course, theory and practice are closely linked. \\r\n\\r\nTrainees spend approximately 120 days in schools, putting the theory they have learned in centre-based training into practice. \\r\nTrainees will experience at least two different schools, and are carefully matched with their placement schools to ensure their individual needs are met. \\r\n\\r\nTrainees must demonstrate competence against all of the QTS standards. \\r\nA detailed file of evidence is submitted for final assessment which demonstrates how trainees have met the standards for QTS. \\r\nEvidence is gained as work is carried out in the classroom or around the setting.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "We seek candidates who can demonstrate a commitment to teaching as a career and require the following qualifications upon application:\\r\n- A honours degree, class 2:2 or higher, awarded by a UK university. \\r\n- GCSE English Language, Maths and Science (or equivalent) at grade C/4 or above \\r\n- You must have passed the Professional Skills tests in Literacy and Numeracy \\r\nIf you have studied outside of the UK, you must apply for a Certificate of Comparability from NARIC (the National Academic Recognition Information Centre) to find out whether your qualifications are equivalent and acceptable for entry. \\r\n",
    "InterviewProcess": "We make our decisions to offer a place based on your enthusiasm, aptitude and commitment to teaching as demonstrated by your application form, qualifications, reference and performance at the interview. \\r\n\\r\nYour Personal Statement forms a key part of the initial selection process. This not only provides you with an opportunity to evidence your ability to communicate clearly and accurately in writing, but also is where you can draw attention to those personal skills and qualities which you believe make you suitable for working within the Primary phase \\r\n\\r\nSuccessful applicants will initially be invited to attend an interview day at a SCITT partnership school. \\r\nDuring the interview process candidates will receive further information about the course. Candidates will also be required to undertake a series of short tasks and a formal interview. \\r\n\\r\nWhilst ensuring that we can provide the conditions and training required, trainees must be prepared to demonstrate their own suitability for an offer of a place. The SCITT has thorough and rigorous selection procedures to ensure that the strongest applicants are offered places on the programme. Applicants must demonstrate a potential to train as a primary teacher. \\r\n\\r\nAny offer is conditional upon receipt of a satisfactory medical report, police clearance and sight of original qualification certificates. \\r\n\\r\nCandidates must successfully complete the NCTL Professional Skills Tests in Literacy and Numeracy. The Professional Skills Test must be passed by all candidates before entry to the course. We encourage applicants to ensure that the Skills Tests are secured as early as possible.",
    "OtherRequirements": "Statutory guidance requires that teacher training providers ensure that entrants on all routes have been subject to DBS criminal records checks. \\r\n\\r\nApplicants offered a place will need to complete a DBS application prior to commencement of the programme. \\r\n\\r\nSuccessful applicants will be asked to confirm in writing that neither they nor, as far as they are aware, members of their household are disqualified from teaching. \\r\n\\r\nSuccessful applicants will be required to complete a health questionnaire designed to ensure that trainees have the health and physical capacity to teach and will not put children and young people at risk of harm.",
    "PersonalQualities": "Teaching is a demanding but fulfilling profession. To succeed in it you need to possess and/or develop a number of key values, dispositions, skills and aptitudes. \\r\nYou must: \\r\nhave strong subject knowledge and understanding;\\r\nhave enthusiasm for teaching and a commitment to the educational process; \\r\nbe able to communicate sensitively and effectively with others and work constructively with them; \\r\nhave the will and capacity to engage in critical self-evaluation, learn from and with others, and engage in continuous professional development. \\r\n",
    "HowSchoolPlacementsWork": "Placement Schools\\r\nGateshead Primary SCITT provides you with all of your placement schools enabling you the trainee to concentrate fully on achieving your PGCE. \\r\nAt the beginning of the course you are allocated a Professional Tutor who will introduce you to school life and help you work your way through the teachers standards, allowing you to develop your lesson planning, teaching and evaluation and actively participating in classroom teaching working towards 80% teaching time in your final placement. \\r\n\\r\nSEN Placement\\r\nWorking in partnership with our outstanding SEN schools, trainees have the opportunity to experience and observe teaching and learning in a short placement. Working in small groups you will deepen your knowledge and understanding of how barriers to learning are overcome and what best practice means. \\r\n\\r\nEAL Placement\\r\nDelivered by an EAL expert and headteacher of an outstanding setting, you will experience first hand the challenges and opportunities of teaching pupils with EAL. \\r\nTrainees have the opportunity to observe and support teachers and pupils in this diverse and inspiring placement. \\r\n\\r\nEnhancement Placement\\r\nA unique element to the course is the opportunity to be involved in a bespoke subject enhancement placement. \\r\nWorking with senior leaders you will identify an aspect of whole school improvement and will experience working with staff to undertake small scale action research linked to a level 7 masters assignment. \\r\nTrainees share 'best practice' in a conference event attended by all participants of partnership schools. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Gateshead Primary SCITT welcomes visitors. Please contact us via email at info@gatesheadscitt.org.uk to attend an open day.\\r\n\\r\nPrior to starting the course we offer skills tests sessions to help boost your knowledge and confidence prior to sitting your tests.\\r\n\\r\nOur record of trainees gaining employment once qualified is outstanding. \\r\n\\r\nGateshead Primary SCITT provides the opportunity for you to gain Qualified Teacher Status and a Professional Graduate Certificate in Education (PGCE) through School Centred Initial Teacher Training in primary schools and nursery schools in Gateshead and the North East.\\r\n\\r\nThe Gateshead Primary SCITT offers:\\r\n\\r\n- Qualified teacher status\\r\n- A Professional or Post Graduate Certificate in Education (PGCE)\\r\n- All trainees are registered for the PGCE with Northumbria University\\r\n- The opportunity to gain 60 credits towards a Masters qualification\\r\n- A one year training course\\r\n- High quality Initial Teacher Training\\r\n- The opportunity to train within excellent schools\\r\n- High quality school based experiences within the North East region\\r\n\\r\nThe consortium of schools involved with this Initial Teacher Training Course have a high level of expertise and strong commitment to delivering high quality teacher training.\\r\nThe lead school, Lobley Hill Primary has extensive experience in Initial Teacher Training, working in partnership with other North East schools, Northumbria University and Gateshead Council. The SCITT provides excellent facilities and resources and Gateshead is one of the best performing Local Education Authorities, Northumbria University has an outstanding reputation within teacher education.",
    "TrainWithDisability": "All schools within the Gateshead Primary SCITT partnership are fully accessible. Please contact info@gatesheadscitt.org.uk with any access requirements.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
