{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of East London",
  "subjects": [
    "Humanities",
    "Primary",
    "Religious education"
  ],
  "name": "Primary with Humanities and Religious Education",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "E28/2CYZ",
  "providerCode": "E28",
  "programmeCode": "2CYZ",
  "schools": [
    {
      "name": "Main Site",
      "address": "Student Admissions Office, 4-6 University way, London, E16 2RD",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Student Admissions Office, 4-6 University way, London, E16 2RD",
      "geocode": true,
      "formatted_address": "4, East Building, 6 University Way, London E16, UK",
      "latitude": 51.5075163,
      "longitude": 0.0648165,
      "post_code": "E16",
      "city": "Greater London",
      "route": "University Way",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "E28",
    "addr_1": "Docklands Campus",
    "addr_2": "4-6 University Way",
    "addr_3": "Newham",
    "addr_4": "London",
    "postcode": "E16 2RD ",
    "url": "http://www.uel.ac.uk",
    "geocode": true,
    "formatted_address": "University Way, London E16 2RD, UK",
    "latitude": 51.5076024,
    "longitude": 0.0650809,
    "post_code": "E16 2RD",
    "city": "Greater London",
    "route": "University Way",
    "postal_town": "London"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "This primary teacher education course is designed for graduates who are committed to becoming primary school teachers. It trains you to teach children in the five to 11 age range. \\r\n\\r\nAs a trainee you will learn how to teach the entire primary curriculum as well as choosing a particular route. On the Humanities and Religious Education (RE) route you will gain the additional skills, knowledge and confidence to take on a leadership role in the field in the future.\\r\nEast London offers multicultural, multilingual and vibrant schools in which to learn, but your training at UEL will qualify you to teach anywhere in England or Wales.\\r\n\\r\nOur PGCE team is made up of experienced practitioners who have worked in a range of primary and Early Years settings across London as classroom teachers, curriculum co-ordinators, advisory teachers and school leaders.\\r\n\\r\nAt UEL you will be part of a diverse community of students. We want to bring to east London a teacher workforce that reflects the local community and, in 2013-14, 24 per cent of our Primary PGCE trainees were men.",
    "CourseLength": "OneYear",
    "Qualifications": "*A minimum 2:2 degree or higher (although we will consider lower classifications from candidates with relevant alternative experiences);\\r\n\\r\n*GCSE English Grade C/ Level 4 (or higher) or the equivalent of;\\r\n\\r\n*GCSE Maths Grade C/ Level 4 (or higher) or the equivalent of;\\r\n\\r\n*GCSE Science Grade C/ Level 4 (or higher) or the equivalent of.",
    "FeeInternational": 11880.0,
    "InterviewProcess": "The entire interview process lasts about three hours. During the interview you will be asked to talk about a current educational issue.  Please ensure you have done some research into current educational issues in advance of the interview.  You could, for example, read recent editions of the Times Educational Supplement. \\r\n\\r\nOur aim is to find out as much as we can about your attributes, skills, knowledge and understanding in order to shape training opportunities for you, should you be offered a place on the programme. \\r\n\\r\nYour responses to these tasks and activities will be considered alongside all the other evidence to assess your suitability for the Primary PGCE programme.\\r\n\\r\nDuring the individual interview you will be given the chance to talk with a tutor about the programme and any other issues that are relevant",
    "PersonalQualities": "*Good interpersonal skills with young people and/or adults;\\r\n\\r\n*Evidence of ability to respond to a challenge and overcome setbacks;\\r\n\\r\n*Resilience and commitment;\\r\n\\r\n*Evidence of knowledge of wider education issues and the ability to express and justify opinions and to consider those of others.",
    "HowSchoolPlacementsWork": "Our aim is to find out as much as we can about your attributes, skills, knowledge and understanding in order to shape training opportunities for you, should you be offered a place on the programme. \\r\n\\r\nYour responses to these tasks and activities will be considered alongside all the other evidence to assess your suitability for the Primary PGCE programme.\\r\n\\r\nDuring the individual interview you will be given the chance to talk with a tutor about the programme and any other issues that are relevant."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The University of East London is a highly experienced and successful initial teacher training (ITT) and education provider. Courses are taught and supported by exceptional and dynamic staff. All of whom foster creativity, collaboration, innovation and student engagement at the heart of what they offer. We also value the link between the academic and the practice, and this will form a significant part of the ITT programme you undertake.\\r\n\\r\nThis year, UEL has achieved its best ever student satisfaction score and we officially have  the happiest students of any modern university in London, according to recent NSS league tables. To complement this, our end of programme survey outcomes in July 2018, suggest that over 95% of our teacher trainees rate the quality of their training through UEL as good or higher. Employability is also excellent with most subjects, phases and routes achieving 95-100% employment each year. \\r\n\\r\nUEL is an inclusive university and our teacher training programmes are highly diverse and multicultural. We are very proud of our trainee teachers, new and old, and what they have gone on to achieve in our schools. We are especially proud of the community we serve and how we take people from the local community who then go back into this community to teach - over 70% of our trainees find jobs within our partner schools each year. \\r\n\\r\nWe look forward to welcoming you to UEL and the Cass School of Education and Communities.",
    "TrainWithDisability": "Applications from students with disabilities or other specific needs are welcomed. Initial teacher training programmes are based at our Stratford campus, which is fully accessible to all. UEL operates a very clear inclusivity policy. As a large provider of ITT, we have access to various support mechanisms for students who need this or would benefit from this additional support.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
