{
  "locationType": "School",
  "accrediting": "The University of Warwick",
  "provider": "Derby Early Years Teaching School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "268/2PMF",
  "providerCode": "268",
  "programmeCode": "2PMF",
  "schools": [
    {
      "name": "Main Site",
      "address": "Harrington Nursery School, Harrington Street, Derby, Derbyshire, DE23 8PE",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Harrington Nursery School, Harrington Street, Derby, Derbyshire, DE23 8PE",
      "geocode": true,
      "formatted_address": "Harrington St, Derby DE23 8PE, UK",
      "latitude": 52.90132,
      "longitude": -1.475832,
      "post_code": "DE23 8PE",
      "city": "Derby",
      "route": "Harrington Street",
      "postal_town": "Derby"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "School Direct is a school-led teacher training course  that gives you, high-quality graduates, a one year school based programme, run in conjunction with The University of Warwick, which allows you to be a part of the teaching team within a school from day one.\\r\n\\r\nAll our placement schools are in and around the Derby and Derbyshire areas.  All the training days take place locally at Harrington Nursery School, Derby and University of Warwick Teaching Fellows come to us.  \\r\n\\r\nSchool Direct routes enable you to work within a school and train in the classroom, supported by qualified teachers and mentors.  It is expected (not guaranteed) that you will continue to be employed by the school after you gain your teaching qualification.\\r\n\\r\nTraining with us you will:\\r\n* Train in a range of great schools for whole training year\\r\n* Be trained by inspirational teachers\\r\n* Get hands on experience of what works in the classroom, so you can become confident, successful and happy NQT's\\r\n* Work in partner schools and settings, teaching in Derby's wonderfully diverse communities\\r\n* Be supported into employment, application forms, personal statements, interview practice and vacancy matching\\r\n* Get great support from tutors and mentors on hand and help your confidence grow \\r\n\\r\nOur innovative and integrated programme is at the cutting edge of teacher training.  Designed in collaboration with the University, co-delivered and guaranteeing access to outstanding expertise in a variety of areas.  All areas taught are those to better equip you for teaching; primary subjects, plus local need for example English as an Additional Language, PE, Behaviour Management.\\r\n\\r\nYou will spend most of your school year in one host school, gradually increasing the amount of time spent in the role of a teacher, working closely with an experienced and skilled mentor.  You will spend time in another school with a different age group to gain further experience.\\r\n\\r\nYour training with the University will take place every other week at Harrington Nursery School, Derby.\\r\n\\r\nThere are no formal examinations, just 3 assessments papers which you will be fully supported to write and due one per term.",
    "CourseLength": "OneYear",
    "Qualifications": "Degree - You have graduated, or will graduate this year with a minimum 2:2 honours degree.\\r\n\\r\nGCSE - On application you hold at least Grade C in GCSE English Language, Mathematics and Science gained prior to application.  Other qualifications may be considered for equivalency.",
    "InterviewProcess": "Teaching is demanding but extremely rewarding.  It requires teachers who have a range of skills, knowledge, experience and aptitudes and we look for these qualities in our applicants.  Our selection process is effective - we are seeking real talent and commitment.  The University of Warwick screen applications to ensure that academic qualifications and experiences fulfil government requirements for funding, our school scrutinise application.\\r\n\\r\nHow to apply \\r\nRemember this will be your opportunity to tell us why you want to teach and why you want to do it with us.  Make it clear what your beliefs and aspirations are in the personal statement on the UCAS application and what experiences you have working with children and how this has impacted on you and your thinking.\\r\n\\r\nOnce through to interview, this will take place over half a day and consist of spending some time in the school with the children, a discussion task with a small group, a 20 minute activity with a group of 5 or 6 children and an interview with a panel of 2 headteachers.  We want to get the best out of you, to see the real you and identify your potential to be a teacher.\\r\n\\r\nOffers will be made following the interview to successful candidates which are conditional until conditions have been met; disclosure and barring service clearance, medical fitness, completion of professional skills tests.",
    "OtherRequirements": "* Criminal record checks\\r\n* Medical fitness\\r\n* Experience of working with children\\r\n* Professional Skills Tests",
    "PersonalQualities": "* Have a moral commitment to ensuring that children they teacher achieve academic and personal success that enables them to widen their life chances and to be full members of their communities.\\r\n* Seek to reduce inequality in the lives of children.\\r\n* Are passionate about the subject they apply to teach and about the learning of children, themselves and other professionals\\r\n* Excellent communication skills\\r\n* Have emotional resilience and be resilient problem-solvers who take responsibility for their own learning and of others\\r\n* Have the ability to form good and effective relationships\\r\n* Have a sense of humour",
    "HowSchoolPlacementsWork": "The Teaching School have partnerships with local schools who would like to host trainees and have systems in place to ensure mentors have sufficient time to support and develop trainees.  From discussion with yourselves the Teaching School organises placements with the school most suited to the candidate.  We wouldn't expect candidates to have to travel more than 20 miles  to their schools.\\r\n\\r\nCandidates will have a host school where they will be placed in both the Autumn Term and Summer Term.  During the Spring term the candidate will be placed in another school with a different age group.  You will be based in the schools full time and only be away from school when you have the training days at Harrington Nursery School with the University of Warwick or your specialism days at the University of Warwick which take place 5 times during the year."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Teacher training programme is an exceptional partnership between Derby Early Years Teaching School (DEYTS) and The University of Warwick.  DEYTS is based at Harrington Nursery School in Derby.  It is a very proactive and progressive course with a real focus on teaching and learning.  It really is the place to learn to teach and continue with exciting and varied career development opportunities.  The University of Warwick work in a very unique way with us.  We deliver training in your local area, Derby, and our University colleagues travel to us to train you.\\r\n\\r\nHarrington Nursery School is an 'outstanding' school with a vast array of experiences between the staff team, who can offer you, our graduates, the highest quality opportunities for the foundations of your teacher training.\\r\n\\r\nOur programme is an exciting and innovative programme for people who have some experience of working with children and want to become teachers.  We specialise in Early Years and Key Stage one and will give you the opportunities to 'learn on the job' in a school.  You, the trainee will work as part of the teaching team from day one, learning from experienced colleagues and immediately putting new skills into practice.\\r\n\\r\nThe School Direct course runs for an academic year and leads to qualified teacher status (QTS), a postgraduate certificate in education (PGCE) and masters level credits from the University of Warwick.",
    "TrainWithDisability": "We encourage existing students and applicants to declare any disability or learning difference and contact us in advance to discuss their support requirements to enable us to make reasonable adjustments for the duration of their studies. \\r\n\\r\nPlease note that students with mental health difficulties or disabilities are signposted to and supported by the Mental Health and Wellbeing team and the Counselling Service at the University that are also part of Wellbeing Support Services.\\r\n\\r\nThe University of Warwick and Wellbeing Support Services and DEYTS are are committed to equality, diversity and to promoting an inclusive teaching and learning environment for all.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The University of Warwick is ranked as the top University in the Midlands, one of the top ten in the UK and one of the top 50 in the world.  The University is committed to providing you with the very best training and has a long history of delivering high-quality teacher training.\\r\n\\r\nYou will gain excellent teaching experience for the foundation of your teaching career, whilst training with one of the best University's in the world.",
        "UcasInstitutionCode": "W20"
      }
    ]
  },
  "has_inst": true
}
