{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Exeter",
  "subjects": [
    "Religious education",
    "Secondary"
  ],
  "name": "Religious Education",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "E84/V6X1",
  "providerCode": "E84",
  "programmeCode": "V6X1",
  "schools": [
    {
      "name": "University of Exeter (Exeter Campuses)",
      "address": "PGCE Admissions Office, Northcote House, The Queen's Drive, Exeter, DEVON, EX4 4QJ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "PGCE Admissions Office, Northcote House, The Queen's Drive, Exeter, DEVON, EX4 4QJ",
      "geocode": true,
      "formatted_address": "Northcote House, Exeter EX4 4QB, UK",
      "latitude": 50.7355102,
      "longitude": -3.5353456,
      "post_code": "EX4 4QB",
      "city": "Devon",
      "route": null,
      "postal_town": "Exeter"
    }
  ],
  "providerAddress": {
    "inst_code": "E84",
    "addr_1": "Northcote House",
    "addr_2": "The Queen's Drive",
    "addr_3": "Exeter",
    "addr_4": "Devon",
    "postcode": "EX4 4QJ ",
    "url": "http://www.exeter.ac.uk",
    "geocode": true,
    "formatted_address": "The Queen's Dr, Exeter EX4 4QJ, UK",
    "latitude": 50.7353218,
    "longitude": -3.5350734,
    "post_code": "EX4 4QJ",
    "city": "Devon",
    "route": "The Queen's Drive",
    "postal_town": "Exeter"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "These are the course fees for 2018/19, may be subject to change for 2019/20",
    "AboutCourse": "Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the religious education secondary school curriculum.\\r\n\\r\nYou will consider the purpose of religious education in schools, exploring topics from the purpose of life to morality.\\r\n\\r\nYou will look at creative ways to teach your classes about religious education, such as through drama, art, and class trips.\\r\n\\r\nTypically, you will visit places of worship from the six major religions and engage in dialogue with people from other faiths and cultural backgrounds. It’s a fantastic opportunity for you to discover places across Greater Manchester for your own class trips, once you’re a qualified teacher.\\r\n\\r\nWhen you’re at Manchester Met, you’ll mainly study with your PGCE Religious Education group. You’ll consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona. \\r\n\\r\nYou will also reflect on topics that sit across the curriculum in schools, such as pastoral care, Personal, Social, Health and Economic Education (PSHE), and Citizenship. This helps you to develop subject knowledge that you can use in your future teaching career.\\r\n\\r\nYou won’t simply learn teaching methods with us on-campus though – you’ll teach classes in schools too. \\r\n\\r\nYou will spend at least 120 days on placements in schools, gradually  increasing your involvement to become  the class teacher.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "2:2 UK Honours degree (or international equivalent), which must support the National Curriculum subject knowledge requirements \\r\n\\r\nFor exceptional candidates, particularly those with substantial relevant work experience in schools/relevant occupations, we consider applications from those with a 3rd class degree.\\r\n\\r\nGCSEs grade C/4 or above in English Language and Mathematics (equivalency tests may be offered). We do not accept the following qualifications as equivalent to GCSE: Adult Numeracy or Literacy, Functional Skills or Key Skills\\r\n\\r\nAll PGCE applicants must pass Professional Skills Tests in Numeracy and Literacy. Check the Department of Education website at (www.education.gov.uk/ get-into-teaching) for the latest updates. \\r\n\\r\n",
    "FeeInternational": 15550.0,
    "FinancialSupport": "Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available",
    "InterviewProcess": "Part of the process of applying to study a PGCE course with us is for you to join us at Brooks building for an interview where we can get to know you better and you can demonstrate the skills you have that will make you a great teacher. When you are offered an interview, we will send you a detailed information pack containing everything you need to know in order to prepare effectively for your interview, but here is what you can expect.\\r\n\\r\nIf you have applied to study one of our PGCE Secondary courses, you will have a welcome presentation from our Admissions Tutor to start with, followed by a subject-based interview that usually lasts around 30 minutes.  This will be with the subject tutor and a representative from one of our partnership schools.\\r\n",
    "OtherRequirements": "A Disclosure and Barring Service Check and DfE Fitness to Teach test are also required. \\r\n\\r\nSubject to a satisfactory declaration in relation to the Childcare Disqualification Regulation Act 2009 \\r\n",
    "PersonalQualities": "Successful candidates will demonstrate a good understanding of teaching and learning within a secondary school setting. Candidates may wish to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. ",
    "HowSchoolPlacementsWork": "We try to organise a range of school experiences for you across your two core placements. This helps you to develop your practical teaching skills and explore the types of schools you could work in when you graduate.\\r\n\\r\nWe have partnerships with primary and secondary schools across the North West region. As a trainee teacher, you’ll be expected to travel up to 90 minutes to your placement school.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are leaders in Initial Teacher Education, consistently graded as outstanding in all areas by [Ofsted](https://files.api.beta.ofsted.gov.uk/v1/file/2739445) and ranked 3rd amongst university providers of teacher training in the most recent Good Teacher Training Guide (2017).\\r\n\\r\nOur latest Department for Education statistics (from the 2016 –17 cohort) show that 91% of our PGCE trainees who achieved Qualified Teacher Status secured a teaching post within six months of completion. Of the trainees who completed the course in 2017-18, over 70% were rated as outstanding. \\r\n\\r\nWe have strong partnerships with over 250 schools in the south west where you will spend two-thirds of your training year, putting into practice what you have learnt on the taught course. Our PGCE is uniquely characterised by innovative research-led teaching informed by professional practice and academic excellence. All our tutors have real-world experience as teachers, senior managers or OFSTED inspectors. They lead and innovate, developing the latest ideas in teacher education, leading research, writing textbooks, leading subject networks and advising government.\\r\n\\r\nWe provide unrivalled opportunities for trainees to achieve through our highly original PGCE teaching model ‘The Exeter Model’, praised by OFSTED and cited as an example of best practice. By learning on campus for most of the first term, you access the tools to rapidly build professional knowledge to underpin your work in school placements.\\r\n\\r\nOur unique approach gives you opportunities to become part of a community of trainees and teachers who are passionate about education and will support you during your course and beyond.\\r\n",
    "TrainWithDisability": "The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy.\\r\n\\r\nFor further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\\r\n\\r\nPGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\\r\n\\r\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
