{
  "locationType": "School",
  "accrediting": "University of Exeter",
  "provider": "JCTSA",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "172/25TH",
  "providerCode": "172",
  "programmeCode": "25TH",
  "schools": [
    {
      "name": "Payhembury Primary School",
      "address": "Payhembury, Honiton, EX14 3HT",
      "code": "N"
    },
    {
      "name": "Redstart Teaching Alliance",
      "address": "",
      "code": "Z"
    }
  ],
  "addresses": [
    {
      "address": "Payhembury, Honiton, EX14 3HT",
      "geocode": true,
      "formatted_address": "Payhembury, Honiton EX14 3HT, UK",
      "latitude": 50.80762199999999,
      "longitude": -3.2966088,
      "post_code": "EX14 3HT",
      "city": "Payhembury",
      "route": null,
      "postal_town": "Honiton"
    },
    null
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The programme has four main components\\r\n1. Curriculum studies\\r\n\\r\nThere is substantial preparation for teaching the core subjects of English, Mathematics, and Science through taught sessions combined with self-directed activities based both in the University and carried out in school. There is a particular emphasis on the teaching of writing, reading and mathematics to reflect the government’s current educational priorities. This module also covers the subjects of Art, Computing, Design Technology, Geography, History, Modern Languages, Music, Physical Education, and Religious Education, which are all delivered in shorter practical courses. These courses cater for trainees whose previous experiences may vary widely and aim to give a substantial introduction to the teaching of these subjects.\\r\n\\r\n2. Educational and Professional Studies\\r\n\\r\nThe module content is designed to enable critical reflection on children’s learning and development, pedagogy, diversity, and teachers’ roles and responsibilities in multi-professional contexts. There is engagement with relevant government reports, policies and academic research in order to develop appraisal of contemporary social trends, and issues in theory and practice. The content of the module is inter-dependent with other modules in the programme, and will be developed in the professional studies element of school experience settings, where you will consider the practical implementation of educational principles and policies.\\r\n\\r\n3. School experience\\r\n\\r\nThe University has excellent working relationships with its partnership schools, where trainees will be based for their school experience. School-based tutors and mentors are responsible for trainees’ learning and development and receive well-designed training. Trainees will initially work with groups of children, before taking on more responsibility for planning and independently teaching the whole class. There will be two main placement schools assigned and these will offer contrasting environments.\\r\n\\r\n4. Pathway module (specialist or generalist)\\r\n\\r\nPrimary trainees will receive training in a chosen subject specialism from Art, English, Humanities, Mathematics, Modern Languages, and Science. The specialism builds on your subject knowledge strengths (from your degree or A levels) and aims to prepare you for an eventual role as subject leader or coordinator. Alternatively, we also have a generalist pathway, ‘Primary Teaching and Learning’, which will develop your knowledge, understanding and skills in research-inspired primary teaching and learning across the whole 5-11 curriculum.\\r\n\\r\n\\r\nIt includes two assessments at Masters level, work a total of 60 credits.",
    "CourseLength": "OneYear",
    "Qualifications": "* A 2:1 or above in your first degree\\r\n* Passes at GCSE in English, Mathematics and Science at Grade C. Please note that although the NCTL requirement is a grade C, we will generally only consider applicants with a grade B or above in Mathematics and English and a grade C in Science.\\r\n",
    "InterviewProcess": "Interviews will take place in the home school. You will be interviewed by the head of department, a member of the leadership team and a teacher with responsibility for initial teacher training. Before the interview day, but as part of the interview process, you will be expected to arrange a visit to the school. On the interview day itself you will be asked to observe a lesson and discuss what you notice and you will be asked to work with a small group of students for part of a lesson, supporting them through an activity prepared by their teacher.",
    "HowSchoolPlacementsWork": "JCTSA schools decide on an individual basis in which subjects they wish to offer training. This means that you are applying to a specific school to study your subject. Your contrasting school experience will be as close as possible to your home school but you will need access to a car.\\r\nThere are two school placements. The majority of your in-school experience is done in your home school. This is the school to which you applied for your place. In addition there will be a six-week placement to a contrasting school. \\r\nThe majority of our schools are 11-18 and are judged as good or outstanding. They are all rural and are located in West Dorset, Chard and in South East Devon. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Woodroffe is the lead school in a large alliance of secondary and primary schools. We are an outstanding school, as are a number of our partner schools. Woodroffe is all a regional maths hub, providing specialist maths support to teachers across Dorset and parts of Devon. The Jurassic Coast teaching School Alliance has many years of experience in delivering teacher training programmes, working with The University of Exeter who have been judged by Ofsted as outstanding providers of initial teacher education.",
    "TrainWithDisability": "Our practice with regard to students with disabilities and other needs is in line with that of The University of Exeter.   \\r\n(https://search.exeter.ac.uk/s/redirect?collection=all-exeter-uni&url=http%3A%2F%2Fwww.exeter.ac.uk%2Fmedia%2Funiversityofexeter%2Fcollegeofsocialsciencesandinternationalstudies%2Feducation%2Fpgce%2Fdocuments%2FITE_Fitness_to_Teach_and_Disability_Support_procedure_2018.doc&index_url=http%3A%2F%2Fwww.exeter.ac.uk%2Fmedia%2Funiversityofexeter%2Fcollegeofsocialsciencesandinternationalstudies%2Feducation%2Fpgce%2Fdocuments%2FITE_Fitness_to_Teach_and_Disability_Support_procedure_2018.doc&auth=VvL%2Bz4sSTtW8bG5yJ1304g&profile=_default&rank=1&query=fitness+to+teach)",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "E84"
      }
    ]
  },
  "has_inst": true
}
