{
  "locationType": "School",
  "accrediting": "The University of Warwick",
  "provider": "CAT Teaching School",
  "subjects": [
    "Physics",
    "Science",
    "Secondary"
  ],
  "name": "Physics",
  "slug": "17B/2FZ9",
  "providerCode": "17B",
  "programmeCode": "2FZ9",
  "schools": [
    {
      "name": "Main Site",
      "address": "The Polesworth School, Dordon Road, Polesworth, Tamworth, B78 1QT",
      "code": "-"
    },
    {
      "name": "Ash Green School",
      "address": "Ash Green Lane, Coventry, CV7 9AH",
      "code": "A"
    },
    {
      "name": "Higham Lane School",
      "address": "Shanklin Drive, Nuneaton, Warwickshire, CV10 0BJ",
      "code": "M"
    },
    {
      "name": "Midland Academy Trust",
      "address": "Hinckley Road, Nuneaton, N Warwickshire, CV11 6BH",
      "code": "P"
    }
  ],
  "addresses": [
    {
      "address": "The Polesworth School, Dordon Road, Polesworth, Tamworth, B78 1QT",
      "geocode": true,
      "formatted_address": "Dordon Rd, Dordon, Tamworth B78 1QT, UK",
      "latitude": 52.610547,
      "longitude": -1.620496,
      "post_code": "B78 1QT",
      "city": "Dordon",
      "route": "Dordon Road",
      "postal_town": "Tamworth"
    },
    {
      "address": "Ash Green Lane, Coventry, CV7 9AH",
      "geocode": true,
      "formatted_address": "Ash Green Ln, Ash Green, Coventry CV7 9AH, UK",
      "latitude": 52.4617659,
      "longitude": -1.5093148,
      "post_code": "CV7 9AH",
      "city": "Ash Green",
      "route": "Ash Green Lane",
      "postal_town": "Coventry"
    },
    {
      "address": "Shanklin Drive, Nuneaton, Warwickshire, CV10 0BJ",
      "geocode": true,
      "formatted_address": "Shanklin Dr, Nuneaton CV10 0BJ, UK",
      "latitude": 52.5325832,
      "longitude": -1.4577274,
      "post_code": "CV10 0BJ",
      "city": "Warwickshire",
      "route": "Shanklin Drive",
      "postal_town": "Nuneaton"
    },
    {
      "address": "Hinckley Road, Nuneaton, N Warwickshire, CV11 6BH",
      "geocode": true,
      "formatted_address": "Hinckley Rd, Nuneaton CV11 6LP, UK",
      "latitude": 52.5288098,
      "longitude": -1.4462185,
      "post_code": "CV11 6LP",
      "city": "Warwickshire",
      "route": "Hinckley Road",
      "postal_town": "Nuneaton"
    }
  ],
  "providerAddress": {
    "inst_code": "17B",
    "addr_1": "CATTS (Polesworth and Telford)",
    "addr_2": "Dordon Road",
    "addr_3": "Polesworth",
    "addr_4": "Tamworth",
    "postcode": "B78 1QT ",
    "url": "http://www.thepolesworthschool.com/schooldirect/index.html",
    "geocode": true,
    "formatted_address": "Dordon Rd, Dordon, Tamworth B78 1QN, UK",
    "latitude": 52.6111644,
    "longitude": -1.6193113,
    "post_code": "B78 1QN",
    "city": "Dordon",
    "route": "Dordon Road",
    "postal_town": "Tamworth"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Maintenance grants are available to support living costs during the training year for Home students in England. These are available to trainees whose total household income is less than £42,600. To check eligibility and to apply visit (https://getintoteaching.education.gov.uk/funding-and-salary/overview) \\r\n\\r\nHome and EU students may be eligible for a tuition fee loan to cover the costs of the course. \\r\n\\r\nHome students in England may be eligible for a student maintenance loan to help towards living costs and accommodation. \\r\n\\r\n",
    "AboutCourse": "\\r\nAll students will develop their knowledge of the three disciplines of Science; Biology, Chemistry and Physics. At KS3, students develop an understanding of the fundamental concepts in Science, which will be built upon during their KS4 studies. At GCSE, students will complete either Core and Additional Science, or Separate Science qualifications, which will widen their understanding of scientific concepts and provide them with a potential pathway into further education.\\r\n\\r\nIf you are not at Polesworth as your base school, if there is capacity, there may be an opportunity to experience the sixth form during a complementary placement.\\r\n\\r\nMany schools are now offering Triple Science, and it is a good idea to gain a basic knowledge across all the sciences.  We offer a Subject Knowledge Enhancement Course in all three Sciences, which you can access once  you have a conditional offer of a teacher training place in any route.  Our SKEs are bespoke, tailored to your availability and requirements and can bring you a generous tax free Bursary whilst you train.",
    "CourseLength": "OneYear",
    "Qualifications": "Requirements\\r\nMinimum degree required: Lower Second Degree\\r\nWhilst we prefer a candidate with a good 2:1 degree in the subject, we would consider a good candidate with good, potential teaching skills.\\r\n \\r\nGCSE\\r\nA good pass in Maths and English at GCSE \\r\n\\r\nSkills Test\\r\nThe offer will be conditional on ratification by the University, Skills Test Results, Occupational Health Checks and DBS completion. \\r\n",
    "FinancialSupport": "We offer Subject Knowledge Enhancement Courses in this subject.  These courses bring with them generous tax free Bursaries and are available to applicants holding a conditional offer of a teacher training place.",
    "InterviewProcess": "Potential to Teach\\r\nYou should demonstrate high expectations for your pupils, be passionate about your subject and engage your pupils.\\r\n\\r\nPotential to Reflect\\r\nYou should be able to reflect on all aspects of your planning and teaching so that you can constantly update and amend lessons accordingly to further improve your performance and delivery.\\r\n\\r\nInterview Process\\r\nWhilst every effort will be made to accommodate your choice of campus, staffing capacity changes and for this reason your application may also be circulated to other schools within the partnership. It may be that several schools will express interest in you. This method ensures you have an increased opportunity of a successful outcome.\\r\n\\r\nYou will usually be invited to interview where you will be asked to teach a 20 minute learning activity to a class of pupils.\\r\nFollowing the learning activity, you will have an interview with the Professional Mentor and Head of Department. Some schools may ask you to take part in a Student Panel, or to undertake an activity involving students.\\r\n\\r\nIf all goes well, you will be told the decision and the UCAS website will be updated accordingly.\\r\n",
    "OtherRequirements": "Whilst not a necessity, recent, relevant school experience, or experience of working with young people, is strongly encouraged.  We offer Taster Days and School Experience across most subjects.\\r\n\\r\nThe successful candidate will need to satisfy the necessary safeguarding and prohibition checks and pass the Professional Skills Tests before any offer can be made unconditional.\\r\n\\r\n",
    "PersonalQualities": "We are actively seeking good quality honours graduates with excellent communication skills; who have the ability to enthuse young people about their chosen subject; are able to demonstrate resilience and who are self-starters with the ability to use their initiative.  ",
    "HowSchoolPlacementsWork": "The major benefit of School Direct is being able to select the school in which you are going to do the majority of your training. This choice is often influenced by location and distance travelling from home.\\r\n\\r\nUsually you will spend most of your time at your base school, with one day a week spent at your university (weekly with Warwick and fortnightly with Derby).\\r\n\\r\nWe also have a number of Alliance Days where we deliver part of your training to all trainee teachers from across the partnership.\\r\n\\r\nYour complementary placement takes place after Christmas, usually during the first half of the Spring Term. This is usually set up within the partnership schools and in many cases will be a straight swap between trainees doing the same subject. All the schools within the partnership are within a 30 minute drive of The Polesworth School, which is the Lead School in the Partnership.\\r\n\\r\nTrainees are also required to undertake a minimum of 5 days in a primary setting.\\r\n\\r\nAs well as your university mentor, you will have access to a professional mentor and subject mentor at your base school. You will have support every step of the way and will not be expected to fly solo until you feel you're ready to do so. The expectation is that by the time you finish your course you should be teaching around 70% of a teacher's full timetable.\\r\n\\r\nYou will also be required to undertake a number of written tasks set by the university that will contribute towards a Masters Degree should you wish to complete one. Also, you will be collecting evidence throughout the year to complete your personal learning portfolio which you will use to demonstrate your learning journey.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Each of the schools in CAT Teaching School Alliance has its own distinctive character, reflecting its local community and history, but all share the same commitment to the partnership's ethos. \\r\n\\r\nOutstanding Teaching \\r\nWe believe strongly in the personal growth of all staff within the school and take professional development seriously. \\r\n\\r\nDuring your initial year of training with us you will receive rigorous and regular professional development so that you can progress to being an outstanding teacher. \\r\n\\r\nOur Young People \\r\nWe believe all young people have the potential to achieve great things. Intelligence can be developed regardless of emotional and social background, given appropriate teaching and bespoke, individualised support. They should be equipped with a crucial sense of possibility based on a well-developed self-awareness and ambition, not only for themselves but for the communities in which they live and work. \\r\n\\r\nOur Values extend to how we challenge, support and work with each other. All staff (non-teaching and teaching) play a crucial role in the education of young people. We all understand how our work has a direct influence on the life chances of the young people in our care. In the same way that we all have a duty of care to them, we have a duty of care to each other and have regard for each other's professional and personal well-being. \\r\n\\r\n",
    "TrainWithDisability": "Working closely with our partner schools and with our University partners, reasonable adjustments can be put in place for students with a disability or specific learning differences, to ensure they can successfully complete their course and get the most out of their time with us.\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We partner with the Centre of Teacher Education at the University of Warwick, a top-ranked university in the Midlands, graded Ofsted Outstanding. \\r\n\\r\nYou will be training with a school in partnership with a university where 98% of trainees find employment upon completion.\\r\n\\r\nYou will have a personal tutor to support you, both at the school and at the university throughout your time with us, and you will benefit from the support of a strong network of trainees throughout the alliance.",
        "UcasInstitutionCode": "W20"
      },
      {
        "Description": "We have recently partnered with the University of Derby through School Direct, as it has a strong reputation for nurturing successful, confident and forward-thinking teachers. \\r\n \\r\nPractical teaching experience and high-quality placements will help to build your classroom skills and with the excellent support you will receive from expert mentors, you will be part of the team from Day One.\\r\n\\r\nTrainees who have graduated from Derby University may also benefit from reduced course fees should you choose to continue teacher training within our partnership with Derby University.\\r\n\\r\n",
        "UcasInstitutionCode": "D39"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "C55"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "L79"
      }
    ]
  },
  "has_inst": true
}
