{
  "locationType": "School",
  "accrediting": "University of East London",
  "provider": "ELEYSP",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "25U/2W2M",
  "providerCode": "25U",
  "programmeCode": "2W2M",
  "schools": [
    {
      "name": "Main Site",
      "address": "Sheringham Avenue, London, E12 5PB",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Sheringham Avenue, London, E12 5PB",
      "geocode": true,
      "formatted_address": "Sheringham Ave, London E12 5PA, UK",
      "latitude": 51.5535496,
      "longitude": 0.06005919999999999,
      "post_code": "E12 5PA",
      "city": "Greater London",
      "route": "Sheringham Avenue",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "25U",
    "addr_1": "East London Early Years and Schools",
    "addr_2": "Partnership, Elkington road,",
    "addr_3": "Plaistow",
    "addr_4": "London",
    "postcode": "E13 8LH ",
    "url": "http://www.eleysp.co.uk",
    "geocode": true,
    "formatted_address": "Kaizen Primary School, Elkington Rd, London E13 8LH, UK",
    "latitude": 51.521288,
    "longitude": 0.0270019,
    "post_code": "E13 8LH",
    "city": "Greater London",
    "route": "Elkington Road",
    "postal_town": "London"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "You will learn how to be a nursery or primary class teacher. By the end of the year, you will understand how to teach the entire primary curriculum to a class of 30 pupils, and be confident and competent in doing so.\\r\n\\r\nYou will leave the course with outstanding subject knowledge across the curriculum. You will have an understanding of how to plan and deliver engaging and motivating lessons and how to support your pupils’ progress.\\r\n\\r\nYou will learn how to identify the strength and needs of your pupils and make sure that everyone in your class is included and challenged.\\r\n\\r\nEveryone on the School Direct non-salaried programme learns how to teach the whole curriculum, and you may specialise in Early Years. You will then have extra sessions that improve your practice and understanding of teaching in nursery, reception and Key Stage 1 classes.\\r\n\\r\nYou'll cover:\\r\n*Learning and teaching across the curriculum and effective pedagogy (core)\\r\n*Developing and extending understanding of a specific area/subject (core)\\r\n*Professional practice: inclusive practice in multicultural urban settings(core)\\r\n*Developing Understanding and Skills in English and Mathematics (core)\\r\n*Managing Professional Change and Development : active inquiry leading to classroom intervention (option)\\r\n*Critical Incidents in Teaching (core)\\r\n*Technology-enhanced Learning (core)\\r\n\\r\nYou are assessed against the Teachers’ Standards, leading to recommendation for Qualified Teacher Status (QTS). You also have to complete assignments that contribute to your understanding of teaching and learning and carry academic credit, leading to the award of a PGCE.\\r\n\\r\nYou will complete two Level 7 (master’s level) assignments. For both of these you will need to read and understand literature about good practice and then think and write about your own practice. The 60 Level 7 credits will contribute to the PGCE award.\\r\n\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You will need a GCSE C or 4 or above (or an equivalence exam) in English, maths and science.\\r\n\\r\nYour degree will need to be graded at 2:2 Honours or above.\\r\n\\r\nIf you do not have the required GCSE qualifications or grades you can sit an A Star Teacher’s Equivalency Exam. Further information is available at (https://www.astarteachers.co.uk/equivalency-and-professional-development/booking) \\r\n\\r\nIf you who hold a degree or qualifications from a non-UK institution, you must verify their equivalence through the National Recognition Information Centre for the UK (NARIC). \\r\nPlease go to (http://www.naric.org.uk) for information on their services.",
    "InterviewProcess": "Your application will be short listed, and you may be invited to interview at our lead school, Kaizen primary school.\\r\nThe interview process will consist of an observation, an individual interview with leaders from across our Alliance of schools, a numeracy and a literacy test (equivalent to Year 6 outcomes), an opportunity for you to ask any questions and possibly a group task and will last for the duration of a morning.\\r\nFor the observation you will be asked to work with a small group of children from any year group, including Nursery and Reception, (excluding year 6). \\r\nYour session should be based on a plan you have prepared using a book, poem, maths activity etc. \\r\n",
    "PersonalQualities": "We are looking for reflective, hard working and committed people who are ready to listen and learn.\\r\n\\r\nWe recommend you have some experience of working with children, but this is not essential.",
    "HowSchoolPlacementsWork": "You will spend most of the first seven weeks at the University of East London in the purpose-built education building. Here you will look at pedagogy (how to teach) and curriculum (what to teach). \\r\nYou will develop your knowledge of all subjects and your understanding of how to support pupils’ learning across the curriculum, including one keynote lecture a week. \\r\n\\r\nDuring this initial period, Mondays will be spent in primary schools or nurseries observing. Here, you will develop your understanding by watching examples of good or outstanding practice.\\r\n\\r\nDuring the year you will  spend three blocks of full-time school-based training in three different schools, each eight weeks long.\\r\n\\r\nYour first placement usually begins in the middle of October. Your tutors will decide where you go on placement and arrange for it to be as convenient as possible for you.\\r\n\\r\nYou will be teaching, not helping, on the placement. You will start off working with groups of pupils but your role is not to help the teacher – it is to support and increase the pupils’ learning.\\r\n\\r\n You will have a school-based mentor (a teacher employed by the school) as well as a professional tutor from UEL who will visit you during each placement. This is partly to moderate and assess the quality of your work, but also to give you support, guidance and feedback.\\r\nIn principle, your three placements will be in different schools. However, schools sometimes ask for trainees to return for a second placement.\\r\n\\r\nThis School Direct programme offers you the chance to teach children aged from 3 -11."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are delighted you are interested in teacher training with the East London Early Years and Schools Partnership.\\r\n\\r\nWe think that every child deserves a great education, and in particular, we must do everything possible to give children living in social and economic disadvantage the best start in life and learning. This means that we want to find the very best people and help them to become effective and inspirational teachers. \\r\n\\r\nPeople like you.\\r\n\\r\nOur specialisms include:\\r\n* learning about the Early Years, in outstanding Nursery Schools as well as in Primary Schools\\r\n* Working with a wide range of local Primary schools (all rated outstanding or good by Ofsted)\\r\n* Developing trainees' understanding of how to make the best curriculum for all, regardless of ability.\\r\n\\r\nAnd because we work so well as an alliance of schools, we're able to draw on high levels of expertise to ensure that you get the personalised support, mentoring and input you need so that you can be the very best teacher you can be.\\r\n\\r\nWe also offer the unique opportunity to spend time in a contrasting location - the Lake District - observing practice and taking part in teaching in our partner school there.\\r\n\\r\nWe look forward to welcoming you to East London.\\r\n",
    "TrainWithDisability": "Our schools aim to meet their obligations under the public sector equality duty by having due regard to the need to:\\r\n\\r\n*Eliminate discrimination and other conduct that is prohibited by the Equality Act 2010;\\r\n*Advance equality of opportunity between people who share a protected characteristic and people who do not share it;\\r\n*Foster good relations across all characteristics - between people who share a protected characteristic and people who do not share it.\\r\n\\r\nHigh quality tutoring by the University of East London ensures that individual needs are identified and communicated and structured plans are put into place, quickly and effectively. This means that trainees' needs are well met and responded to in a timely way. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We're proud to work in partnership with the University of East London, who have an excellent reputation for preparing teachers to work in multi-ethnic and multilingual urban schools and successfully train up to 600 teachers every year.\\r\n\\r\nYou'll benefit from the excellent core learning from The University of East London, delivered by experienced and expert practitioners, as well as individual tutoring to ensure you stay on track and get the support you need to succeed.\\r\n",
        "UcasInstitutionCode": "E28"
      }
    ]
  },
  "has_inst": true
}
