{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Exeter",
  "subjects": [
    "Languages",
    "Primary"
  ],
  "name": "Upper Primary with Modern Foreign Languages",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "E84/XR9C",
  "providerCode": "E84",
  "programmeCode": "XR9C",
  "schools": [
    {
      "name": "University of Exeter (Exeter Campuses)",
      "address": "PGCE Admissions Office, Northcote House, The Queen's Drive, Exeter, DEVON, EX4 4QJ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "PGCE Admissions Office, Northcote House, The Queen's Drive, Exeter, DEVON, EX4 4QJ",
      "geocode": true,
      "formatted_address": "Northcote House, Exeter EX4 4QB, UK",
      "latitude": 50.7355102,
      "longitude": -3.5353456,
      "post_code": "EX4 4QB",
      "city": "Devon",
      "route": null,
      "postal_town": "Exeter"
    }
  ],
  "providerAddress": {
    "inst_code": "E84",
    "addr_1": "Northcote House",
    "addr_2": "The Queen's Drive",
    "addr_3": "Exeter",
    "addr_4": "Devon",
    "postcode": "EX4 4QJ ",
    "url": "http://www.exeter.ac.uk",
    "geocode": true,
    "formatted_address": "The Queen's Dr, Exeter EX4 4QJ, UK",
    "latitude": 50.7353218,
    "longitude": -3.5350734,
    "post_code": "EX4 4QJ",
    "city": "Devon",
    "route": "The Queen's Drive",
    "postal_town": "Exeter"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "We run different pathways within our Primary PGCE programme and applicants should apply to the [pathway(s)](https://www.exeter.ac.uk/teachertraining/primary/structure/) they are interested in.  Our [Upper Primary with Modern Languages course](https://www.exeter.ac.uk/teachertraining/primary/mfl/) trains you to become a primary classroom teacher but also provides an additional strand in languages education to help prepare you to become a future curriculum coordinator.\\r\n\\r\nTerm 1 begins with two weeks of preliminary school experience. This leads into the university-based course. You will spend two weeks in November in your first placement school to begin your classroom practice.\\r\n\\r\nTerm 2 is spent in your first placement school with three seminar days held at the University. \\r\n\\r\nTerm 3 is spent in your second school placement with two seminar days held at the University. \\r\n\\r\nThe four components:\\r\n1. Curriculum studies - This includes preparation for teaching the core subjects (English, Mathematics, and Science) and the subjects of Art, Computing, D&T, Geography, History, Modern Languages, Music, PE, and RE, delivered in shorter practical courses. These courses cater for trainees whose previous experiences may vary widely and give a substantial introduction to teaching these subjects. \\r\n\\r\n2. Educational and Professional Studies - This component is designed to enable critical reflection on children’s learning and development, pedagogy, diversity, and teachers’ roles and responsibilities in multi-professional contexts. This component includes one summative assignment worth 30 Masters level credits.\\r\n\\r\n3. School experience - Central to the course is the developing your ability to meet the DfE’s Teachers’ Standards which trainees must demonstrate in order to be recommended for Qualified Teacher Status (QTS). School-based tutors and mentors are responsible for your learning & development and receive well-designed training. You initially work with groups of children, before taking on more responsibility for planning and independently teaching whole classes. You will have two main placements offering contrasting environments.\\r\n\\r\n4. Pathway (MFL) - The MFL pathway focusses on developing knowledge, understanding and skills to teach languages effectively within the primary curriculum and the role languages play as a statutory element of the National Curriculum. You will develop your reflective and analytical skills as a professional practitioner and languages specialist. It is taught mainly through seminars, workshops and placements that enable you to develop your specialism.  Placements are in Key Stage 2 settings, however the course covers teaching and learning from 5-11 and once qualified, you will be eligible to teach across the primary age-range. It includes one summative assignment worth 30 Masters-level credits.",
    "CourseLength": "OneYear",
    "Qualifications": "Applicants should have a 2:1 or above in their first degree. We expect applicants to have at least good A-level French, Spanish or German, preferably to degree level, or to have spent time living in a French, Spanish or German-speaking country. Some experience of a second language would be an advantage, but is not essential.\\r\n\\r\nPasses at GCSE in English, Mathematics and Science at Grade C/4. Please note that although the DfE requirement is a grade C/4, we will generally only consider applicants with a grade B/5 or above in Mathematics and English and a grade C/4 in Science.\\r\n",
    "FeeInternational": 16900.0,
    "FinancialSupport": "For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\\r\n\\r\nThe University of Exeter offers a £520 bursary to all UK students studying for a PGCE with us in 2019/20, whose household income is £25,000 or less. There is no separate application procedure for this bursary. Instead, we make an assessment using the household income information you provide to Student Finance England (you must make sure you give consent for details of your SfE application to be shared with the University of Exeter). This consent to share is requested during the application for financial support, but can be given at any time throughout the year by contacting SfE. \\r\n\\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages",
    "InterviewProcess": "The PGCE interview day comprises various elements, all designed so that you can showcase (and so we can assess) your skills, attributes and subject knowledge.\\r\nWe notify all interviewees ahead of time what will be expected of them on interview day, so you have plenty of time to prepare. Primary and secondary interviewees attend on the same day and activities in the morning are conducted in mixed subject groups. The day is divided up as follows:\\r\n * A welcome talk so you can find out about the structure of the programme, including school placements and the taught course \\r\n * A short written task in which you can demonstrate your subject knowledge and understanding of current issues in education\\r\n * A document check so you can bring with you your certificates (you will be told what to bring)\\r\n * A short presentation in which you present a teaching idea using an artefact of your choice\\r\n * A short discussion about a filmed lesson which encourages you to explore your own, and others’, ideas about good teaching\\r\n * A one-to-one interview with an Admissions Tutor. This is where pathway tutors will discuss your application, your suitability for teaching and your subject knowledge. This is also an opportunity to learn about the particular course you are applying for\\r\n\\r\nThe interview day is designed to give you a flavour of the PGCE programme. There will be plenty of opportunities to ask questions on the day. You should allow a full day for the interview.",
    "OtherRequirements": "In addition to the academic requirements listed, selection is based on performance at interview, passes in both professional skills tests, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure.\\r\n\\r\nAlthough not essential it would be an advantage to be able to reflect on any school-based experience or experience working with young people in another context at interview.\\r\n\\r\nThe ‘Qualifications’ section describes our standard offer. However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through UCAS for consideration or contact our [PGCE Admissions team](https://www.exeter.ac.uk/teachertraining/contact/) for more information.",
    "HowSchoolPlacementsWork": "You will be working within at least two schools during the course and all of our partner schools have specially trained mentors who will assist you in learning to teach. These colleagues are essential to your development as a teacher and will help you to develop both classroom skills and reflective and evaluative strategies. Together with schools, we will provide you with opportunities, training and support.\\r\n\\r\nThe University of Exeter currently has partnership agreements with over 250 schools across most parts of the South West (Cornwall, Devon, Dorset and Somerset).\\r\n\\r\nEvery effort is made to take into consideration your personal circumstances and preferences when allocating your placements. Trainees generally live in and around Exeter for the Autumn term, and then move to the area their placements will be in. Once on placement, there are 5 seminar days on campus throughout the year, offering the opportunity to share experiences and good practice. You can claim a contribution towards expenses for these days if you are living away from Exeter.\\r\n\\r\nOur accommodation office can offer advice regarding finding accommodation for the Autumn term. Many trainees will be placed further afield than Exeter for the whole of their school-based work, and will need to find accommodation in that area. Once registered, we provide an accommodation database, which lists many accommodation options previously used by our trainees. Many trainees live together during their time on placement and some live with school staff.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are leaders in Initial Teacher Education, consistently graded as outstanding in all areas by [Ofsted](https://files.api.beta.ofsted.gov.uk/v1/file/2739445) and ranked 3rd amongst university providers of teacher training in the most recent Good Teacher Training Guide (2017).\\r\n\\r\nOur latest Department for Education statistics (from the 2016 –17 cohort) show that 91% of our PGCE trainees who achieved Qualified Teacher Status secured a teaching post within six months of completion. Of the trainees who completed the course in 2017-18, over 70% were rated as outstanding. \\r\n\\r\nWe have strong partnerships with over 250 schools in the south west where you will spend two-thirds of your training year, putting into practice what you have learnt on the taught course. Our PGCE is uniquely characterised by innovative research-led teaching informed by professional practice and academic excellence. All our tutors have real-world experience as teachers, senior managers or OFSTED inspectors. They lead and innovate, developing the latest ideas in teacher education, leading research, writing textbooks, leading subject networks and advising government.\\r\n\\r\nWe provide unrivalled opportunities for trainees to achieve through our highly original PGCE teaching model ‘The Exeter Model’, praised by OFSTED and cited as an example of best practice. By learning on campus for most of the first term, you access the tools to rapidly build professional knowledge to underpin your work in school placements.\\r\n\\r\nOur unique approach gives you opportunities to become part of a community of trainees and teachers who are passionate about education and will support you during your course and beyond.\\r\n",
    "TrainWithDisability": "The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy.\\r\n\\r\nFor further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\\r\n\\r\nPGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\\r\n\\r\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
