{
  "locationType": "School",
  "accrediting": "ARK Teacher Training",
  "provider": "ARK Teacher Training",
  "subjects": [
    "Physics",
    "Science",
    "Secondary"
  ],
  "name": "Physics",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1CS/2DHJ",
  "providerCode": "1CS",
  "programmeCode": "2DHJ",
  "schools": [
    {
      "name": "Ark Teacher Training - Birmingham",
      "address": "Birmingham: various",
      "code": "B"
    },
    {
      "name": "Ark Teacher Training - London",
      "address": "London: various",
      "code": "L"
    },
    {
      "name": "Ark Teacher Training - Portsmouth",
      "address": "Portsmouth: various",
      "code": "P"
    },
    {
      "name": "Ark Teacher Training - Hastings",
      "address": "Hastings: various",
      "code": "S"
    }
  ],
  "addresses": [
    {
      "address": "Birmingham: various",
      "geocode": true,
      "formatted_address": "Birmingham, AL, USA",
      "latitude": 33.5206608,
      "longitude": -86.80248999999999,
      "post_code": null,
      "city": "Birmingham",
      "route": null
    },
    {
      "address": "London: various",
      "geocode": true,
      "formatted_address": "London, UK",
      "latitude": 51.5073509,
      "longitude": -0.1277583,
      "post_code": null,
      "city": "London",
      "route": null,
      "postal_town": "London"
    },
    {
      "address": "Portsmouth: various",
      "geocode": true,
      "formatted_address": "Portsmouth, NH 03801, USA",
      "latitude": 43.0717552,
      "longitude": -70.7625532,
      "post_code": "03801",
      "city": "Portsmouth",
      "route": null
    },
    {
      "address": "Hastings: various",
      "geocode": false
    }
  ],
  "providerAddress": {
    "inst_code": "1CS",
    "addr_1": "65 Kingsway",
    "addr_2": "Holborn",
    "addr_3": "London",
    "addr_4": null,
    "postcode": "WC2B 6TD",
    "url": "http://www.arkteachertraining.org",
    "geocode": true,
    "formatted_address": "65 Kingsway, London WC2B 6TD, UK",
    "latitude": 51.5153584,
    "longitude": -0.1193645,
    "post_code": "WC2B 6TD",
    "city": "Greater London",
    "route": "Kingsway",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "- On the School Direct (tuition fee) route you will be responsible for paying your own tuition fee of £9,000 to Ark Teacher Training, whether or not you are eligible for a Department for Education bursary. \\r\n\\r\n- To see if you're eligible for a tax-free government bursary, click [HERE](https://getintoteaching.education.gov.uk/funding-and-salary/overview).\\r\n\\r\n- As long as you're eligible, you can register with Student Finance to give you a a student loan to help you with payment of the tuition fee while you train, so that you don't have to worry about it during the training year. Click [HERE](https://www.gov.uk/student-finance) to check if you are eligible.\\r\n\\r\n- Any questions relating to your tuition fee payment through the Student Finance should be directed to them, as Ark Teacher Training does not control this.",
    "AboutCourse": "Ark Teacher Training gives you a firm and solid foundation in how to teach physics. Over the year you will have regular training sessions which are focused on how to be a great teacher of physics. During these sessions, we will cover a range of teaching approaches and methods to inspire and motivate pupils. \\r\n\\r\nWe will also cover how to teach children the analytical and mathematical skills that are critical to Physics, whilst covering approaches to ensure that pupils have a solid grasp of core concepts across all three sciences. \\r\n\\r\nAcross our network, our Physics teachers also have the chance to share resources and ideas between their own school and other partnership schools. They come together in subject-specific hub days, and work with our Network Lead for Science to improve the Science provision for KS3, GCSE and A-level across the network. By collaborating like this, all our Physics teachers have great support, and are equipped with the tools to enable our pupils to receive the best possible education.",
    "CourseLength": "OneYear",
    "Qualifications": "Click [here](https://www.arkteachertraining.org/apply-now/eligibility-criteria/) for a full overview of our qualification requirements. \\r\n\\r\n- If you studied overseas, consult [NARIC](https://www.naric.org.uk/naric/) before applying. \\r\n\\r\n- Certain entry requirements for teacher training are [set by the government](https://getintoteaching.education.gov.uk/eligibility-for-teacher-training) and all applicants must comply. \\r\n\\r\n- Others are specific to a training provider, and we have listed ours below. \\r\n\\r\nArk Teacher Training requirements:\\r\n- a 2:2 degree or higher\\r\n- good A-levels (B+ in 2 or more) \\r\n- either your degree or an A-level in the subject you wish to train in (for subject knowledge purposes / your readiness to start!)\\r\n",
    "InterviewProcess": "Once you've checked that you're eligible, you can either submit your application directly through the UCAS portal or use our ‘Apply Now’ form, which is available on our website. We will then assess your application and let you know whether or not you meet our programme criteria. Applicants who meet our criteria will be sent two online tests to complete: a situational judgement assessment and a subject knowledge test.\\r\n\\r\nSuccessful applicants after this stage will proceed to the final school-based assessment. Our team will use the information we have about you to match you to one of our training schools, and this final stage will take place there. It will involve you teaching a short lesson as well as a final interview with senior staff and subject lead. We’ll let you know the outcome shortly after this date, and will ask you to complete your UCAS form if not already so we can finalise our decision through the UCAS portal. ",
    "OtherRequirements": "There's a lot to think about when you make the decision to train as a teacher: it's an intensive year, but on Ark Teacher Training you'll be well-supported and have plenty of time with your fellow trainees for moral support every week. \\r\n\\r\nIf you have questions about areas not covered in this search tool so far, our website covers a lot of specific information on our programme. Check out our ['Frequently Asked Questions'](https://www.arkteachertraining.org/apply-now/application-faqs/) if you can't find what you're looking for!",
    "PersonalQualities": "Our applicants have a huge variety of experience between them, all of which can be used in the classroom.\\r\n\\r\nHowever, there are some qualities we know all successful trainees have, regardless of their background or experience; we look for these at assessment: \\r\n\\r\n- Alignment with Ark’s values and ethos\\r\n- Some experience with young people (doesn't have to be in a school)\\r\n- Great communication skills\\r\n- Resilience (teaching is hard!)\\r\n- Curiosity and eagerness to learn\\r\n- Self-awareness and keenness to hear/act on feedback (you'll receive a lot on our programme, every week!)",
    "HowSchoolPlacementsWork": "Your training school will be matched to your particular profile as a candidate, while taking into account your commuting distance and funding/subject preferences (and availability on our programme). \\r\nThe training programme is 100% school-based, but you will come out of school to spend a half day every week in a session with your Ark tutor and other trainees from the network. \\r\n\\r\nYou’ll also obtain experience in different schools throughout the year; you’ll have a contrasting school placement lasting 2 weeks, in a school very different to your own, and which you will have significant input into choosing (for example, it might be a PRU, an independent school, etc). You’ll also get to participate in a series of visits to a range of educational settings."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "[Ark Teacher Training](http://www.arkteachertraining.org) is an [Outstanding](https://www.arkteachertraining.org/about-us/ofsted/)  two-year programme that allows graduates and career changers to become highly-effective, inspiring teachers, [learning from some of the best educators in the profession](https://www.arkteachertraining.org/your-training-year/).\\r\n\\r\nWe work in low income areas with a history of academic underachievement, striving for the best outcomes for all our pupils, regardless of their background. According to the [Department for Education](http://www.suttontrust.com), Ark makes the biggest difference in transforming the lives of disadvantaged students out of all the major school groups.\\r\n\\r\n- Classroom teaching: from day one, you’ll be in the classroom so you can have an impact straight away. Your tutor and coach will support you to build up your independent teaching time during the year.\\r\n\\r\n- School orientation experience: before your course starts, spend time in your school meeting your new colleagues and interacting with pupils so you can hit the ground running in September.\\r\n\\r\n- Summer School: all new trainees come together over two weeks in August for an introduction to the programme, our schools and the principles of great teaching. You’ll also cover the essential elements of behaviour management, ready for day one.\\r\n\\r\n- Weekly coaching and co-planning: every week you'll be observed by your in-school coach, so they can offer you both positive feedback and bite-sized improvement targets.\\r\n\\r\n- Your trained coach will help you to create effective lessons, developing your planning skills and giving you the opportunity to ask detailed subject -knowledge questions.\\r\n\\r\n- Weekly training: leave school behind for in-person training sessions with your tutors/peers. ",
    "TrainWithDisability": "- Disabled access\\r\n\\r\nWe want to make sure that our training programme is open to everybody, so if you have a disability we will make every reasonable adjustment to accommodate you throughout the recruitment process, as well as during the training programme if you are offered a place. \\r\n\\r\nPlease provide us with details if you would like us to make any adjustments for you on the assessment day. This will in no way affect the outcome of your application.\\r\n\\r\nWhenever we build new schools, we ensure they have wheelchair access to classrooms. However, when an existing school joins the network, we have to work with the existing buildings and these can sometimes have limited accessibility. \\r\n\\r\n- Study Facilities\\r\nWhile your PGCE qualification is accredited by Goldsmiths, University of London, you won’t have to go there to attend lectures or seminars; the majority of your training sessions will take place in one of our schools or at Ark's central office. However, you will still have access to the online journals, library facilities and student support services provided by Goldsmiths. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "As well as Newly Qualified Teacher status, you will also finish the year having obtained a PGCE, which is an internationally recognised qualification and carries 60 Masters-level credits.\\r\n\\r\n- Ark Teacher Training is the accrediting provider of your QTS.\\r\n\\r\n- [Goldsmiths University](https://www.gold.ac.uk/) is the accrediting provider of your PGCE.",
        "UcasInstitutionCode": "1ZU"
      }
    ]
  },
  "has_inst": true
}
