{
  "locationType": "School",
  "accrediting": null,
  "provider": "Carmel Teacher Training Partnership (CTTP)",
  "subjects": [
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages",
  "slug": "C23/R9X1",
  "providerCode": "C23",
  "programmeCode": "R9X1",
  "schools": [
    {
      "name": "Main site",
      "address": "The Headlands, Darlington, DL3 8RW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "The Headlands, Darlington, DL3 8RW",
      "geocode": true,
      "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
      "latitude": 54.5236052,
      "longitude": -1.5836444,
      "post_code": "DL3 8RP",
      "city": "Darlington",
      "route": "The Headlands",
      "postal_town": "Darlington"
    }
  ],
  "providerAddress": {
    "inst_code": "C23",
    "addr_1": "The Headlands",
    "addr_2": "Darlington",
    "addr_3": null,
    "addr_4": "Co. Durham",
    "postcode": "DL3 8RW ",
    "url": "http://www.carmel.org.uk",
    "geocode": true,
    "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
    "latitude": 54.52360299999999,
    "longitude": -1.5825947,
    "post_code": "DL3 8RP",
    "city": "Darlington",
    "route": "The Headlands",
    "postal_town": "Darlington"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The programme is designed for those intending to teach French, German or Spanish as their subject specialism; all students must be able to offer French as at least their second language. The aim is to give you an understanding of the way modern foreign languages are taught in schools, including the use of the target language as the principal means of classroom communication. \\r\n\\r\n\\r\nYou will be encouraged to try out a wide range of approaches to teaching, as well as strategies for organising the classroom for effective learning. University sessions include a large amount of practically based activities to help you develop your skills. You will have the opportunity to acquire an understanding of the demands of the National Curriculum orders for modern foreign languages. The work in schools will be closely linked with the university-based sessions so that you will have the opportunity to use a range of up-to-date language resources, including ICT, to set up active and engaging learning activities. \\r\n\\r\nFor more information please visit our website here. \\r\n(https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-modern-foreign-languages-specialism/)\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Applicants should have a degree with French, German or Spanish as a major component. The ability to offer a second language is essential. We welcome applications from native speakers who have a degree in another subject.\\r\n\\r\nStudents must have achieved at least a grade C or above in both Mathematics and English Language GCSEs (or approved equivalents), applicants without one or both of these GCSEs (or approved equivalents) will be considered for interview. If you do not currently hold a GCSE grade C or above in Mathematics and English Language, we accept the equivalency tests offered by Equivalency Testing.\\r\n",
    "InterviewProcess": "On the interview day you will be registered by a member of the admissions team. There will then be a course talk and an introduction to the subject tutors. There will be a group interview, this is a discussion based on what you have learned from your observations in school and teaching in general. \\r\n\\r\nFollowing the group task will be individual interviews with the subject tutor lasting 20-45 minutes you will have an opportunity to ask questions about the course during the interview. You may be asked to discuss a portfolio where relevant, or to give a presentation. \\r\n\\r\nThere will also be a written task, where you will be asked to write a short piece on the role of your subject within the national curriculum. This is to check your Spelling, Punctuation and Grammar, and to see what your response would be to writing at Master’s level.\\r\n\\r\nThese interview elements are not intimidating, but carefully planned to give you the best possible opportunity to show your potential for teaching and working with young people in school. A teacher from one of our partner schools may take part in the interview.",
    "OtherRequirements": "Pre entry Professional Skills Test All students starting an Initial Teacher Training (ITT) course from September 2013 are required to pass the Professional Skills tests in literacy and numeracy before the start of the programme (www.education.gov.uk). ",
    "HowSchoolPlacementsWork": "During school placements, students benefit from working alongside experienced teachers of art and design. Students have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Carmel Teacher Training Partnership (CTTP) is an outstanding Initial Teacher Training Provider based at Carmel College Darlington, an outstanding 11-18 college. Our training programmes are Primary 5-11 years and Secondary 11-16. We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary and secondary schools, widely spread across the North East of England. The CTTP School Centred Initial Teacher Training course aims to promote excellence in all aspects of education.  This is achieved through high quality central and school-based training activities, regular observations with developmental feedback, to secure progress throughout the training programme.  Central training takes place in clusters around our Lead Schools. Our overarching aim is to provide the most skilled and competent practitioners for our schools, improving the outcomes and life chances for young people. \\r\n\\r\nA very high percentage of trainees on our programme either gain employment in their placement schools, or within our Partnership of schools. Carmel Teacher Training Partnership is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees. Successful completion leads to Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards Masters accreditation, which is completed via the flying faculty of St.  Mary’s University Twickenham but delivered at Carmel College and one of our Northern Lead schools, St Cuthbert’s High, Newcastle.  \\r\n",
    "TrainWithDisability": "All Schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site. Please contact Claire Hutton on chutton@carmel.org.uk with any specific disability access requirements.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
