{
  "locationType": "School",
  "accrediting": "Liverpool John Moores University",
  "provider": "Longford Park School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1Z7/2M4X",
  "providerCode": "1Z7",
  "programmeCode": "2M4X",
  "schools": [
    {
      "name": "Main Site",
      "address": "74 Cromwell Road, Stretford, Manchester, M32 8QJ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "74 Cromwell Road, Stretford, Manchester, M32 8QJ",
      "geocode": true,
      "formatted_address": "74 Cromwell Rd, Stretford, Manchester M32 8QJ, UK",
      "latitude": 53.4480058,
      "longitude": -2.2943669,
      "post_code": "M32 8QJ",
      "city": "Stretford",
      "route": "Cromwell Road",
      "postal_town": "Manchester"
    }
  ],
  "providerAddress": {
    "inst_code": "1Z7",
    "addr_1": "74 Cromwell Road",
    "addr_2": "Stretford",
    "addr_3": "Manchester",
    "addr_4": null,
    "postcode": "M32 8QJ ",
    "url": "http://www.longford.trafford.sch.uk/",
    "geocode": true,
    "formatted_address": "74 Cromwell Rd, Stretford, Manchester M32 8QJ, UK",
    "latitude": 53.4480058,
    "longitude": -2.2943669,
    "post_code": "M32 8QJ",
    "city": "Stretford",
    "route": "Cromwell Road",
    "postal_town": "Manchester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Full Primary PGCE course\\r\n\\r\nThis course provides Primary PGCE qualification with Qualified Teacher Status (QTS) through Liverpool John Moores University, enabling employment in mainstream or SEN schools.  Our programme is delivered alongside that of the Palmerston Alliance.  Lis Burbage, Headteacher Palmerston School 0151 428 2128, \\r\nemail -  palmerston-ht@palmerston.liverpool.sch.uk \\r\n\\r\n\\r\nThe Liverpool John Moores University taught programme focuses predominantly on developing your subject knowledge and subject pedagogy.  Sessions are led by subject experts and are designed to equip students with the knowledge, understanding and skills needed to become confident teachers.  In addition, lead lectures and seminars develop student teachers’ confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being. Sessions are largely workshop-based and participatory so that theoretical, research-informed teaching is explicitly linked to its practical implications for the classroom.\\r\n\\r\nThe Postgraduate Certificate is assessed through the 2 Modules.  The course team and our Partnership schools have worked together to ensure that the PGCE Award is both relevant and manageable.  The Award of QTS is integral to one of the academic Modules.  Trainees also submit one academic essay in two parts which focuses on reflecting on aspects of your practice.\\r\n\\r\n60 credits towards Masters\\r\nLiverpool John Moores University provides a number of days teaching and learning towards a Masters, enabling 60 credits to be achieved during this year. \\r\n\\r\nExperience a range of SEN with placements at specialised schools.\\r\n\\r\nThe partnership covers all aspects of SEN including autism, behavioural, visual impairment.  A home school placement and two assessed placements, plus day/half day shadowing of other students, will ensure all aspects are covered during the year. \\r\n\\r\nPlacement schools are all located within the Trafford borough.\\r\nNetworking opportunities are available throughout the year with trainees registered as part of our Consortia, these days and training days are usually held at a venue in Liverpool.\\r\n\\r\nOur experienced teachers and mentors will guide you through the course.  As a trainee teacher you will be encouraged to adopt and develop a reflective approach to your learning.  We have found this practice is powerful and will support your continued professional growth throughout your career in teaching.\\r\n\\r\nAll our School Direct vacancies are offered as Unsalaried.\\r\n\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Minimum 2:2 degree\\r\nA-C GCSE's or equivalent in maths and english, and science\\r\nPass the professional skills tests numeracy & literacy\\r\n",
    "FeeInternational": 14000.0,
    "FinancialSupport": "Various Bursaries are available.   More information can be found on the Get into Teaching website also https://getintoteaching.education.gov.uk/funding-and-salary\\r\n\\r\n",
    "InterviewProcess": "When invited to an interview you will be asked to bring your ID and qualification certificates with you.  We interview at specific times throughout the year and it is likely other candidates will be in attendance on the same day as you.  We ask for all candidates to arrive at the same time of 8.30am.  After signing in you will meet with the Headteacher and have the opportunity to tour the school and find out more about our course and how it is delivered.  During the rest of the day you can expect:-\\r\n\\r\nClassroom based Activity \\r\nYou will spend the morning working in one of our classrooms.  You will be observed and assessed by the class teacher during this time. \\r\n\\r\nEnglish task \\r\nFollowing your time in the classroom you will be asked to complete a reflective task on your morning.  \\r\n\\r\nThe Formal Interview\\r\nThe interview is our principle method for deciding whether or not we think you would be suitable for the course.  \\r\n\\r\nThe interviews are held in the afternoon and will be carried out by at least 2 senior leadership team members, it is expected that the interview will last no longer than 30 minutes.\\r\n\\r\nWhat Happens after Interview? \\r\nFollowing your interview, we will make a decision as to whether we can offer you a place on the course as soon as possible. All offers are conditional on your achievement of specified entry requirements, such as academic grades, satisfactory DBS check and Medical Clearance.\\r\n",
    "OtherRequirements": "We value candidates that can demonstrate volunteering or employment in school and a real commitment to teaching.\\r\n\\r\nLongford Park School is committed to safeguarding and promoting the Welfare of Children and Young People.  The successful candidate will be subject to an Enhanced Disclosure and Barring Service check.\\r\n\\r\nAll offers made are subject to medical clearance undertaken by the university.\\r\n\\r\nWe expect all adults to share our commitment to safeguarding and the health and wellbeing of our students.\\r\n\\r\n",
    "PersonalQualities": "To have empathic understanding of SEN needs.  Individuals will have a caring and nurturing nature.\\r\n\\r\nYou may have an interest or qualification in therapeutic / counselling methods.\\r\n\\r\nYou must have an understanding of pupil behaviours and have experience of strategies used to manage behaviour within the classroom.",
    "HowSchoolPlacementsWork": "We have formed great relationships with many Trafford Schools due to our Outreach Service supporting between 20-40 primary schools each year.  Our service gives professional advice and guidance surrounding managing pupil behaviour and many of these schools are happy to support us in return and fully participate in the School Direct Programme with us.  We therefore are able to place our trainees at primary schools within Trafford that can specifically meet their needs or if they would like to acquire a special skill set we have plenty of options.  You will have plenty of opportunity to discuss with your mentor and agree the best placement for you.\\r\n\\r\nUsually the course starts with your home placement here at Longford Park School Sept – Dec.  In January you will be placed at a mainstream school for 6/7 weeks and after this usually in March you will be placed within another special school or special unit setting for a 3 to 4 week block.  Various training days and university days are scheduled throughout the year.  All placements are within Primary Schools.  You will gain experience of KS1 and KS2 throughout the course.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Longford Park School is a school for pupils with complex needs.  In addition to full time provision for pupils with a statement of SEN we also provide for pupils who are at risk of exclusion from their mainstream schools, through outreach support. \\r\n\\r\n2019/2020 will be our 5th year of School Direct Teaching Training Provision in alliance with Palmerston.  We have experienced great success with our programme with all trainees so far successfully completing the course and securing teaching employment.\\r\n\\r\nWe are the lead school within Trafford for this Primary School Direct Programme and our specialism within SEN is Pupils with Complex Needs.\\r\nFor information on Longford Park School please visit - \\r\n\\r\nwww.longford.trafford.sch.uk\\r\n\\r\nContact us\\r\nLongford Park School\\r\n74 Cromwell Road\\r\nStretford\\r\nManchester\\r\nM32 8QJ\\r\ntel: \\t0161 912 1895\\r\nemail: \\tadmin@longford.trafford.gov.uk \\r\n",
    "TrainWithDisability": "Longford Park School promotes the individuality of all our trainees, irrespective of any disability.  We are committed to the Equality Act 2010 including the understanding of disabilities and offer an environment whereby individuals can be supported.\\r\n\\r\nAll disabled applicants who meet the essential criteria of the course programme will be invited to interview.  \\r\n\\r\nLongford Park School and all our placement schools have full disability access.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "L51"
      }
    ]
  },
  "has_inst": true
}
