{
  "locationType": "School",
  "accrediting": "University of Sussex",
  "provider": "Eastbourne Area School Direct Alliance",
  "subjects": [
    "Computing",
    "Secondary"
  ],
  "name": "Computer Science",
  "slug": "1J5/34ZL",
  "providerCode": "1J5",
  "programmeCode": "34ZL",
  "schools": [
    {
      "name": "SABDEN Multi Academy Trust",
      "address": "Head Office, Eastbourne Road, Seaford, BN25 4BA",
      "code": "6"
    }
  ],
  "addresses": [
    {
      "address": "Head Office, Eastbourne Road, Seaford, BN25 4BA",
      "geocode": true,
      "formatted_address": "Eastbourne Rd, Seaford BN25 4QT, UK",
      "latitude": 50.7738546,
      "longitude": 0.1276043,
      "post_code": "BN25 4QT",
      "city": "East Sussex",
      "route": "Eastbourne Road",
      "postal_town": "Seaford"
    }
  ],
  "providerAddress": {
    "inst_code": "1J5",
    "addr_1": "Broad Road",
    "addr_2": "Lower Willingdon",
    "addr_3": null,
    "addr_4": "Eastbourne",
    "postcode": "BN20 9QX",
    "url": "http://www.willingdonschool.org.uk",
    "geocode": true,
    "formatted_address": "Broad Rd, Eastbourne BN20 9QS, UK",
    "latitude": 50.8114363,
    "longitude": 0.2418378,
    "post_code": "BN20 9QS",
    "city": "East Sussex",
    "route": "Broad Road",
    "postal_town": "Eastbourne"
  },
  "options": [
    "PGCE with QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "This course is run at Seaford Head School and trains candidates in KS3 & 4.\\r\nCandidates will be on a 50% timetable with 4 days in school and 1 day at Sussex University.\\r\nCandidates will be regularly watched by their mentor to ensure that they are succeeding on the course.\\r\nThere will be a second, contrasting placement at a school which is mutually agreed.",
    "CourseLength": "September to June",
    "SalaryDetails": "You are paid at the lowest scale of a non-qualified teacher c. £14000\\r\nThere are no fees for this course",
    "Qualifications": "Candidates must have 5 or more GCSEs  in Grades A* to C (or equivalent), including Mathematics and English, and preferably a higher level honours degree.",
    "InterviewProcess": "Candidates will be required to teach a small group of students for approximately 20 minutes, to judge their aptitude to teach. This will be followed by a formal interview.",
    "OtherRequirements": "Successful completion of Skills tests\\r\nSatisfactorily pass DBS and Health checks",
    "PersonalQualities": "\\r\n* Ambition and passion to become an outstanding practitioner\\r\n* A forward thinking and creative approach to teaching and learning\\r\n* Reflective and flexible in approach to teaching and learning\\r\n* Belief that every child can achieve excellence      \\r\n\\r\n\\r\n",
    "HowSchoolPlacementsWork": "The age range of students is 11 to 16 years\\r\nThere will be an opportunity to gain experience of KS5\\r\nThe candidate will have a total of two placements\\r\nThe second placement is approx 6 weeks"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Eastbourne Area School Direct Alliance recruits ITT students for most of the schools in Eastbourne and the surrounding areas. We offer Primary places for Key Stage 1 and 2. We also offer Secondary places for most subjects in a variety of high achieving schools. As part of your training you will get experience of KS3, 4 and 5. In addition we represent Special Needs schools who require Primary and Secondary teachers. All the schools in the consortium are experienced at training teachers and we have been very successful in aiding our School Direct candidates to obtain jobs when they have completed their training.",
    "TrainWithDisability": "All of our sites meet the requirements for disabled access and we would work with any candidate to ensure they can succeed in their training without any impediment.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "B72"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "S90"
      }
    ]
  },
  "has_inst": true
}
