{
  "locationType": "School",
  "accrediting": "University of Bedfordshire",
  "provider": "MCA Partnership",
  "subjects": [
    "Design and technology",
    "Secondary"
  ],
  "name": "Design and Technology",
  "slug": "2CZ/2ZHD",
  "providerCode": "2CZ",
  "programmeCode": "2ZHD",
  "schools": [
    {
      "name": "Main Site",
      "address": "Bury Road, Mildenhall, Bury St Edmunds, IP28 7HT",
      "code": "-"
    },
    {
      "name": "Westbourne Academy",
      "address": "Marlow Road, Ipswich, Suffolk, IP1 5JN",
      "code": "W"
    }
  ],
  "addresses": [
    {
      "address": "Bury Road, Mildenhall, Bury St Edmunds, IP28 7HT",
      "geocode": true,
      "formatted_address": "Bury Rd, Mildenhall, Bury Saint Edmunds IP28 7HT, UK",
      "latitude": 52.3435089,
      "longitude": 0.5258208,
      "post_code": "IP28 7HT",
      "city": "Mildenhall",
      "route": "Bury Road",
      "postal_town": "Bury Saint Edmunds"
    },
    {
      "address": "Marlow Road, Ipswich, Suffolk, IP1 5JN",
      "geocode": true,
      "formatted_address": "Marlow Rd, Ipswich IP1 5JL, UK",
      "latitude": 52.0739404,
      "longitude": 1.1202058,
      "post_code": "IP1 5JL",
      "city": "Suffolk",
      "route": "Marlow Road",
      "postal_town": "Ipswich"
    }
  ],
  "providerAddress": {
    "inst_code": "2CZ",
    "addr_1": "Bury Road",
    "addr_2": "Mildenhall",
    "addr_3": null,
    "addr_4": "Bury St Edmunds",
    "postcode": "IP28 7HT",
    "url": "http://www.mildenhall.attrust.org.uk",
    "geocode": true,
    "formatted_address": "Bury Rd, Barrow, Bury Saint Edmunds IP29 5DE, UK",
    "latitude": 52.2442366,
    "longitude": 0.593399,
    "post_code": "IP29 5DE",
    "city": "Barrow",
    "route": "Bury Road",
    "postal_town": "Bury Saint Edmunds"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This course involves spending 4 days a week in a placement school and one day a week at the University of Bedfordshire. Over the course of the training year you would gain experience in 2 placement schools.  Full information regarding the academic study element and essay requirements can be found on the Initial Teacher Training section of the university website.",
    "InterviewProcess": "Interviews take place initially at the university where candidates will find out further information about the course, undertake a literacy assessment and be interviewed by members of the partnership. In addition candidates will visit the lead school, Mildenhall College Academy, to meet key staff.",
    "HowSchoolPlacementsWork": "Placements will be allocated based on capacity but will also take into consideration the geographical location of trainees. Trainees will get the opportunity to teach from 11-18 at secondary and early years to year 6 at primary level.\\r\n\\r\nIn total there are 6 schools in our partnership but we also work with a number of other schools in the area to support initial teacher training.\\r\n\\r\nCandidates will have 2 placements, one for the Autumn term and one in a different school for the Spring/Summer terms."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are a training partnership based in Suffolk consisting of primary and secondary schools belonging to the Academy Transformation Trust. We also have sixth form provision in some of our schools.\\r\n\\r\nTraining with us will involve working with a wide range of staff many with extensive mentoring experience. We are fully committed to helping motivated and passionate trainees enter the teaching profession.",
    "TrainWithDisability": "We  have a strong commitment to equal opportunities and work closely with all trainees to ensure their individual needs are met.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "B22"
      }
    ]
  },
  "has_inst": true
}
