{
  "locationType": "School",
  "accrediting": "University of Worcester",
  "provider": "Shires Teaching School Alliance",
  "subjects": [
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages",
  "slug": "2EB/2ZQF",
  "providerCode": "2EB",
  "programmeCode": "2ZQF",
  "schools": [
    {
      "name": "Main Site",
      "address": "Crooks Lane, Studley, B80 7QX",
      "code": "-"
    },
    {
      "name": "King Edward VI School for Boys, Stratford",
      "address": "7A Church St,, Stratford-upon-Avon, Warwickshire, CV37 6HB",
      "code": "A"
    },
    {
      "name": "Alcester Academy",
      "address": "Gerard Rd, Alcester, Warwickshire, B49 6QQ",
      "code": "B"
    },
    {
      "name": "Henley in Arden School",
      "address": "Stratford Road, Henley-in-Arden, Warwickshire, B95 6AF",
      "code": "C"
    },
    {
      "name": "Shipston High School",
      "address": "Darlingscote Rd, Shipston-on-Stour, Warwickshire, CV36 4DY",
      "code": "D"
    },
    {
      "name": "Stratford upon Avon School",
      "address": "Alcester Road, Stratford-upon-Avon, Warwickshire, CV37 9DH",
      "code": "E"
    },
    {
      "name": "Stratford Girls' Grammar School",
      "address": "Shottery Manor, Stratford-upon-Avon, Warwickshire, CV37 9HA",
      "code": "F"
    },
    {
      "name": "Alcester Grammar School",
      "address": "Birmingham Road, Alcester, Warwickshire, B49 5ED",
      "code": "G"
    }
  ],
  "addresses": [
    {
      "address": "Crooks Lane, Studley, B80 7QX",
      "geocode": true,
      "formatted_address": "Crooks Ln, Studley B80 7QX, UK",
      "latitude": 52.2698512,
      "longitude": -1.8997104,
      "post_code": "B80 7QX",
      "city": "Warwickshire",
      "route": "Crooks Lane",
      "postal_town": "Studley"
    },
    {
      "address": "7A Church St,, Stratford-upon-Avon, Warwickshire, CV37 6HB",
      "geocode": true,
      "formatted_address": "7A Church St, Stratford-upon-Avon CV37 6HB, UK",
      "latitude": 52.189888,
      "longitude": -1.7090829,
      "post_code": "CV37 6HB",
      "city": "Warwickshire",
      "route": "Church Street",
      "postal_town": "Stratford-upon-Avon"
    },
    {
      "address": "Gerard Rd, Alcester, Warwickshire, B49 6QQ",
      "geocode": true,
      "formatted_address": "Gerard Rd, Alcester B49 6QQ, UK",
      "latitude": 52.2202285,
      "longitude": -1.8561448,
      "post_code": "B49 6QQ",
      "city": "Warwickshire",
      "route": "Gerard Road",
      "postal_town": "Alcester"
    },
    {
      "address": "Stratford Road, Henley-in-Arden, Warwickshire, B95 6AF",
      "geocode": true,
      "formatted_address": "Stratford Rd, Henley-in-Arden B95 6BE, UK",
      "latitude": 52.2760744,
      "longitude": -1.7818123,
      "post_code": "B95 6BE",
      "city": "Warwickshire",
      "route": "Stratford Road",
      "postal_town": "Henley-in-Arden"
    },
    {
      "address": "Darlingscote Rd, Shipston-on-Stour, Warwickshire, CV36 4DY",
      "geocode": true,
      "formatted_address": "Darlingscote Rd, Shipston-on-Stour CV36 4DY, UK",
      "latitude": 52.0665936,
      "longitude": -1.6322711,
      "post_code": "CV36 4DY",
      "city": "Warwickshire",
      "route": "Darlingscote Road",
      "postal_town": "Shipston-on-Stour"
    },
    {
      "address": "Alcester Road, Stratford-upon-Avon, Warwickshire, CV37 9DH",
      "geocode": true,
      "formatted_address": "Alcester Rd, Stratford-upon-Avon CV37 9JG, UK",
      "latitude": 52.19434769999999,
      "longitude": -1.7201811,
      "post_code": "CV37 9JG",
      "city": "Warwickshire",
      "route": "Alcester Road",
      "postal_town": "Stratford-upon-Avon"
    },
    {
      "address": "Shottery Manor, Stratford-upon-Avon, Warwickshire, CV37 9HA",
      "geocode": true,
      "formatted_address": "Shottery Manor, Shottery Village, Stratford-upon-Avon CV37 9HA, UK",
      "latitude": 52.1901546,
      "longitude": -1.7256517,
      "post_code": "CV37 9HA",
      "city": "Shottery Village",
      "route": null,
      "postal_town": "Stratford-upon-Avon"
    },
    {
      "address": "Birmingham Road, Alcester, Warwickshire, B49 5ED",
      "geocode": true,
      "formatted_address": "Birmingham Rd, Alcester B49 5ED, UK",
      "latitude": 52.2179458,
      "longitude": -1.875529,
      "post_code": "B49 5ED",
      "city": "Warwickshire",
      "route": "Birmingham Road",
      "postal_town": "Alcester"
    }
  ],
  "providerAddress": {
    "inst_code": "2EB",
    "addr_1": "Crooks Lane",
    "addr_2": null,
    "addr_3": "Studley",
    "addr_4": "Warwickshire",
    "postcode": "B80 7QX ",
    "url": "http:///www.studleyhighschool.org.uk",
    "geocode": true,
    "formatted_address": "Crooks Ln, Studley B80 7QX, UK",
    "latitude": 52.2690734,
    "longitude": -1.9000075,
    "post_code": "B80 7QX",
    "city": "Warwickshire",
    "route": "Crooks Lane",
    "postal_town": "Studley"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "For further information, please refer to the [University of Worcester fee section](https://www.worcester.ac.uk/courses/pgce-school-direct-secondary.html#section-6)\\r\n",
    "AboutCourse": "The School Direct Programme followed at the Shires Teaching School Alliance is aimed at those who want training to be based in a school where they can be fully immersed in the life of a teacher from day one. You will be part of a team from the very start, receiving support from experienced teachers and mentors. \\r\n\\r\nYou will also spend extended time in at least one other contrasting school. These placements will be complemented with experience days in other school settings, across at least two key stages, in order to gain the broad experience and knowledge required to become a qualified teacher. \\r\n\\r\nOur Professional Studies programme includes sessions taught by outstanding practitioners from across the alliance. From ‘managing well-being’ to ‘making marking matter’, you will experience training sessions that equip you to be a highly effective practitioner. \\r\n\\r\nWe work directly with the University of Worcester to deliver this course, which leads to a postgraduate certificate in education (PGCE) and qualified teacher status (QTS). \\r\n\\r\nYou will be assessed on the basis of coursework including 3 written assignments, a portfolio and an oral presentation of a small research project, as well as on your teaching practice. To gain qualified teacher status (QTS) you must demonstrate that you can meet the Teachers’ Standards. The standards set a clear baseline of expectations for the professional practice and conduct of teachers, from the point of qualification - further details can be found at [here](http://www.education.gov.uk/schools/teachingandlearning/reviewofstandards)\\r\n\\r\nTrainees are required to monitor and direct their own progress, with the support of mentors and tutors. The teaching experience assessment is based on a portfolio which allows reflection in order to set targets to improve teaching and learning in your classroom. Trainee teachers play a substantial role in reviewing progress and setting action plans.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You need to meet the statutory requirements for entry into teaching. These are a good honours degree (usually 2:2 or above) in a related subject area and GCSE Mathematics and English. Where candidates have significant experience in a related subject area and a degree in another discipline they may be eligible to apply and should contact the University for advice. All applicants for teacher training courses need to take the numeracy and literacy professional skills tests as part of the application process. You will need to ensure you have passed them both before the start of the course.\\r\n",
    "FinancialSupport": "For further information, please refer to the [University of Worcester fee section](https://www.worcester.ac.uk/courses/pgce-school-direct-secondary.html#section-6)\\r\n",
    "InterviewProcess": "We interview all shortlisted candidates prior to making an offer to train with us. If you are invited to interview you will be expected to be familiar with key issues and developments in secondary schools - especially those in your subject area. Your interview will take place within our alliance schools and will consist of small group or class teaching, subject-specific task and presentation and a pupil panel.  An interview will also take place at the University of Worcester to audit your subject knowledge. As part of the subject specific criteria, you will be asked to complete a written task. All teachers need to be able to write English clearly without errors of spelling, grammar or punctuation because it is part of their job to teach pupils to do this.\\r\n",
    "OtherRequirements": "UCAS require two references, of which one will be an academic reference. For applicants who finished their studies more than five years ago, we realise that this may not be the most appropriate. In such cases, employers or teachers from the school(s) you visited whilst gaining your school experience can be used to provide a reference; they would be able to comment on your suitability for the teaching profession. For more information, please refer to the [UCAS website](https://www.ucas.com/teaching-in-the-uk) \\r\n",
    "PersonalQualities": "Our alliance schools and the University of Worcester look for an interest in, and commitment to, education and young people. You will need to be enthusiastic about working with children, and possess an ability to relate to them. \\r\n\\r\nOral and written communication skills are very important to a teacher's role and your skills can grow and develop through teaching and your school experience. \\r\n\\r\nTeaching is physically and mentally demanding. You will need to demonstrate that you have the health and perseverance required to successfully complete the programme and continue a successful teaching career.\\r\n",
    "HowSchoolPlacementsWork": "As this is a school led programme, the majority of training takes place in schools.  There are three extended placements teaching in at least two different schools and two key stages.  You will be in your main placement school in terms one and three, with a complimentary school setting making up term two. Our programme includes a Post-16 element.\\r\n\\r\nThere are also many opportunities to gain additional experience in partner schools and settings. This can range from support on school trips to involvement in extra-curricular activities.\\r\n\\r\nPlease note that whilst we offer a range of locations in which to train and your preferences will be noted, you are not guaranteed a place at your preferred school. We endeavour to ensure that your needs are considered very carefully when deciding where your teacher training should take place, within our alliance of partner schools.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Shires Teaching School Alliance is a collaboration of schools across South Warwickshire in partnership with the University of Worcester. We offer the opportunity to train to teach through a one year postgraduate programme in a culture of excellence, with nurture, support, mentoring and respect at its heart. \\r\n\\r\nWe aim to ensure that you are challenged to be the best teacher you can be. We offer enrichment opportunities across our alliance schools from leadership pathways to half-day experiences in age groups and subjects outside of your specialism. \\r\n\\r\nThis programme and the people you will encounter, will guide you through your first steps into the rest of your teaching career. The Shires Alliance comprises multiple schools and academies who have the experience, capacity and passion to deliver outstanding teacher training to the next generation of teachers.\\r\n\\r\nThere is no escaping that your training will bring challenges as well as successes. We believe that to be highly effective teacher, you need to receive the tools, support and motivation right from the start. We focus on full immersion into school life, putting theory into practice.  \\r\n\\r\nTrain with us and you can expect the highest levels of experience from educators who are passionate about their profession. Our aim is simple: we want to nurture acorns into oaks and your needs are at the heart of our training programme. \\r\n\\r\nPlease visit our website [Shires TSA](https://shirestsa.co.uk) \\r\n\\r\n",
    "TrainWithDisability": "We want to support you and where possible make reasonable adjustments to help you overcome physical and mental health barriers whilst you are training and in your school placements. If you have study support needs related to a physical or health condition; dyslexia and other specific learning difficulties; mental health difficulties; autism or Asperger’s Syndrome we are here to help you. If you have complex support requirements, particularly mobility, care or transition support, we would welcome you contacting us to discuss how we can support your teacher training year.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "At Worcester you will benefit from state of the art facilities to support your research, subject knowledge and communication skills - enabling you to deliver teaching with impact.\\r\n\\r\nKey features when studying include:\\r\n\\r\n* Course elements exploring wider issues of education and society enhance your prospects as a future leader in the profession.\\r\n\\r\n* Choice of additional specialisms help enhance your expertise and career prospects, from citizenship, English as an additional language, special educational needs and disability, technology enhanced learning.\\r\n\\r\n* 60 credits at postgraduate level. \\r\n\\r\n",
        "UcasInstitutionCode": "W80"
      }
    ]
  },
  "has_inst": true
}
