{
  "locationType": "School",
  "accrediting": "King's College London (University of London",
  "provider": "Beal High School",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "slug": "1NA/24BD",
  "providerCode": "1NA",
  "programmeCode": "24BD",
  "schools": [
    {
      "name": "Main Site",
      "address": "Beal High School, Woodford Bridge Road, Ilford, Essex, IG4 5LP",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Beal High School, Woodford Bridge Road, Ilford, Essex, IG4 5LP",
      "geocode": true,
      "formatted_address": "Essex, UK",
      "latitude": 51.7343313,
      "longitude": 0.4690888,
      "post_code": null,
      "city": "Essex",
      "route": null
    }
  ],
  "providerAddress": {
    "inst_code": "1NA",
    "addr_1": "Beal High School",
    "addr_2": "Woodford Bridge Road",
    "addr_3": null,
    "addr_4": "Ilford",
    "postcode": "IG4 5LP ",
    "url": "http://nelta.co.uk",
    "geocode": true,
    "formatted_address": "Woodford Bridge Road, London IG4 5LP, UK",
    "latitude": 51.586046,
    "longitude": 0.051729,
    "post_code": "IG4 5LP",
    "city": "Greater London",
    "route": "Woodford Bridge Road",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2018 student survey, 92% of trainees rated the quality of their training as very good or good. \\r\n\\r\nThe PGCE Mathematics is a full-time course that consists of four required modules and two blocks of teaching experience based in secondary schools within London and Greater London. You will complete the course within ten months, studying September to June. You must take modules totalling 120 credits to meet the requirements of the qualification. Two assessed pieces of coursework give you 60 Master’s-level credits – a third of an MA – which puts you well on the way to a Master’s degree in your chosen profession\\r\n\\r\nThe principle of the mathematics course at King’s is a view of teaching based on the process of planning ‐ teaching ‐ reflection. The process looks at relevant research, the principles of the mathematical topic which is being taught and links with other areas of the mathematical curriculum. In general mathematics sessions are workshops where we consider how to build upon pupils’ prior knowledge and address any misconceptions they might have. A sequence of lessons can then be planned to enable successful learning and teaching. Suitable responses from pupils are identified to assess their progress and understanding, and the effectiveness of the teaching approach used.\\r\n\\r\nAdditional areas covered in the mathematics programme include:\\r\n\\r\n-Growth mindset\\r\n-Motivation and engagement\\r\n-Mathematical modelling\\r\n-Problem solving\\r\n-Reasoning and proof\\r\n-Assessment methods\\r\n-Resources beyond textbook\\r\n-Government initiatives\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Ideally you will have a good degree in mathematics. However, there is a significant difference between school mathematics and the wide variety of topics which are studied in mathematics degrees. Therefore degrees with a significant mathematical element are also acceptable (for example, physics, engineering, chemistry, economics). \\r\n\\r\nAll applicants must possess a grade C/ grade 4 in GCSE English and Maths (or equivalent).\\r\n",
    "FeeInternational": 19320.0,
    "InterviewProcess": "Before a place is offered all applicants will be invited for an interview. The interview is looking to see whether you have a reasonable understanding of mathematics for teaching pupils aged 11‐18 years, to see if you can communicate with an audience, to see that you have prepared yourself for taking a career move towards teaching and to look at your commitment to teaching. You will complete a written task and a mathematics task and an individual interview. The individual interview will explore your views about teaching in general and more specifically teaching some aspects of the secondary mathematics curriculum. \\r\nDuring the individual interview and the mathematics task, we will be looking for:\\r\n-An ability to explain concepts at a school level\\r\n-How you engage with the audience\\r\n-Understanding of the subject you wish to teach\\r\n-Confidence\\r\n\\r\nIn your written task we will be looking for:\\r\n-An ability to express yourself clearly\\r\n-A considered view of the profession you wish to enter\\r\n-Accurate grammar and spelling\\r\n",
    "OtherRequirements": "All applicants for teacher training programmes must pass the Department for Education’s Literacy and Numeracy Skills Tests prior to commencing their teacher training course.\\r\n\\r\nThe Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\\r\n",
    "PersonalQualities": "Personal qualities we look for include:\\r\n-Ability to engage interest and communicate your own enthusiasm for mathematics\\r\n-Commitment to working with young people\\r\n-Ability to explain ideas clearly and to think on your feet\\r\n-Evidence of good interpersonal skills\\r\n-Awareness of current educational issues\\r\n",
    "HowSchoolPlacementsWork": "You will have two different school placements during the course. Both placements will be at one of the lead school's (Beal High School) partner schools located in the London Borough of Redbridge.\\r\n\\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "North East London Teaching Alliance (NELTA) is a large teaching school alliance of 20 schools. Beal High School is the lead school.\\r\n\\r\nWe are passionate about developing the next generation of teachers and school leaders. Teachers and leaders who will ensure an outstanding educational future for all pupils irrespective of background or ability. \\r\n\\r\nWorking with our alliance you can expect:\\r\n* Guidance from an experienced school based mentor and provider tutor\\r\n* Very well established support programmes\\r\n* Access to a wide network of schools including community secondary, primary, independent, grammar and special education\\r\n* Professional development opportunities beyond your training year focused on outstanding teaching and leadership\\r\n\\r\nNELTA, which spans Barking and Dagenham, Waltham Forest, Redbridge, Newham and beyond, we offer opportunities to work in a range of different socio-economic areas. Working in a partnership which includes independent schools, boys' and girls' grammar schools, faith schools, comprehensive schools and special schools means you will have access to a broad range of training experiences which will give you the opportunity to you develop your practice in a variety of different settings.\\r\n\\r\nWe offer teacher training places for both the tuition fee and salaried routes to Qualified Teacher Status. \\r\nFor tuition fee routes routes we work with King’s College London, UCL and NELTA as our accredited providers.\\r\nFor our salaried route the accredited provider is NELTA (the operating name of teacher training provided by the Beacon Multi-Academy Trust)\\r\n",
    "TrainWithDisability": "We are committed to supporting equal opportunities and disability access.\\r\n\\r\nWe have accommodated trainees in the past with a range of disabilities including mental health conditions, dyslexia and physical impairments.\\r\n\\r\nDisability access in schools varies according to the specific training location. Please check with the relevant accredited provider or email us to discuss your needs [NELTA](admin@nelta.co.uk).\\r\n\\r\n\\r\nAt UCL School Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information here:-\\r\n[UCL Student Support](https://www.ucl.ac.uk/students/disability-support)\\r\n\\r\n\\r\nKing's offer information, advice and guidance to current and prospective disabled students about support that may help them to engage with their studies. When we refer to the term “disability” we also include long-term medical or mental health conditions and Specific Learning Difficulties (SpLDs).  \\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "UCL Institute of Education is the world’s leading centre for research and teaching in education and related social sciences. You can view UCL’s online teacher training prospectus is here:-\\r\n[Online teacher training prospectus](https://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes)\\r\n\\r\n\\r\n \\r\n",
        "UcasInstitutionCode": "U80"
      },
      {
        "Description": "We are committed to working in partnership with trainees and partner schools to provide highly trained teachers for the local community and beyond.\\r\n\\r\nWeekly contact with other trainees and our programme tutors means that you will always feel fully supported.\\r\n\\r\nThe Ofsted inspection of our initial teacher training provision on 2017 said:\\r\n“Leaders’ ambitious vision for excellence and their aspirations for trainees are of the highest order”\\r\n“The quality of training is outstanding”\\r\n“Trainees are overwhelmingly positive about the quality of mentoring”",
        "UcasInstitutionCode": "251"
      },
      {
        "Description": "Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2018 student survey, 92% of trainees rated the quality of their training as very good or good. ",
        "UcasInstitutionCode": "K60"
      }
    ]
  },
  "has_inst": true
}
