{
  "locationType": "School",
  "accrediting": "Middlesex University",
  "provider": "Bowes Primary School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "189/22FV",
  "providerCode": "189",
  "programmeCode": "22FV",
  "schools": [
    {
      "name": "Bowes Primary School",
      "address": "Bowes Road, London, N11 2HL",
      "code": "B"
    }
  ],
  "addresses": [
    {
      "address": "Bowes Road, London, N11 2HL",
      "geocode": true,
      "formatted_address": "Bowes Rd, London N11 2HL, UK",
      "latitude": 51.6141748,
      "longitude": -0.1254357,
      "post_code": "N11 2HL",
      "city": "Greater London",
      "route": "Bowes Road",
      "postal_town": "London"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "School Direct is a school-led teacher training route where the majority of your time will be spent in your training school. The content and the focus of the training programme will be targeted to meet your individual needs. You will also have the benefit of receiving training from Middlesex University and making use of their extensive resources, including the library and student support services. \\r\n\\r\nOur School Direct programme also provides you with the opportunity to gain a postgraduate qualification (PGCert Teaching), which can be used towards a Masters award in the future. This will enable you to develop your skills for teaching and for understanding the interrelationship between learning and teaching, as you develop into a critically reflective practitioner. ",
    "CourseLength": "OneYear",
    "SalaryDetails": "All of our School Direct (salaried) trainees are paid on the Unqualified Teacher Pay Scale (Outer London) at a minimum of Point 1. \\r\n\\r\nThere are no fees to be paid by the candidate. \\r\n\\r\nThe PGCert element of the programme does not involve a cost to the candidate. ",
    "Qualifications": "You should be a graduate with the following qualifications: \\r\n\\r\n* A bachelor degree (2:2 or higher)\\r\n* GCSE grade C/grade 4, or equivalent, in English, Mathematics and Science. \\r\n* We also accept equivalency tests by Equivalency Testing and A Star Teachers. ",
    "InterviewProcess": "Bowes Primary School, as the Lead school in the partnership, will coordinate the selection and recruitment process. If shortlisted for interview, candidates will spend a full day in school participating in the following: \\r\n\\r\n* A 20 minute observed session with a small group of children \\r\n* A written task\\r\n* Presentation\\r\n* Group discussion\\r\n* A formal individual interview\\r\n\\r\nMembers of the partnership and Middlesex University will be involved throughout the day and will have an equal say in the selection. It is a rigorous and thorough process to ensure applicants are matched to the employing school.  ",
    "PersonalQualities": "We are looking for creative, enthusiastic and hard working trainee teachers who can bring learning to life for our children. Every day in school is different so you will need to be flexible and adaptable. We would like you to have had some experience of working with young people of primary age, but this does not need to be paid work. It could be helping with a sports team, drama group, youth group or voluntary work in schools. We welcome career changers and the skills that can be transferred between professions. ",
    "HowSchoolPlacementsWork": "The schools within our partnership are all located within the London Borough of Enfield. When identifying schools for each candidate we consider home locations and travel options. All of our schools have good public transport links. \\r\nThe teaching age ranges that we can offer are within the primary phase (3 -11). \\r\nOur current partnership includes approx. 10 Enfield primary schools. \\r\nThe majority of your training year will be spent in your employing school, however there is a second setting placement in one of our partnership schools for half a term (6 weeks). \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Bowes Primary School is a Lead School for School Direct (Salaried) and Postgraduate Teaching Apprenticeship placements. We have a number of partnership schools working with us to deliver fantastic teacher training. We work in partnership with Middlesex University to grow our next round of future teachers and leaders. \\r\n\\r\nBowes Primary School has worked with trainee teachers for over 15 years, with a large number of our previous Graduate Teachers and School Direct trainees now employed in middle and senior leadership roles. We currently have 14 trainees (2018-19) out in ten local partnership schools. \\r\n\\r\nWe are a designated Teaching School under the Enfield Teaching School Alliance (ETSA Bowes), a joint venture by both primary and secondary schools in Enfield. We work very closely on Initial Teacher Training and are able to provide cross phase opportunities. \\r\n\\r\nThe partnership schools in our alliance offer a range of experiences, working alongside happy and friendly children, and hardworking and ambitious staff. All the partnership schools have experience of teacher training and are able to coach and mentor trainees through the programme, producing good and outstanding trainees who go on to complete their NQT year with confidence.  ",
    "TrainWithDisability": "Within our partnership of schools and alongside Middlesex University we aim to provide an inclusive environment which caters for all trainees. We have supported trainees with disabilities and other needs, including dyslexia and mental health conditions. \\r\n\\r\nAccessibility varies between locations, including some schools which are located over three floors with no lift access. However, this can be discussed   and appropriate locations identified. ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "[Middlesex University School Direct](https://www.mdx.ac.uk/courses/postgraduate/school-direct-qts)\\r\n\\r\n[Middlesex University Postgraduate Teacher Apprenticeship (with QTS)](https://www.mdx.ac.uk/courses/postgraduate/postgraduate-teacher-apprenticeship-qts) \\r\n\\r\n",
        "UcasInstitutionCode": "M80"
      }
    ]
  },
  "has_inst": true
}
