{
  "locationType": "School",
  "accrediting": "North Wiltshire SCITT",
  "provider": "Pickwick Learning",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "23Z/369B",
  "providerCode": "23Z",
  "programmeCode": "369B",
  "schools": [
    {
      "name": "Main Site",
      "address": "Pound Pill, Corsham, SN13 9YW",
      "code": "-"
    },
    {
      "name": "Sea Mills Primary School",
      "address": "Riverleaze, Bristol, BS9 2HL",
      "code": "S"
    }
  ],
  "addresses": [
    {
      "address": "Pound Pill, Corsham, SN13 9YW",
      "geocode": true,
      "formatted_address": "Pound Pill, Corsham SN13 9HX, UK",
      "latitude": 51.427893,
      "longitude": -2.1833128,
      "post_code": "SN13 9HX",
      "city": "Wiltshire",
      "route": "Pound Pill",
      "postal_town": "Corsham"
    },
    {
      "address": "Riverleaze, Bristol, BS9 2HL",
      "geocode": true,
      "formatted_address": "Riverleaze, Bristol BS9 2HN, UK",
      "latitude": 51.4847208,
      "longitude": -2.6497532,
      "post_code": "BS9 2HN",
      "city": "City of Bristol",
      "route": "Riverleaze",
      "postal_town": "Bristol"
    }
  ],
  "providerAddress": {
    "inst_code": "23Z",
    "addr_1": "Pound Pill",
    "addr_2": null,
    "addr_3": "Corsham",
    "addr_4": null,
    "postcode": "SN13 9YW",
    "url": "http://www.corshamprimary.co.uk",
    "geocode": true,
    "formatted_address": "Pound Pill, Corsham SN13 9HX, UK",
    "latitude": 51.4284508,
    "longitude": -2.1835161,
    "post_code": "SN13 9HX",
    "city": "Wiltshire",
    "route": "Pound Pill",
    "postal_town": "Corsham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "Our vision is to develop and prepare the teachers of tomorrow with the skills and knowledge they need to deliver creative and challenging teaching and learning in the setting that they will be working in.  \\r\n\\r\nOur inspirational programme is delivered by expert teachers and enhanced by attending central training with Pickwick Learning, NWSCITT and sessions led by Bath Spa University.  These aspects of the course bring together trainees from across the primary and secondary phases and from a range of schools, giving opportunities to network and reflect on different experiences. Examples of aspects covered in professional studies central training sessions include: How children learn, Managing Behaviour and assessment. Primary trainees also learn about the way that we teach specific subjects in the curriculum, with a particular focus on Maths, English, including phonics, but also ways that other subjects are taught in the classroom, such as PE and Art. These central training days are either held at NWSCITT’s centre at Royal Wootton Bassett or at Corsham Primary School.\\r\n\\r\nOn your Placement you will be immersed in teaching and learning, gradually building up your teaching as your confidence grows and your skills and experience develop.  You will be released to attend Pickwick and NWSCITT / Bath Spa training days.  During the Spring Term you will have a placement in a second setting in one of our partner schools. Trainees also have short alternative placements in a Special School as well as in a secondary School. There’s also an opportunity for a reciprocal placement to widen your experience, develop peer to peer support and learn to use coaching skills to support your professional development. \\r\n\\r\nDuring your placements, you will be supported by your mentor (who will usually be your class teacher).  You will begin your placement on the first day of the school year and as a member of staff in the school you work in, you will be expected to attend staff meetings and In Service Training (INSET) days as part of your development.  School mentors and class teachers are experienced, quality practitioners who are consistently good and outstanding teachers.  They will endeavour to support you in many different ways through coaching and mentoring, observations and feedback to ensure that you have the best possible preparation and training for embarking on your new career.  \\r\n\\r\nThere are 3 assignments during the year, supported by central training sessions led by Bath Spa University. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "•\\t2:2 Honours degree or above, achieved or predicted\\r\n(A subject knowledge course may be needed if the degree is in a subject not conducive to teacher training.)\\r\n\\r\n•\\tGCSE English Language C / 4 or above (achieved)\\r\n•\\tGCSE Maths C / 4 or above (achieved)\\r\n•\\tGCSE Science C / 4 or above (achieved)\\r\n\\r\n(Core GCSE equivalents listed by TRA, e.g. O levels or successful tests via [www.equivalencytesting.com](https://equivalencytesting.com (achieved))\\r\n\\r\n(Applicants will be asked to take equivalency tests for GCSEs prior to application where these are not already in place. These should be done via the organisation named above.)\\r\n",
    "FinancialSupport": "Please contact us if you have questions about accessing any financial support available to you.",
    "InterviewProcess": "Interviews are held at regular intervals throughout the year so that applications are processed efficiently.\\r\n\\r\nApplicants are required to attend one interview day where they will be asked to prepare a short teaching task, a presentation and take two short Primary test papers.",
    "OtherRequirements": "References:\\r\nTwo positive references supporting entry to a primary PGCE from a university tutor, employer or school-based contact\\r\n \\r\nExperience:\\r\nSome recent primary school experience with an understanding of how UK primary schools operate. Candidates may also have experience of planning and delivering teaching to individuals, small groups or a whole class.\\r\n\\r\nSafeguarding:\\r\nPLTSA is committed to safeguarding and promoting the welfare of children and young people and expects all trainees to share this commitment.   Some candidates may also have an understanding of up to date safeguarding procedures.\\r\n",
    "PersonalQualities": "We are looking for committed, enthusiastic candidates who can demonstrate a passion for working with young learners to enable them to be the very best they can be.  We will be looking for meaningful, relevant experience of working with children and some observation and experience of classroom practice. \\r\n\\r\nPlease see our [website](https://pltsa.co.uk/school-direct-itt) for further details ",
    "HowSchoolPlacementsWork": "Placement schools are selected from across our Teaching School Alliance which covers a wide geographical area. This means that we are able to ensure that trainees do not have unreasonable distances to travel to their placement school from their home.\\r\n\\r\nTrainees teach across Key Stage one and Key Stage Two over the course of their host placement (Terms 1,2,5,6) and complementary placement (Terms 3,4).\\r\n\\r\nPlease visit our website to explore all the schools in our alliance: [Please click here to find out more](https://pltsa.co.uk/alliance-partners)"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Pickwick Learning Teaching School Alliance (PLTSA) School Direct Partnership is committed to developing our trainees as effective learners and effective teachers.  \\r\n\\r\nWe provide a high quality and personalised programme for our trainee teachers who learn to teach ‘on the job’ in school from day one, observing and working alongside outstanding practitioners working within our large family of schools based across Bristol, South Gloucestershire, Bath and Wiltshire.  \\r\n\\r\nWe are very keen to support you as much as we can in finding a placement that best suits your needs and preferences.  Although we cannot guarantee that you will be placed in a school of your choice, we will do our utmost to meet your request.  Placements are in our partnership schools which offer Primary focussed training in a range of contexts.  Our partnership schools have achieved Good and Outstanding OFSTED ratings and, most importantly, are passionate about the importance of outstanding provision for our children as they progress through their school lives. \\r\n\\r\nTraining is delivered through personalised training with your own mentor and through central training sessions led by Specialist leaders of education, headteachers, deputy headteachers and classroom practitioners. Our staff are our most valuable resource with a proven track record for delivering high quality training and professional development. They are exemplary in their expectations and are eager to share their skills, knowledge and practice with the next generation of teachers. These practitioners are in the best position to prepare you for excellence in your own practice.\\r\n",
    "TrainWithDisability": "We are an inclusive organisation. All potential applicants are considered on an equal basis. \\r\n\\r\nWe will ensure that all candidates applying and securing a place to train with us will be provided, wherever possible, with the means to do so, by implementing reasonable adjustments as required which may include:\\r\n\\r\n•\\tEnsuring access to training venues and schools\\r\n•\\tProviding additional time where required e.g. for PGCE assignments\\r\n•\\tProviding larger print and/or coloured paper\\r\n•\\tAdditional support from School-based mentor / Teaching and Learning tutor\\r\n•\\tEnsuring all placement schools and venues are aware of any allergies and intolerances\\r\n•\\tEnsuring that candidates with hearing and/or sight impairments are seated appropriately to facilitate access to presentation content and instructions.\\r\n\\r\nPlease make us aware of any disabilities or other needs. We can assure you that all information will be treated in complete confidence.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We provide a well-run, school-based learning opportunity in partnership with North Wiltshire SCITT and Bath Spa University, both rated as Outstanding Providers for ITT by OFSTED.\\r\n  \\r\nWe have chosen to work with these organisations as they share our high expectations. Through this partnership we are able to share our expertise of training primary practitioners and make links cross-phase with our secondary colleagues, in addition to our existing links with the Early Years settings.\\r\n\\r\nWe know all our trainees well and can offer support where needed through the shared central team e.g. finance questions, DBS clearance checks and access to resources.\\r\n",
        "UcasInstitutionCode": "24U"
      }
    ]
  },
  "has_inst": true
}
