{
  "locationType": "School",
  "accrediting": null,
  "provider": "Titan Partnership Ltd",
  "subjects": [
    "English",
    "Secondary"
  ],
  "name": "English",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "T30/Q3X1",
  "providerCode": "T30",
  "programmeCode": "Q3X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "St George's Community Hub, Great Hampton Row, Birmingham, B19 3JG",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "St George's Community Hub, Great Hampton Row, Birmingham, B19 3JG",
      "geocode": true,
      "formatted_address": "Great Hampton Row, Birmingham B19 3JG, UK",
      "latitude": 52.4904307,
      "longitude": -1.9053447,
      "post_code": "B19 3JG",
      "city": "West Midlands",
      "route": "Great Hampton Row",
      "postal_town": "Birmingham"
    }
  ],
  "providerAddress": {
    "inst_code": "T30",
    "addr_1": "Titan Teacher Training",
    "addr_2": "75 Harborne Road",
    "addr_3": "Birmingham",
    "addr_4": "West Midlands",
    "postcode": "B19 3JG ",
    "url": "http://www.titanteachertraining.co.uk",
    "geocode": true,
    "formatted_address": "75 Harborne Rd, Birmingham B15 3DH, UK",
    "latitude": 52.4708263,
    "longitude": -1.9245948,
    "post_code": "B15 3DH",
    "city": "West Midlands",
    "route": "Harborne Road",
    "postal_town": "Birmingham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Course introduction\\r\nThe University of Portsmouth's PGCE Initial Teacher Training Secondary in English is a one-year, full-time course for graduates who wish to train as secondary school English teachers. It is run by the University's School of Education and Continuing Studies and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level) or the Postgraduate Certificate in Education (with 60 credits towards a Master's degree). \\r\n\\r\nEnglish is a core subject of the secondary curriculum at Key Stage 3 and 4. English is an engaging and constantly evolving subject in the school curriculum. On the PGCE course you will learn not only about issues related to English teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \\r\n\\r\nCourse aims\\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers' Standards. \\r\n\\r\nMode of study\\r\nThis is a one-year full-time course (36 weeks). \\r\n\\r\nCourse outline\\r\nThe English course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with mentors and other school staff. \\r\n\\r\nThroughout the year you will be engaged in considering a range of subjects including: \\r\n\\r\n*subject knowledge enhancement\\r\n*ICT in the classroom\\r\n*lesson planning\\r\n*classroom management\\r\n*special needs and inclusion\\r\n*assessment\\r\n*creative learning\\r\n\\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school's teaching staff. You will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom. ",
    "CourseLength": "OneYear",
    "Qualifications": "An honours degree in a relevant subject, with approximately 50% English content and a classification of at least 2:1.  GCSE Mathematics and English language at grade C (Grade 4) or above, or equivalent. ",
    "OtherRequirements": "All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. All applicants must pass the National College for Teaching and Leadership's professional skills tests in literacy and numeracy before starting the course.",
    "HowSchoolPlacementsWork": "School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Titan Teacher Training has successfully trained teachers for over 20 years. We work in partnership with Primary and Secondary schools across Birmingham's inner city to deliver outstanding and supportive school based Teacher Training.\\r\n\\r\nOur course offers Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE) with Master's credits.  The PGCE qualification is validated by Birmingham City University. To support your academic work you have access to the university's facilities and services.\\r\n\\r\nYou will have the chance to train in a variety of settings: comprehensive, selective and single sex. You will also be able to follow specialist training pathways in SEND, STEM and alternative provision.  \\r\n\\r\nTitan is a small but highly successful provider. Our size enables us to deliver personalised training in a very supportive environment.\\r\n\\r\nAs a trainee you will attend cross-phased taught sessions designed to complement your school placements as well as bespoke subject specific sessions.\\r\n\\r\n100% of our 2017/18 cohort secured employment. Many of our trainees choose to remain within our partnership schools and we offer a comprehensive programme to support you through your NQT year.\\r\n\\r\nAs a trainee you will also have access to events & activities from our wider partnership network of over 50 educational institutions across Birmingham\\r\n\\r\nWe look forward to supporting you into teaching! \\r\n\\r\nMore information can be found on our [website](https://www.titanteachertraining.co.uk/)",
    "TrainWithDisability": "Titan is an inclusive provider. We will support you during your training year and make any reasonable adjustments to ensure we meet your specific needs.\\r\n ",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
