{
  "locationType": "School",
  "accrediting": "The University of Gloucestershire",
  "provider": "Bristol Primary Teaching School Alliance: Ashley Down Primary/Whitehall Primary",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "1PL/25QW",
  "providerCode": "1PL",
  "programmeCode": "25QW",
  "schools": [
    {
      "name": "Whitehall Primary School",
      "address": "Johnson's Road, Easton, Bristol, England, BS5 9AT",
      "code": "1"
    }
  ],
  "addresses": [
    {
      "address": "Johnson's Road, Easton, Bristol, England, BS5 9AT",
      "geocode": true,
      "formatted_address": "Johnsons Rd, Bristol BS5 9AT, UK",
      "latitude": 51.4641558,
      "longitude": -2.5558829,
      "post_code": "BS5 9AT",
      "city": "City of Bristol",
      "route": "Johnsons Road",
      "postal_town": "Bristol"
    }
  ],
  "providerAddress": {
    "inst_code": "1PL",
    "addr_1": "Whitehall Primary School",
    "addr_2": "Johnson's Road",
    "addr_3": "Easton",
    "addr_4": "Bristol",
    "postcode": "BS7 9PD ",
    "url": "http://bptsa.org",
    "geocode": true,
    "formatted_address": "Johnson´s Lane, Whitehall, Bristol BS5 9AZ, UK",
    "latitude": 51.4649347,
    "longitude": -2.5552824,
    "post_code": "BS5 9AZ",
    "city": "Whitehall",
    "route": "Johnson´s Lane",
    "postal_town": "Bristol"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "School Direct (salaried) is an employment based-route into teaching. \\r\nPlaces for the salaried route are extremely competitive. This route is designed predominantly for those already with significant experience of working in primary schools, in roles such as a teaching assistant, higher level teaching assistant or as a cover teacher.  Those applying for this route are usually sponsored and employed by the school they are working in, as they may intend to step up their role and continue working there following training.  The school employs trainees as an unqualified teacher and pays their salary for the year, with some financial assistance from the teaching school.  Please note, there are only very limited places for applicants who are not already employed in a school and where the school has agreed to pay for your training year.\\r\n\\r\nA School Direct Salaried trainee works in a school full-time and is paid for the year of the training. The Alliance provides regular additional training days away from the classroom (at Whitehall Primary School) on a weekly basis, with opportunities to explore key aspects of teaching and learning and theory and subject knowledge with other trainees and led by the Alliance ITT Training Manager, Specialist Leaders of Education (outstanding teachers and school leaders from school across the city) and class teachers. Trainees will have opportunities to see teaching and learning in classrooms as well. This combination of training provides opportunities to reflect, discuss and share issues arising in the classroom and so enable the trainee to consider their progress against the Standards for Teachers. We work alongside the University of Gloucestershire who quality assure our programme, which is then validated by the Higher Education Institute (HEI).  You will be awarded Qualified Teacher Status (QTS) on successful completion of the programme.\\r\n\\r\nYou will work alongside an experienced class teacher for the year, with an increasing teaching commitment. You will be given two school placements in different Key Stages, one in your main placement school and for a term in a contrasting school.  You will have regular visits from the Alliance Training Manager to ensure that you are on track. Assessment is ongoing through weekly meetings with your class mentor, one written assignment and a final presentation, as well as assessment against the Teachers' Standards.",
    "CourseLength": "OneYear",
    "SalaryDetails": "You will be employed by your host school as a salaried Trainee Teacher on a temporary contract and as an unqualified teacher, scale 1 (around £16,500 p.a)\\r\n\\r\nThere are no additional costs to the trainee.",
    "Qualifications": "You will need:\\r\n\\r\n- A degree (2:2 or above)\\r\n- GCSEs grade C / grade 4 or above in Maths, English & Science (or equivalent)\\r\n- Successful attainment of the QTS Professional Skills Tests (Maths & English) (http://sta.education.gov.uk/)\\r\n- Significant experience of working in a school",
    "InterviewProcess": "If you are successful at the application stage and are subsequently invited to interview, the structure of the day consists of the following:\\r\n\\r\n- A welcome and introduction to the day\\r\n- A 10 minute activity working with children (details of this will accompany an invitation to interview email)\\r\n- A 5 minute presentation  (details of this will accompany an invitation to interview email)\\r\n- An interview which will last no longer than 30 minutes\\r\n- A Maths & English 'quiz' (to be undertaken individually - this is not the professional skills test)\\r\n\\r\nThe interview panel for the day usually consists of members of the Bristol Primary Teaching School Alliance and Partnership head teachers.\\r\n\\r\n",
    "OtherRequirements": "The salaried route is aimed at those individuals who have significant experience of working with children already, and are prepared for a school-based route into teaching.\\r\nAn enhanced criminal record (DBS) check is required to assess your suitability to work with children.",
    "PersonalQualities": "Desirable qualities include:\\r\n\\r\n- An understanding of teaching and learning within a school setting\\r\n- Excellent time management\\r\n- Organisational skills\\r\n- Emotional resilience\\r\n- A strong work ethic\\r\n\\r\n\\r\n",
    "HowSchoolPlacementsWork": "This is a primary teacher training programme, from 5 to 11. Trainees are placed in either Key Stage 1 or Key Stage 2 for their main placement, and must undertake a placement in the alternative key stage, in a contrasting setting, during their training year. This second placement is for a minimum of 6 weeks. During the year, there are opportunities to visit other schools and see a range of practice in different settings. \\r\n\\r\nTrainees will typically spend 4 days a week in school, and one day undertaking training at our training centre (Whitehall Primary School) or other schools within the BPTSA Partnership, that provide high-quality training in a range of subject areas. The programme is designed so that trainees are able to increase their teaching commitment as the year progresses, taking on greater by the summer term to fully prepare you for your first teaching post!"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We have a well-established track record in Initial Teacher Education as part of our overall staff development, leadership and succession planning work. The Executive Heads of all Teaching Alliance schools (Whitehall Primary – where our training centre is located -  Bridge Farm Primary & Ashley Down Schools Federation) are National Leaders of Education (NLEs) with a proven track record of delivering training to leaders, leadership teams, teachers, trainees and parents/carers which makes a lasting difference to ethos and practice. All Alliance schools are graded as outstanding by OFSTED.\\r\n\\r\nIn 2018-19 we are training 16 potential teachers through the PGCE route and last year trained 10 members of staff on the School Direct salaried route in schools across the city. We work hard to ensure that your training year works for you, and pride ourselves on working closely with every trainee, mentor and school.\\r\n\\r\nFor more information, please visit our website (https://bptsa.org/)\\r\n",
    "TrainWithDisability": "Disability Access\\r\n\\r\nAll schools and the university have disabled access. For information on any other needs, please contact a member of the BPTSA team through our main email address BPTSA@bristol-schools.uk",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Our excellent partnership with the University of Gloucestershire for the salaried route (graded 'Outstanding' by Ofsted for Primary ITE) means that trainee teachers will benefit from:\\r\n\\r\n- excellent relationships and communications between our facilitators\\r\n- the university's expertise in ITE to provide secure management and quality assurance\\r\n- extremely robust and well-managed recruitment & selection procedures\\r\n- flexible frameworks to suit different needs\\r\n",
        "UcasInstitutionCode": "G50"
      },
      {
        "Description": "We are delighted to strengthen our partnership working with the University of the West of England this academic year. Following successful recruitment, trainees will have the opportunity to work in two contrasting schools during the year, as well as having a blended approach to learning through both university-based seminars and tutorials and training centre professional development sessions. These take place at Whitehall Primary School, and draw upon expert practitioners to deliver this training.",
        "UcasInstitutionCode": "B80"
      }
    ]
  },
  "has_inst": true
}
