{
  "locationType": "School",
  "accrediting": "Tes Institute",
  "provider": "West Essex School Direct Partnership",
  "subjects": [
    "Religious education",
    "Secondary"
  ],
  "name": "Religious Education",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "1OS/34H7",
  "providerCode": "1OS",
  "programmeCode": "34H7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Chester Road, Loughton, IG10 2LD",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Chester Road, Loughton, IG10 2LD",
      "geocode": true,
      "formatted_address": "Loughton IG10 2LD, UK",
      "latitude": 51.66254420000001,
      "longitude": 0.0846995,
      "post_code": "IG10 2LD",
      "city": "Essex",
      "route": null,
      "postal_town": "Loughton"
    }
  ],
  "providerAddress": {
    "inst_code": "1OS",
    "addr_1": "West Essex SD Partnership",
    "addr_2": "Chester Road",
    "addr_3": "Loughton",
    "addr_4": "Essex",
    "postcode": "IG10 2LD",
    "url": "http://www.davenantschool.co.uk",
    "geocode": true,
    "formatted_address": "Chester Road, Loughton IG10 2LJ, UK",
    "latitude": 51.65884010000001,
    "longitude": 0.0807486,
    "post_code": "IG10 2LJ",
    "city": "Essex",
    "route": "Chester Road",
    "postal_town": "Loughton"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 8400.0,
    "AboutCourse": "If you would like to join a profession which will engage you in the most challenging and interesting way with the clear worth and the moral objective of educating the future of our locality, the West Essex School Direct Partnership will provide the very highest opportunity to be an outstanding teacher and the greatest likelihood of employment. \\r\n\\r\nThe Lead School, Davenant Foundation School in Loughton, Essex, is an Ofsted 'Outstanding' school whose children achieve exceptional results.\\r\n\\r\nThe West Essex School Direct Partnership has a long tradition of successful teacher training and we were centrally involved in the 'pilot' year 2012-13 when the Government launched the programme. We have a large cohort of trainees on the 2018-2019 secondary programme; in addition to this, we also have several trainees on the primary course. \\r\n\\r\nWe provide a very special, school based training experience in partnership with [TES Institute] (https://www.tes.com/) who have a reputation for innovative on-line learning materials, especially in shortage subjects, with its Subject Knowledge Enhancement courses.\\r\n\\r\nThere are 18 schools in Our Partnership, all judged to be 'Outstanding' or 'Good' by Ofsted. The Partnership has been in existence for over 6 years, which ensures that cooperation between the schools is established and is one of its strengths. \\r\n\\r\nSubject Knowledge Enhancement (SKE) is provided on-line as part of the course delivery. Several days are spent in a local primary school in order to experience KS2 teaching; in addition, there will be visits to a Special School (Special Educational Needs) and also to Heathcote School to experience teaching pupils for whom English is an additional language. \\r\n\\r\nEach trainee will record evidence to meet the teaching standards and all supporting reports and documentation via the TES Institute Learning Environment and will have access to their library to research the 3 assignments through this facility. \\r\n\\r\nFor successful applicants, there will be an induction day in July after which you will start at your own school on the first day of term (having spent some time visiting to get to know the staff, school and its routines).\\r\n\\r\nYou will be treated as a member of staff, attend staff meetings and all development training days. All of the Mentors have been trained in mentoring/coaching skills and will be effective classroom observers with feedback skills.  ",
    "CourseLength": "OneYear",
    "Qualifications": "Candidates must have passed English and Maths at GCSE at C/Grade 4 or above (or equivalent) and preferably have an A'level Grade B or better in the subject chosen for the teacher training programme.\\r\n Primary trainees require Grade 4/C in Science as well.\\r\n\\r\nYou should also be a graduate, with at least a 2:2 degree, although we're willing to consider applicants who can demonstrate a real aptitude for teaching and some previous experience working in a school setting. You should have a degree in which the majority of the content is in the subject in which you wish to train. ",
    "FinancialSupport": "Tuition fee loan/living cost loan is through the Student Loans Company.",
    "InterviewProcess": "The interview process will comprise of:\\r\n\\r\n* teaching a lesson for about 30-40 minutes\\r\n* an interview\\r\n* a written side of A4 to confirm spelling, punctuation and grammar capabilities\\r\n\\r\nThis will be conducted by a member of the teaching team with safer recruitment training.",
    "OtherRequirements": "Successful applicants will need to have passed a skills test in numeracy and literacy. Some school experience is desirable. For E-Bacc subjects, there is Subject Knowledge Enhancement, which may be a condition in the offer of a place.",
    "HowSchoolPlacementsWork": "You will be trained in schools which have finely developed systems in place to nurture development of the whole teacher and equip the trainee teacher with the 'tools of the trade'. \\r\n\\r\nEach successful trainee is placed in a school for the majority of the placement and the training will be provided by expert practitioners. A dedicated Professional Studies Programme takes place each week, mainly at either Ongar Academy or Davenant Foundation School in Essex, or at one of our other partner schools. In the Spring Term, there is a 6 week second placement in a contrasting school setting - usually within one of the partnership schools. Some of the schools in the partnership have an 11-18 intake and offer KS5 opportunities. All of the schools are fully comprehensive. Several schools have a discreet Christian ethos. \\r\n\\r\nOur Partnership Schools are: \\r\n\\r\n* Davenant Foundation School, Loughton (Lead School) \\r\n* Stewards Academy, Harlow \\r\n* West Hatch High School, Chigwell \\r\n* Passmores Academy, Harlow \\r\n* Roding Valley High School, Loughton \\r\n* St. Mark's West Essex Catholic School, Harlow \\r\n* Heathcote School & Science College, Chingford \\r\n* The Boswells School, Chelmsford \\r\n* Mark Hall Academy, Harlow \\r\n* The Ongar Academy, Ongar \\r\n* Great Baddow High School, Chelmsford \\r\n* Moulsham High School, Chelmsford \\r\n* Joyce Frankland Academy, Newport \\r\n* William De Ferrers School, South Woodham Ferrers \\r\n* The Sandon School, Chelmsford \\r\n* Chelmer Valley High School, Chelmsford \\r\n* Sir John Payne, Chelmsford \\r\n* Anglo European School, Ingatestone \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "At the West Essex School Direct Partnership, we believe that teaching is an exciting and rewarding profession. \\r\n\\r\nOur Partnership is based at and managed by the Lead School, Davenant Foundation School, in Loughton, Essex, and recruits for 18 secondary and 5 primary schools in the West Essex, Harlow and Chelmsford areas. All of our Partner schools are judged ‘Outstanding’ or ‘Good’ by Ofsted. Our unique blended learning programme combines school based training, on-line learning materials, a network of experienced subject specialists to deliver pedagogy, subject knowledge and off-site visits to special schools, primary schools and Leading Teacher days.  \\r\n\\r\nAll schools in our Partnership have a successful track record of working with trainee teachers  and university PGCE providers. Each school provides trainees with a fully trained mentor, supported by a Pathway Tutor (subject specialist) from TES Institute who visits each half-term to monitor progress and to “Quality Assure” our programme.  Our route has provided consistent employment for trainees within the Partnership on completion of their training. In the last 3 years, all of our trainees had been employed before the end of the course, the majority of these in the schools where they had trained.\\r\n \\r\nSuccessful applicants gain Qualified Teacher Status (QTS) and most choose to complete a PGCE.\\r\n\\r\nWe provide excellent role models from within the teaching staff and opportunities to observe ‘outstanding teaching’. Each school aspires to engender an ‘appetite for learning’ within its pupil community, both in the classroom and within the range of extra-curricular activities it provides.  \\r\n",
    "TrainWithDisability": "As the academic side of the programme is delivered through an online format, those with disabilities may find it to be a more accessible and flexible option. \\r\n\\r\nFor the in-school elements of the programme, disability access will vary depending on the school. Please check with the School Direct School that you are applying for a place with for details. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "TES Global offers a postgraduate teacher training programme, delivered in your chosen school through an online, virtual learning environment. \\r\n\\r\nAs well as school based training, our trainees benefit from a range of online benefits, including:\\r\n\\r\n* An individual training plan \\r\n* Subject knowledge enhancement \\r\n* An in-school mentor and specialist TES pathway tutor\\r\n* Onsite workshops \\r\n* 24/7 access to the virtual learning environment\\r\n* Live online lectures and tutorials \\r\n\\r\nTrainees are encouraged to study for the academic award of PGCE (validated by UEL) as well as the professional award of qualified teacher status (QTS), awarded by TES Institute. ",
        "UcasInstitutionCode": "H40"
      }
    ]
  },
  "has_inst": true
}
