{
  "locationType": "School",
  "accrediting": "Birmingham City University",
  "provider": "Arthur Terry School",
  "subjects": [
    "Art and design",
    "Secondary"
  ],
  "name": "Art and Design",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1QN/2MMQ",
  "providerCode": "1QN",
  "programmeCode": "2MMQ",
  "schools": [
    {
      "name": "Arthur Terry School",
      "address": "Kittoe Road, Sutton Coldfield, West Midlands, B74 4RZ",
      "code": "A"
    }
  ],
  "addresses": [
    {
      "address": "Kittoe Road, Sutton Coldfield, West Midlands, B74 4RZ",
      "geocode": true,
      "formatted_address": "Kittoe Rd, Sutton Coldfield B74 4SA, UK",
      "latitude": 52.59047229999999,
      "longitude": -1.8383458,
      "post_code": "B74 4SA",
      "city": "West Midlands",
      "route": "Kittoe Road",
      "postal_town": "Sutton Coldfield"
    }
  ],
  "providerAddress": {
    "inst_code": "1QN",
    "addr_1": "Kittoe Road",
    "addr_2": "Four Oaks",
    "addr_3": null,
    "addr_4": "Sutton Coldfield",
    "postcode": "B74 4RZ ",
    "url": "http://www.arthurterry.bham.sch.uk/atnts",
    "geocode": true,
    "formatted_address": "Kittoe Rd, Sutton Coldfield B74 4SA, UK",
    "latitude": 52.59047229999999,
    "longitude": -1.8383458,
    "post_code": "B74 4SA",
    "city": "West Midlands",
    "route": "Kittoe Road",
    "postal_town": "Sutton Coldfield"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "INDUCTION EXPERIENCE \\r\nBefore your course starts you will spend the first 2 weeks at Arthur Terry Teaching School, meeting your new colleagues, Subject Route Leaders and Learning Coaches. Together you will start to learn the theory of teaching, and practise techniques to get you ready for your first school placement. \\r\nWEEKLY COACHING \\r\nEvery week you will be observed and have feedback sessions with your Learning Coach, who has been identified as an outstanding teacher. Your Learning Coach will help you to identify areas in your practice that will help you improve. \\r\nWEEKLY TRAINING SESSIONS \\r\nEvery Friday you will come together with your fellow trainees at Arthur Terry Teaching School. Sometimes these sessions will focus on how to teach your specific subject and sometimes they will focus on broader areas of teaching practice. Sessions are delivered by our Specialist Leaders in Education. \\r\nSCHOOL EXPERIENCE \\r\nTrainees will experience four schools across the Teaching School alliance of varying context to develop their classroom practice. They will work with Learning Coaches who are outstanding practitioners in their own right, who will help the trainees unravel the concepts behind great teaching and develop the attributes to deliver these themselves. Thirty-four weeks of the programme will be spent in classrooms being exposed to outstanding teaching, and working with the Learning coach to develop effective classroom pedagogy and detailed subject knowledge. \\r\nPGCE \\r\nWhile some courses offer you only Qualified Teaching Status, ours will also provide you with a PGCE qualification. We work with our partner university to make sure the assignments will have impact on your classroom teaching. The PGCE will provide you with 60 credits towards a masters qualification. \\r\nCONTINUED PROFESSIONAL DEVELOPMENT \\r\nWe are committed to supporting our trainees beyond their first year. As you continue your career we have a range of teaching and leadership programmes within our Alliance to support you from Newly Qualified Teacher to Aspiring Headteacher. \\r\nYou will become a part of our NQT and NQT+1 programme that builds on your training year. \\r\nVisit our website to learn more about our programme and the opportunities available to develop your career. \\r\n(https://www.arthurterry.bham.sch.uk/atnts/train-to-teach/)",
    "CourseLength": "OneYear",
    "Qualifications": "At least a grade C or Level 4in GCSE English and Mathematics.\\r\nAn undergraduate Honours degree (at least a 2.2) preferably in the chosen subject route or a commitment to complete a subject knowledge enhancement course in shortage subjects.\\r\n",
    "InterviewProcess": "THE CANDIDATE \\r\nWe are looking for highly motivated trainees who are committed to working with the young people in our schools. You must have an excellent subject knowledge but also the ability to deliver this in an engaging and creative way. Successful trainees on our programme will need to be reflective, resilient and able to respond to positively to feedback. Trainees on our course will also need to be able to exhibit high levels of emotional intelligence and be real team players. \\r\nIn-tray exercise \\r\nTo evaluate the applicant's literacy skills and their ability to process, synthesise and evaluate information. \\r\nGroup discussion \\r\nTo evaluate the applicant's awareness of educational issues and to demonstrate the non-cognitive skills required to be an effective teacher. \\r\nSmall group teaching \\r\nA twenty minute teaching activity will be delivered to a small group of children to assess the applicant's ability to break down a concept to enable children to learn. \\r\nInterview \\r\nThe interview will evaluate an applicant's rationale for wanting to become a teacher and their suitability to carry out the job. \\r\n",
    "OtherRequirements": "All applicants will be required to complete an enhanced DBS clearance.",
    "PersonalQualities": "We are looking to select trainees with outstanding potential with a commitment and enthusiasm for working with young people.",
    "HowSchoolPlacementsWork": "The aims of the programme are to:\\r\nProduce highly skilled graduate teachers who:\\r\n\\r\n* are resilient\\r\n* are committed to an ‘open classroom’ ethos where best practice is \\r\n   developed through observing, collaboration and a commitment to \\r\n   ongoing professional development\\r\n* have a deep level of understanding of teaching and learning\\r\n* demonstrate a passion for their subject and working with young people\\r\n* exhibit professionalism in the workplace allowing reasoned judgement \\r\n   to be made in varying situations\\r\n\\r\nThis will be achieved through:\\r\n\\r\n* increasing the amount of time a trainee spends in the classroom\\r\n* a focus on core teaching skills including reading, mathematics and \\r\n   managing behaviour\\r\n* working with outstanding practitioner on a day to day basis\\r\n* having access to outstanding departments in outstanding schools\\r\n\\r\nCourse Overview\\r\n\\r\nOn the 38 week programme trainees time is divided between Teaching Experiences and structured training sessions looking at subject delivery and wider professional issues. Teaching experiences will take place in at least three schools across the Teaching School Alliance. During the course trainees will be supported by their school-based practitioner.\\r\n\\r\nTrainees will be assessed on a combination of evidence gathered during the Teaching Experiences and five assignments that focus on key areas of Teaching and Learning.\\r\n\\r\n\\r\nTrainee Requirements\\r\n\\r\nWe are looking to select trainees with outstanding potential with a commitment and enthusiasm for working with young people. The academic requirements set out by the Department for Education to enter the profession are;\\r\n\\r\nAt least a grade C or 4 in GCSE English and Mathematics\\r\nAn undergraduate honour degree (at least a 2.2) preferably in the chosen subject route or a commitment to complete a subject knowledge enhancement course in shortage subjects."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Arthur Terry Teaching School Alliance “An innovative and collaborative approach to developing outstanding educators”\\r\nThe Arthur Terry School is one of the top performing comprehensive schools in the Birmingham area and the lead school in a successful Teaching School Alliance. Our Teaching School was graded Good with Outstanding Leadership and Management by Ofsted. All our alliance schools, excel in developing teachers at all stages of their career.\\r\nAs a Teaching School we are looking to train and recruit the very best teachers. Our alliance of schools covers Birmingham, Staffordshire and Warwickshire, offering diverse teaching experiences in both rural and urban settings.\\r\nWe are now recruiting for highly motivated graduates, for both Primary and Secondary, either straight out of University or those looking for a career change, who are committed to inspiring and challenging young people. We are looking for people with excellent subject knowledge, but also the ability to deliver this in an exciting and engaging way.\\r\nFurther information can be found on (https://www.arthurterry.bham.sch.uk/atnts/train-to-teach/)",
    "TrainWithDisability": "The Training Centre at Arthur Terry School has full access for people with disabilities. \\r\n\\r\nRecruitment and selection procedures are consistent with the Equality legislation\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "All trainees will have access to all of the training materials via our on-line learning platform. \\r\nIn addition there is a course library at the training base through which trainees will be able to access and loan core texts for the course. \\r\nAs the programme of study is validated by Birmingham City University our trainees have access to all the educational texts and journals that are available at the University library and through their library's on-line platform. \\r\n",
        "UcasInstitutionCode": "B25"
      },
      {
        "Description": "Our course, designed 'by teachers, for teachers', places our trainees in schools across the West Midlands working alongside outstanding practitioners. \\r\nOur Subject Route Leaders, who take the lead in training, are credible, professional teachers who recognise what makes outstanding teaching and learning. \\r\nThe core rationale for our programme is to develop the next generation of outstanding teachers to work across our network of schools and beyond. \\r\nOur Subject Route Leaders work with a maximum of ten trainees, to ensure our trainees feel well supported and confident with the next stages in their own development. \\r\n",
        "UcasInstitutionCode": "A67"
      }
    ]
  },
  "has_inst": true
}
