{
  "locationType": "School",
  "accrediting": null,
  "provider": "Billericay Educational Consortium",
  "subjects": [
    "Chemistry",
    "Science",
    "Secondary"
  ],
  "name": "Chemistry",
  "financial_support": "Student finance if you’re eligible",
  "slug": "B28/2KN4",
  "providerCode": "B28",
  "programmeCode": "2KN4",
  "schools": [
    {
      "name": "Main Site",
      "address": "The Bromfords School, Grange Avenue, Wickford, SS12 0LZ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "The Bromfords School, Grange Avenue, Wickford, SS12 0LZ",
      "geocode": true,
      "formatted_address": "Grange Ave, Wickford SS12 0LZ, UK",
      "latitude": 51.604702,
      "longitude": 0.508668,
      "post_code": "SS12 0LZ",
      "city": "Essex",
      "route": "Grange Avenue",
      "postal_town": "Wickford"
    }
  ],
  "providerAddress": {
    "inst_code": "B28",
    "addr_1": "c/o Bromfords School",
    "addr_2": "Grange Avenue",
    "addr_3": "Wickford",
    "addr_4": "Essex",
    "postcode": "SS12 0LZ",
    "url": "http://www.billericayscitt.com",
    "geocode": true,
    "formatted_address": "Grange Ave, Wickford SS12 0LZ, UK",
    "latitude": 51.604702,
    "longitude": 0.508668,
    "post_code": "SS12 0LZ",
    "city": "Essex",
    "route": "Grange Avenue",
    "postal_town": "Wickford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "Our training course starts in late August through to June.  It has been designed by teachers to reflect the needs of the modern classroom.\\r\n\\r\nOur programme offers:\\r\n\\r\n•\\tAfter the interview day, we will meet with you to discuss your strengths and areas requiring further development and will set you tasks and a reading list to enable you to develop relevant knowledge and skills before the course starts.\\r\n•\\tIf available for your subject, we will recommend you undertake an online Subject Knowledge Enhancement course\\r\n•\\tWeekly subject knowledge sessions with an experienced teacher who delivers Outstanding lessons enabling you to develop your pedagogical skills \\r\n•\\tWe also have weekly sessions covering:\\r\n•\\tChild Development\\r\n•\\tPlanning and Assessment\\r\n•\\tBehaviour Management and Special Educational Needs\\r\n•\\tSafeguarding\\r\n•\\tEnglish as an Additional Language\\r\n•\\tTeacher and the Law\\r\n•\\tWellbeing\\r\n•\\tVoice Care\\r\n•\\tSchool workload\\r\n\\r\nAll our sessions are based either at our training centre in Wickford or in neighbouring secondary schools.\\r\n\\r\nSchool Placements\\r\n\\r\nYou will spend 80% of the course in school. Every Thursday you will receive general professional and subject knowledge sessions.\\r\n\\r\nYou will start undertaking structured observations of teachers followed by team teaching, part lesson then full lesson teaching.\\r\n\\r\nAssessment\\r\n\\r\nDuring the course you will be continually assessed against the Teachers’ Standards through:\\r\n\\r\n•\\tobservation of your lessons\\r\n•\\texamination of your portfolio of evidence\\r\n•\\tassessment tasks\\r\n•\\tyour reflections linking theory from workshops/reading to your practice in the classroom\\r\n\\r\nThere is a formal review of your progress at the end of each term, with the final assessment to gain Qualified Teacher Status taking place in the third term.\\r\n\\r\nCourse workload\\r\n\\r\nWe make sure that any written submissions are evenly spread throughout the course.  We issue a weekly newsletter to trainees keeping them updated of deadlines.  We operate an ‘open door’ policy so trainees can discuss any issues or worries.\\r\n\\r\n\\r\nPGCE (Post Graduate Certificate in Education – 60 Master credits)\\r\n\\r\nIn addition to QTS, we offer trainees the opportunity to study for a PGCE.  All lectures are held at Bromfords School, Wickford.\\r\n\\r\nTrainees need to pass 2 assignments of 5000 words each:\\r\n\\r\n•\\tSpecial Educational Needs and Disabilities\\r\n•\\tProfessional Studies and Research\\r\n\\r\nThis award is validated by University of Suffolk.\\r\n\\r\nWe are proud our course has been rated by Ofsted as ‘Outstanding’ for 12 years.  We believe we offer excellent value for money.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "•\\tGCSE grade C (or grade 4) in English Language and Mathematics \\r\n•\\tMinimum 2:2 honours degree from a UK university or a recognised equivalent qualification\\r\n•\\tIf teaching a subject different to your degree, an A level in that subject is required.\\r\n\\r\nIf you have non-British qualifications, you will need to verify their equivalence through UK NARIC.  You will need to supply written evidence of any equivalencies with your application.\\r\n\\r\nIf you do not hold English, Mathematics or Science GSCE qualifications (or a recognised equivalent), you will need to take an equivalency test.  We recommend www.equivalencytesting.co.uk.\\r\n",
    "InterviewProcess": "Once we receive your application, we will interview you in one of our partner schools.  You will be interviewed by us and a member of school staff.  \\r\n\\r\nOn the interview day, you will be asked to:\\r\n\\r\n•\\tdeliver a 10 minute presentation on an aspect of learning which is either misunderstood by pupils or difficult to teach;\\r\n•\\tcomplete a written task reflecting on a lesson that you have observed a teacher deliver;\\r\n•\\tundertake a formal interview\\r\n\\r\nSuccessful candidates will be offered a place within 24 hours.  An offer letter will be issued and may detail some conditions, e.g. passing your degree.\\r\n\\r\nAll trainees offered a place must:\\r\n\\r\n•\\tpass the literacy and numeracy professional skills tests;\\r\n•\\tpass a Fitness to Teach medical assessment;\\r\n•\\tundergo an enhanced DBS check to verify their suitability to work with young people.\\r\n\\r\nYou will then attend a meeting with the Course Director to discuss the strengths and areas for further development identified on the interview day.  Tasks will also be set with reading lists to for you to develop your subject knowledge.  If available in your subject, we encourage you to do an online subject knowledge enhancement course.\\r\n",
    "PersonalQualities": "You need to be:\\r\n\\r\n•\\timaginative, creative and energetic;\\r\n•\\tenthusiastic about teaching;\\r\n•\\thardworking, adaptable and flexible;\\r\n•\\twell organised, focused and determined;\\r\n\\r\n•\\thave a positive outlook;\\r\n•\\thave a resilient nature;\\r\n•\\thave an ability to inspire and enthuse;\\r\n•\\thave the ability to work in a team and with other adults;\\r\n•\\thave the ability to reflect, listen and are willing to act on advice;\\r\n•\\thave the ability to use their initiative\\r\n\\r\nThese qualities are developed on the course through interactive workshops, which previous trainees have greatly valued. \\r\n\\r\nYou are learning all the time.\\r\n",
    "HowSchoolPlacementsWork": "We spend considerable time in ensuring that your placement school is within a reasonable travelling distance from your home.  We know our school mentors very well and try to match our trainees with their mentor to build that strong professional relationship.\\r\n\\r\nIf you wish to nominate a school, we will be pleased to talk to the Headteacher about our programme.\\r\n\\r\nYou will be teaching across the age range 11-16.\\r\n\\r\nAll our headteachers are passionate about ‘growing their own’ staff and are very committed to our programme.  We work with over 20 secondary schools, as they acknowledge we produce excellent Newly Qualified Teachers who are fully prepared for the challenges of the modern classroom.\\r\n\\r\nEach trainee will be placed in the same school for the whole year, apart from a 6 week period spent in a different school.  This second placement will be in a contrasting school environment.  Our schools comprise of faith schools, grammar schools and comprehensive schools.\\r\n\\r\nIn addition, we provide experiences at special schools, pupil referral units, and alternative educational settings.\\r\n\\r\nSchools play such an important part in the programme, and that’s why we can provide you with an outstanding foundation on which to build your future career.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Join our well-structured, supportive School-Centred Initial Teacher Training course. \\r\n\\r\nAt the end of the course, our trainees say that they feel confident and fully prepared to start their teaching career.\\r\n\\r\n100% of our trainees gain employment, and enjoy the benefit of our support into their first teaching post and beyond.\\r\n\\r\nOur course offers great value for money – we deliver quality workshops, carefully identified placements, individual pastoral support and academic support in writing assignments. Our focus is on you as an individual, providing you with a tailor-made training programme.\\r\n\\r\nWe offer:\\r\n\\r\n•\\ta training programme that has been rated ‘Outstanding’ by Ofsted for the past 12 years and placed in the top five of the ‘Good Teacher Training Guide’ for the past 10 years;\\r\n•\\texperienced school mentors who are passionate about developing outstanding and confident Newly Qualified Teachers;\\r\n•\\tengaging workshops delivered by outstanding and knowledgeable teachers, providing you with a wealth of ideas to inspire pupil learning;\\r\n•\\topportunities to build your confidence in diverse settings, e.g. special school, pupil referral unit and an inner city school where you will be working with pupils with English as an additional language;\\r\n•\\ta Postgraduate Certificate in Education, worth 60 Master credits. This provides an ideal opportunity to bring together the very best of school experience and academic study; \\r\n•\\topportunity for you to request a school where you would like to train.\\r\n\\r\nMake us your first choice and train with the best in Essex.\\r\n\\r\n\\r\n",
    "TrainWithDisability": "Our aim is to promote and implement an inclusive learning and teaching environment, allowing you to study independently.\\r\n\\r\nWe are here to support you and would encourage you to contact us so we can help identify an ‘appropriate adjustments’ to meet your individual needs.\\r\n\\r\nOnce you have applied for our course, we are available for you to contact to discuss your particular needs.  We have had trainees who have successfully passed our course with visual and hearing impairments, dyslexia, dyspraxia and autistic spectrum conditions.  \\r\n\\r\nWe understand your needs and will work closely with you to ascertain the impact of your condition on your studies.  It may be you need:\\r\n\\r\n•\\tdeadlines to be extended;\\r\n•\\tworkshops to be recorded;\\r\n•\\tpowerpoint presentations in advance of workshops\\r\n•\\tphotocopying on coloured paper\\r\n•\\twheelchair access\\r\n\\r\nWith your permission, we will ask your mentor to work with you providing support and guidance.  We need to ensure that all elements of this training year make ‘reasonable adjustments’ to provide every opportunity for you to succeed.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
