{
  "locationType": "University",
  "accrediting": null,
  "provider": "The University of Reading",
  "subjects": [
    "Physics",
    "Science",
    "Secondary"
  ],
  "name": "Science with Physics",
  "financial_support": "Student finance if you’re eligible",
  "slug": "R12/F3X1",
  "providerCode": "R12",
  "programmeCode": "F3X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "R12",
    "addr_1": "Admissions Office",
    "addr_2": "Miller Building",
    "addr_3": "Whiteknights",
    "addr_4": "Reading",
    "postcode": "RG6 6AB ",
    "url": "http://www.reading.ac.uk",
    "geocode": true,
    "formatted_address": "Miller Building, Earley, Reading RG6, UK",
    "latitude": 51.4393572,
    "longitude": -0.9469907999999999,
    "post_code": "RG6",
    "city": "Earley",
    "route": null,
    "postal_town": "Reading"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Science course is consistently graded as good in Ofsted inspections, and will lead to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of science education. They are a diverse and incredibly experienced community of academics with extensive school teaching and academic experience.\\r\n\\r\nTake part in activities designed to help you to plan your teaching effectively and imaginatively. Discover how to evaluate your skills, particularly in terms of the quality of learning achieved by pupils.\\r\n\\r\nYour teaching is through a series of practical seminars and workshops in purpose-built science laboratorieswhere interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Institute of Education is an established provider of high-quality training and research in education. In the latest national assessment, 80% of our research outputs were rated world leading or internationally excellent, positively impacting educational policy and practice. The University has also been ranked in the top 150 in the world for Education. * \\r\n\\r\nWe offer a BA in education Studies, MA in education studies and a range of teacher training courses in primary, secondary and early years.  At the Institute of Education we have the research, the expertise and the passion to help others grow into engaged and active citizens; individuals with resilience and the confidence to tackle challenges.  \\r\n\\r\nThe Institute of Education is a community and the impact of our research and the breadth of our experience feeds directly into everything we do and the world around us. Our networks and the impact of our work are both local and global. Locally, we have well-established partnerships with over 300 schools, who we work closely with to train the next generation of outstanding teachers. Globally, our research, consultancy and other projects extend to countries as varied as China, Jamaica, the USA and Singapore. For more on our programmes visit: (https://www.reading.ac.uk/education/) \\r\n\\r\n*QS World Rankings by subject 2018\\r\n \\r\n",
    "TrainWithDisability": "The University of Reading welcomes disabled students and has a dedicated Disability Advisory Service. The service offers advice and guidance to students with any disability, mental health condition, or specific learning difficulty (SpLD).\\r\n\\r\nIf you are unsure whether you wish to disclose your disability on your application, you can discuss the implications of a disclosure in complete confidence, with one of our disability advisers.\\r\n\\r\nWe offer support, advice and guidance with:\\r\n\\r\n- physical disabilities e.g. mobility\\r\n- sensory disabilities e.g. visual impairments\\r\n- mental health difficulties e.g. anxiety\\r\n- medical conditions e.g. Irritable Bowel Syndrome, diabetes, autism/Asperger Syndrome\\r\n- SpLDs e.g. dyslexia, dyspraxia \\r\n\\r\nThe Disability Advisory Service may be able to assist in study related support in the following ways:\\r\n- assessing the impact of your disability  on your studies and recommend any reasonable adjustments required\\r\n- provide information on funding for study support, including the Disabled Students Allowance.\\r\n- Liaise with your Department including Senior Tutors and Disability Representative on reasonable adjustments, including extensions to deadlines and alternative modes of assessment where appropriate.\\r\n- Flag students (with permission) in order that tutors are made aware of individual requirements.\\r\n- The Disability Advisory Service can provide assistance on arranging non- medical helpers e.g. one to one support arrangements such as mentors and specialist study skills.\\r\n- Liaising with the exams office re special exam arrangements\\r\n- Referral and signposting to other services\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
