{
  "locationType": "School",
  "accrediting": "The Manchester Metropolitan University",
  "provider": "Bury Teaching Schools Alliance",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "274/2RJC",
  "providerCode": "274",
  "programmeCode": "2RJC",
  "schools": [
    {
      "name": "Main Site",
      "address": "Church Street, Walshaw, Bury, Lancashire, BL8 3AX",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Church Street, Walshaw, Bury, Lancashire, BL8 3AX",
      "geocode": true,
      "formatted_address": "Walshaw, Tottington, Bury BL8 3BA, UK",
      "latitude": 53.6021604,
      "longitude": -2.3397805,
      "post_code": "BL8 3BA",
      "city": "Tottington",
      "route": null,
      "postal_town": "Bury"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Tuition Fees\\r\n\\r\nYou will need to pay tuition fees of £9,250 for your PGCE course. This can be funded through a tuition fee loan from Student Finance England. The loan is not means -tested and covers the full amount of the tuition fees. These are then paid direct to the University when you enrol on a PGCE course. You would repay the loan after you have graduated and are earning over £25,000.\\r\n\\r\nMaintenance Loan\\r\n\\r\nThis is available to help you with your living costs. The amount you will receive depends on your household income (parents’ or partner’s income plus yours) and the loan is repayable once you have finished the course and are earning over £25,000.\\r\n\\r\nA bursary or scholarship may also be available for this subject.\\r\n\\r\n",
    "AboutCourse": "The majority of the training will be delivered by expert teachers and well-qualified mentors in our alliance of schools. This will be further enhanced by attendance on a number of days at our partner University, which will be based at their £139 million new academic building at Birley Fields, All Saints campus in Manchester city centre. BTSA will supplement this training with a structured continuous professional development programme throughout the year. You will soon find yourself in classrooms and with full support and thorough preparation, will share the responsibility for planning and teaching your own groups.\\r\n\\r\nYou will be based in two schools within the alliance where you will be trained and mentored by outstanding specialist teachers of your subject in successful departments and Key Stages. All trainee teachers are required to teach in two consecutive key stages. This course will equip you with the skills to teach the KS3 and KS4 curriculum (children aged from 11-16 years) in your chosen subject area. The programme is highly personalised from your first contact with us at Bury Teaching Schools Alliance to taking up your first teaching job, hopefully in one of our alliance partner schools.\\r\n\\r\nIn addition to school-based training for Qualified Teacher Status, our trainees achieve a PGCE with Master's level credits. \\r\n\\r\nAssessment is by coursework. The purpose of assessment is to complement and build on other work on the course. The assessment items are an integral part of the learning process, thus helping you enter your first appointment with confidence and competence. For this reason all assessment is related to work in schools.\\r\n\\r\nThere are two assessment elements:\\r\n1. Teaching (incorporating the teaching file)\\r\n2. Written assignments (on language and diversity, and on curriculum development).\\r\n\\r\nThere are three sets of course completion requirements:\\r\n\\r\n1. The professional development file (containing four items: audit of subject knowledge and understanding, observational and analytical tasks, and your record of professional review meetings with mentors and tutors)\\r\n2. The career entry profile (completed at the point of becoming a newly qualified teacher and taken with you into your first post)\\r\n3. Good attendance",
    "CourseLength": "OneYear",
    "Qualifications": "All applicants must have a minimum 2:2 degree. \\r\n\\r\nFor those applying for Secondary, the degree modules must be at least 50% relevant. You may still apply if you do not fulfil this criteria, however you may be required to complete a Subject Knowledge Enhancement course which would need to be completed before enrolling to train to teach with us.\\r\n\\r\nGrade C/4 GCSEs in English Language, Mathematics and Science.  \\r\n \\r\nPlease contact us to discuss these requirements.",
    "InterviewProcess": "All UCAS applications are checked that they meet course entry requirements by our partner university, Manchester Metropolitan University. The applications which fulfil this criteria then come to the BTSA to be shortlisted by our admissions panel. After passing these two stages, we will contact successful candidates and invite them to an assessment session at one of our alliance schools. \\r\n\\r\nThe session will consist of a mini-teach, a grammar test, a written piece and an interview. These tasks enable us to get to know you and to identify whether we may be able to organise additional support for example in completing the QTS tests, or for course assignments. \\r\n\\r\nThe interview panel will be made up of senior practitioners from our alliance.\\r\n\\r\nThe mini-teach will be for 20 minutes to a group of Year 7 pupils and there will be a short opportunity for discussion following the mini-teach observation.\\r\n\\r\nThe written task is designed to assess the quality of candidates' written English and their understanding of current issues in education.\\r\n\\r\nThe standard of candidates' spoken English will be continuously assessed throughout the interview day.\\r\n\\r\nThe session is also a great opportunity for us to share more information about our course with you and answer any questions that you may have. We try to make the session as enjoyable and informative as we can and welcome any questions. If you have any requirements for the session please do not hesitate to let us know.",
    "OtherRequirements": "Applicants must have passed the Professional Skills tests in Literacy and Numeracy before starting the course. Further information about registering for and completing these tests can be found on the Department for Education website:\\r\n\\r\nwww.education.gov.uk/get-into-teaching/apply-for-teacher-training/skills-tests\\r\n\\r\nSchool experience is no longer required for you to apply to train to teach with us. BTSA do understand and recognise the value of school experience and should you wish to arrange this we would be happy to help you.",
    "PersonalQualities": "We are looking for inspiring, knowledgeable and ambitious trainees who are passionate and enthusiastic about teaching to make a real difference to young peoples' lives and futures. If this is you, and you have the following attributes, we want to hear from you!\\r\n\\r\n•The confidence and ability to engage with children\\r\n•Commitment to excellence in education\\r\n•Excellent communication and organisational skills\\r\n•A commitment to working hard\\r\n•An ability to establish good working relationships\\r\n•Commitment to a professional team\\r\n•Flexibility - a crucial characteristic that is vital in this active and constantly changing climate\\r\n",
    "HowSchoolPlacementsWork": "BTSA works on an A B A model where you will complete two school placements A and B; placement A in the autumn and summer terms at one of the schools in the Bury Teaching School Alliance and placement B in the spring term where you will be allocated to a different school within the Alliance. If you have an interest in training to teach in a special school, we are able to offer you the experience of working in a Bury special school (available in specific subjects) for one of your placements. \\r\n\\r\nOur Alliance schools offer dynamic and diverse settings within which to train. You will get experience of working with young people of all abilities. You will also have the opportunity of observing in a primary school, sixth-form college and a special school to give you the experience of working with learners in all phases and contexts.\\r\n\\r\nThe first placement will start early September and involves teaching practice in school each week, with a number of Professional Study/ Training Days over the year delivered by outstanding colleagues from our Teaching Alliance schools enabling an opportunity to discuss teaching experiences with the whole School Direct cohort in Bury, share ideas and learning and access further training opportunities to suit the requests and needs of students. This placement ends at the end of the autumn term and trainees return after Easter. The second placement starts in January and ends before Easter.\\r\n\\r\nYou will have full access to the facilities of The Manchester Metropolitan University, which has national recognition for its high quality Initial Teacher Training provision. The majority of your time will be school based but there are a number of days where you will be based at the University, far reduced compared to a traditional PGCE.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Christ Church CE Primary School and Elms Bank Specialist Arts College are the designated Teaching Schools within the Bury Teaching Schools Alliance (BTSA). The BTSA is a joint venture by primary, special and secondary schools in Bury.\\r\n\\r\nWe work in partnership with Manchester Metropolitan University to grow our next generation of teachers and future leaders.\\r\n\\r\nWe work very closely with a number of Bury Schools on Initial Teacher Training and are able to provide cross phase opportunities in a range of school settings. Uniquely, we are also offering ITT experience and placements within a special school context for those students who express an interest in working in special education.\\r\n\\r\nOur alliance schools have worked with trainee teachers for many years now, with a large number of our previous Graduate Teachers gaining employment as NQTs in Bury. We offer structured career pathway opportunities and many of our former students now hold middle and senior leadership roles in our schools.\\r\n\\r\nThe partnership schools in our alliance offer a range of experiences, working alongside happy and friendly children and hardworking and ambitious staff. All the schools have experience of teacher training and are able to coach and mentor trainees through the programme, producing good and outstanding trainees who go on to complete their NQT year with confidence.\\r\n",
    "TrainWithDisability": "BTSA welcomes applications from all candidates. If you have what we are looking for then we want to meet you! We will do everything that we can to make the process smooth for you and ask you to let us know if we can assist in any way. We have and continue to support trainees with various disabilities and other needs (for example, physical disabilities, dyslexia and other needs). If you have any requirements that will assist you in the recruitment process please do not hesitate to contact us. We endeavour to make the process as smooth as possible for all our applicants!\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "You will have full access to the facilities of The Manchester Metropolitan University, which has national recognition for its high quality Initial Teacher Training provision. Initial Teacher Training at the MMU Faculty of Education was rated as 'good' for Primary and Secondary in the last Ofsted Inspection (2015). Ofsted reported 'strong leadership and management and consistently good quality teaching leading to good outcomes for trainees in primary and secondary phases' (Ofsted, 2015).\\r\n\\r\n",
        "UcasInstitutionCode": "M40"
      }
    ]
  },
  "has_inst": true
}
