{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Leicester",
  "subjects": [
    "Secondary",
    "Social sciences"
  ],
  "name": "Social Science",
  "slug": "L34/L35X",
  "providerCode": "L34",
  "programmeCode": "L35X",
  "schools": [
    {
      "name": "Main Site",
      "address": "School of Education, 21 University Road, Leicester, LE1 7RF",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "School of Education, 21 University Road, Leicester, LE1 7RF",
      "geocode": true,
      "formatted_address": "21 University Rd, Leicester LE1 7RH, UK",
      "latitude": 52.6268992,
      "longitude": -1.1223128,
      "post_code": "LE1 7RH",
      "city": "Leicester",
      "route": "University Road",
      "postal_town": "Leicester"
    }
  ],
  "providerAddress": {
    "inst_code": "L34",
    "addr_1": "21 University Road",
    "addr_2": null,
    "addr_3": "Leicester",
    "addr_4": null,
    "postcode": "LE1 7RF ",
    "url": "http://www.le.ac.uk/pgce",
    "geocode": true,
    "formatted_address": "21 University Rd, Leicester LE1 7RH, UK",
    "latitude": 52.6268992,
    "longitude": -1.1223128,
    "post_code": "LE1 7RH",
    "city": "Leicester",
    "route": "University Road",
    "postal_town": "Leicester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Tuition fees for the 2019/20 academic year are yet to be confirmed.\\r\n\\r\nAs an indication of what you might pay, the fee for students who started in September 2018 was:\\r\n•\\t£9,250\\r\n\\r\nPGCE students can apply for loans from Student Finance England and may be entitled to a tax-free bursary -https://getintoteaching.education.gov.uk/funding-and-salary/overview\\r\n\\r\nFind out more about scholarships and funding on our website - https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts\\r\n\\r\n",
    "AboutCourse": "The PGCE Social Science course aims to prepare you to meet the NCTL Standards fully and to teach Advanced level Psychology and/or Sociology with confidence and authority.\\r\n\\r\nThe PGCE Social Science aims to:\\r\n•Introduce you to the variety of strategies and techniques available to the teacher in the modern education system; \\r\n\\r\n•Model the above strategies and techniques in University sessions; \\r\n \\r\n•Guide you to a set of principles which will allow you to operate as effective practitioners in new and challenging situations; \\r\n\\r\n•Introduce you to wider issues which confront Social Science teachers; and\\r\n\\r\n•Inform you about current developments in education which impinge upon their role as Social Science teachers.\\r\n\\r\nAll training will be done as a Social Science group, though where appropriate, specialist psychology and sociology sub-groups are formed. In addition, all students are required to teach one or more Humanities, PSHE, Citizenship and/or vocational courses.\\r\n\\r\nThe Social Science subject specialism will cover a variety of areas including:\\r\n•Psychology/Sociology\\r\n\\r\n•Personal and Social Education\\r\n\\r\n•Vocationalism\\r\n\\r\n•ICT and Social Sciences\\r\n\\r\n•Examination and Assessment Issues\\r\n\\r\n•Citizenship\\r\n\\r\nContinuous assessment is used throughout the course and there are no examinations.\\r\n\\r\nSelection for the Social Science course is based on the general qualities required by the University of Leicester course as a whole. However, there are three other issues that applicants need to note: \\r\n•  To support your readiness for the school workplace, the course aims to give you a wide range of teaching experience across the Social Sciences. This means that you may be expected to teach Sociology and Psychology, as well as Health & Social Care, as part of your school placement. \\r\n\\r\n•  As the Social Sciences have a limited presence in the pre-16 curriculum, successful applicants will show that they have the knowledge to teach outside of the social science curriculum, usually in the form of some Humanities pre-14 or Vocational teaching pre-16. To support Social Science students with this they may, at times, form part of a Humanities subject group along with History, Geography, RE and Citizenship specialists for generic sessions. \\r\n\\r\nOther options for pre-16 teaching may be acceptable. However, there are limitations on the range of subjects that might be reasonably provided for in the PGCE Social Science course. \\r\n\\r\n•  As competition for places on the Social Science course is fierce, early application for a place on the Social Science course is advised. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "•\\t2:1 degree for English, Geography, History or Social Science\\r\n•\\t2:2 degree for Mathematics, MFL, Sciences or RE\\r\n(We may, under exceptional circumstances, accept a Third if there are \\r\nother very strong recommending features in your application.)\\r\n\\r\n•\\tGCSE Grade 4 (old grade C) or above in English Language and Maths (equivalency test available if needed)\\r\n\\r\n•\\tA-levels (or equivalent) in relevant subjects\\r\n\\r\n•\\tAlthough not essential, you may find it useful to have recent experience working with children and/or observing teaching in a school setting.\\r\n\\r\n•\\tA pass in the Professional Skills Tests in literacy and numeracy\\r\n",
    "FeeInternational": 15405.0,
    "InterviewProcess": "If invited for interview, you will meet members of the course team who will give an overview of the course and answer any questions you may have. \\r\n\\r\nYou will participate in a group task with candidates from a range of subjects and give a brief presentation as part of a small group. \\r\n\\r\nSubject tutors will introduce a written subject task that you will complete during the day and you will have an individual interview with a subject tutor. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.",
    "OtherRequirements": "Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\\r\n\\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\\r\n\\r\nEnglish Language Requirements - you must have a GCSE Grade 4 (old grade C) in English Language. \\r\n\\r\n\\r\nWe offer an equivalency test in English and/or Mathematics for any successful applicant who does not hold this qualification or an equivalent one.  \\r\n",
    "PersonalQualities": "The Secondary PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills also include the ability to form relationships,  good communication skills, a commitment to learning and teaching and reflective qualities. \\r\n\\r\n",
    "HowSchoolPlacementsWork": "You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with learners from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\\r\n\\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\\r\nPhase A.  In planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \\r\n\\r\nPhase A\\r\nAfter induction you will spend about 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you. \\r\n\\r\nPhase B\\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education has a long and successful history of teacher training and a strong reputation for producing graduate teachers prized by schools.\\r\n\\r\nThe School of Education is located in the heart of Leicester, identified in recent research as one of the most affordable study destinations in Britain. We are within five minutes’ walk of both the railway station and the main University of Leicester campus with its student support services and award-winning library.\\r\n\\r\nThe School of Education works in partnership with over 150 local schools. They represent an unusually varied and interesting range of institutions, including rural village schools, suburban and inner city schools and academies, and special schools. Many of the schools have a diverse, multi-ethnic population. Training to teach here provides the solid foundations to teach in a range of different contexts.\\r\n\\r\nWe are also a proactive partner with individual schools and alliances who offer the University of Leicester PGCE via the School Direct and SCITT training routes. Our close and collaborative relationship with partner schools ensures that, whichever training route they choose, University of Leicester PGCE students benefit from the same wide-ranging but consistently high quality experiences.\\r\n",
    "TrainWithDisability": "The School of Education's AccessAbility Tutor contacts all students who declare a disability to the University to advise about the support which they may be entitled. We ask students to tell us how their disability may affect their learning and any adjustments they need in order to access their studies. \\r\nThese requests, with students' permission, are passed on to the relevant tutors, lecturers and schools so that they can accommodate all student needs. \\r\nStudents can contact the School of Education's AccessAbility Tutor and the University's AccessAbility Centre for further advice or to report a problem. \\r\n\\r\nSome examples of how we support students with disabilities include:\\r\n\\r\n•\\tAccessible school placements provided for students with a physical disability.\\r\n•\\tTutors are sensitive to the needs of students with mental health difficulties. \\r\n•\\tSlide presentations and resources are available at least 24 hours before a session takes place. \\r\n•\\tThe AccessAbility Centre provides late appointments for PGCE students who are on placement and unable to attend during the day.\\r\n•\\tDisabled parking permits are provided to enable students with physical disabilities to park close to university buildings.\\r\n•\\tA variety of lesson planning templates is discussed with students to find one that is more accessible for those with dyslexia.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
