{
  "locationType": "School",
  "accrediting": "Poole SCITT",
  "provider": "Harbourside Poole School Direct Salaried",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Salary",
  "slug": "2GQ/3638",
  "providerCode": "2GQ",
  "programmeCode": "3638",
  "schools": [
    {
      "name": "Main Site",
      "address": "School Lane, Poole, Dorset, BH15 3JR",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "School Lane, Poole, Dorset, BH15 3JR",
      "geocode": true,
      "formatted_address": "School Ln, Poole BH15 3JR, UK",
      "latitude": 50.7292676,
      "longitude": -1.9841785,
      "post_code": "BH15 3JR",
      "city": "Poole",
      "route": "School Lane",
      "postal_town": "Poole"
    }
  ],
  "providerAddress": {
    "inst_code": "2GQ",
    "addr_1": "Sherborn Crescent",
    "addr_2": null,
    "addr_3": "Poole",
    "addr_4": "Dorset",
    "postcode": "BH17 8AP",
    "url": "http://www.poolescitt.co.uk",
    "geocode": true,
    "formatted_address": "Sherborn Cres, Poole BH17 8BQ, UK",
    "latitude": 50.75017920000001,
    "longitude": -1.9586636,
    "post_code": "BH17 8BQ",
    "city": "Poole",
    "route": "Sherborn Crescent",
    "postal_town": "Poole"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "The programme offers you a one year course leading to Qualified Teacher Status (QTS) \\r\nThe course is school based within the Harbourside Learning Partnership Schools (HLP) but with some taught course elements being provided by Poole SCITT.\\r\nYou will experience a main teaching placement in a Harbourside Learning Partnership school during your training as well as an alternative key stage experience in another Harbourside school. Both will be supervised by a trained mentor. \\r\nYour progress will be monitored and assessed through regular formal and informal monitoring of teaching competence, leading to profile reviews. \\r\n",
    "CourseLength": "OneYear",
    "SalaryDetails": "There are no fees for this programme.\\r\n\\r\nSalary will be paid at the unqualified teacher rate as at September 2019. The current unqualified teacher rate for 2018/19 is £16,856.\\r\n\\r\n",
    "Qualifications": "You will need a UK honours degree 2:2 or above.\\r\nYou will require GCSE Grade C/4 or above in English, Maths and any Science subject.\\r\n'A' Level & BTEC grades will be considered.\\r\nIt's strongly recommended that candidates demonstrate a strong commitment to Primary Education and where possible to have spent time working (either paid or in a voluntarily capacity) in a primary, junior or infant school to familiarise themselves with working with children and the demands of the primary classroom. \\r\nWe recommend potential students familiarise themselves with core curriculum subject knowledge and IT techniques in preparation for teacher training.\\r\n",
    "InterviewProcess": "\\r\nApplicants are selected from UCAS Teacher Training applications. \\r\nYou should write a full personal statement giving reasons for wanting to teach. You should cite any experience of working with children (although strongly recommended, this isn't an essential requirement for application).\\r\nCareful consideration should be made to referees. These might be a University tutor, depending on time lapsed since the degree was taken or from a school or employment contact. \\r\n\\r\nAt least one reference should be from someone who can comment upon your work with children.\\r\nApplicants should possess the minimum qualification requirements or be working towards them with them being in place by the time the course begins.\\r\nPlease make it clear if you are working towards GCSE qualifications.\\r\n\\r\nSuccessful candidates will be invited to attend an individual interview as well as complete Literacy and Numeracy tests (different from the DfE Professional Skills tests). This will be held at one of the HLP Schools over the course of one day. The day will involve working with children in a classroom and reading a story to a class. \\r\nMore specific details about the interview days will be provided to candidates by email if successful in their application, so please provide a valid and regularly monitored email address on application forms. \\r\n\\r\nAll offers made will be subject to normal employment checks including DBS and medical clearance and the passing of the DFE professional skills tests in Literacy and Numeracy and, where necessary, satisfactory completion of degrees and other minimum qualification requirements. \\r\n",
    "OtherRequirements": "All offers made will be subject to Criminal Records Checks and medical clearance and where necessary, satisfactory completion of degrees and other minimum qualification requirements.\\r\nTrainees will be required to have passed the DfE Professional Skills Tests in Literacy and Numeracy before commencing the course. It is preferable to have completed these as early as possible.\\r\n",
    "PersonalQualities": "This is a course aimed at career changers with at least 3 years work experience who demonstrate exceptional potential to teach. Candidates will need to demonstrate that they are highly motivated, resilient, reflective and have an ability to adapt to the rapid rate of change of expectation. \\r\nWe're looking for enthusiastic, hardworking, well organised students who are ready for a challenging but rewarding year.\\r\nWe are looking for candidates who have the passion and potential to make the most of a course which ultimately equips them to become an excellent teacher and a credit to the profession.\\r\n",
    "HowSchoolPlacementsWork": "The Harbourside Learning Partnership Schools have a long track record of providing a quality teaching and learning environment. Each school has a commitment to professional development as evidenced by many years’ experience working with trainees in initial teacher training in partnership with Poole SCITT. \\r\nLeaders in the 6 schools have been strongly involved in the writing and development of the course and mentoring and assessment. \\r\nTrainees will be assigned a trained mentor within each school who will be responsible for supporting and guiding professional development and ensuring that the trainee has the opportunities they need within the school. \\r\nAll trainees are required to undertake assessed training in both Key Stages 1 and 2 and school experience will be in one Key Stage for the majority of the year, with a short placement in the opposite Key Stage.\\r\nYou will be placed in schools that best help you to develop your professional practice. This could be across any of the schools in the HLP partnership.\\r\nYour in-school experience will progress from observing and working alongside your class teacher to taking full responsibility, firstly for groups and later, for the whole class.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Harbourside Learning Partnership (HLP) is a collaborative partnership of six infant, junior and primary schools in Poole: \\r\n\\r\nBaden-Powell and St Peter's CofE Junior School \\r\nCourthill Infant School \\r\nLilliput CofE Infant School \\r\nLongfleet CofE Primary School \\r\nOakdale Junior School \\r\nOld Town Infant School and Nursery \\r\n\\r\nCreated in collaboration between the partnership's schools and Poole SCITT (accrediting provider), we offer 2-3 Initial Teacher Training placements, at primary school level, for suitably qualified graduates. The course leads to Qualified Teacher Status (QTS). \\r\n\\r\nThe taught course sessions will take place in the Poole SCITT centre and the partnership schools. \\r\nThe majority of learning will take place on the job working with your designated class. \\r\n\\r\n",
    "TrainWithDisability": "Candidates are given several opportunities to declare any disabilities or additional support required both before and during the course.\\r\nWe then support students on an individual basis according to need. Being a small provider, on occasions we may need to seek specialist advice from outside agencies.\\r\nAll candidates successful in obtaining a place will need to be medically cleared as 'Fit to Teach' as per DfE initial teacher training requirements.\\r\nThe SCITT centre at Ad Astra Infant School is accessible for all as are the placement schools.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Poole SCITT stands for 'Schools-Centered Initial Teacher Training’ and are a long established training provider in the local area, working with over 30 primary schools.\\r\n\\r\nPoole SCITT have been accredited by the DfE as an official provider of initial teacher training and has been recognised by Ofsted as 'Outstanding' in all areas.\\r\n",
        "UcasInstitutionCode": "P75"
      }
    ]
  },
  "has_inst": true
}
