{
  "locationType": "School",
  "accrediting": "The University of Reading",
  "provider": "Bracknell Forest Partnership",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Student finance if you’re eligible",
  "slug": "2FZ/36XC",
  "providerCode": "2FZ",
  "programmeCode": "36XC",
  "schools": [
    {
      "name": "Main Site",
      "address": "Ranelagh Drive, Bracknell, Berkshire, RG12 9DA",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Ranelagh Drive, Bracknell, Berkshire, RG12 9DA",
      "geocode": true,
      "formatted_address": "Ranelagh Dr, Bracknell RG12 9DA, UK",
      "latitude": 51.4106932,
      "longitude": -0.7449593999999999,
      "post_code": "RG12 9DA",
      "city": "Bracknell Forest",
      "route": "Ranelagh Drive",
      "postal_town": "Bracknell"
    }
  ],
  "providerAddress": {
    "inst_code": "2FZ",
    "addr_1": "Ranelagh Drive",
    "addr_2": null,
    "addr_3": "Bracknell",
    "addr_4": "Berkshire",
    "postcode": "RG12 9DA",
    "url": "http://bracknellforestschooldirect.co.uk",
    "geocode": true,
    "formatted_address": "Ranelagh Dr, Bracknell RG12 9DA, UK",
    "latitude": 51.4106932,
    "longitude": -0.7449593999999999,
    "post_code": "RG12 9DA",
    "city": "Bracknell Forest",
    "route": "Ranelagh Drive",
    "postal_town": "Bracknell"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The Bracknell Forest Partnership teacher training programme gives you the opportunity to experience life in a school whilst working towards your Post Graduate Certificate in Education (PGCE). \\r\n\\r\nThe programme is a one-year school based full-time route into teaching that, alongside classroom teaching, includes lesson observation, training within a host and second school; partnership based training days and time spent at the University of Reading. \\r\n\\r\nWith Bracknell Forest schools you will have the opportunity to experience teaching all age and ability groups. Our schools have very good facilities and access to technology, including interactive whiteboards, \\r\n\\r\nAt your host school you will be assigned a learning mentor, a qualified, experienced teacher who will work alongside you and support your professional development. You will meet with them at regular intervals throughout the year to review your individual training plan and to set professional development targets.  Being based in the school you are surrounded by experts and there is always someone to ask for help advice or just to discuss your learning.  You can also network with previous years trainees.\\r\n\\r\nOne morning a week will be spent on professional studies, where experts from across the partnership schools will offer you an insight into particular topics that will help you as a teacher, either developing your own skills, or enabling you to better understand the needs of your pupils. Training will either take place internally or you will train with all School Direct trainees in one of the other partnership schools.\\r\n\\r\nTo achieve your PGCE you are required to complete a written assignment each term, these will be set and marked by the University and complement your study towards qualified teacher status, allowing you to study and research particular topics in depth. This work is also worth up to 60 credits towards a Masters degree. \\r\n\\r\nPhysical Education in Bracknell Forest is one of the most popular choices for students. Our facilities are excellent and boast full size Astroturf pitches, tennis courts, netball courts, fields, cricket nets, sports halls and a Trampoline Centre.\\r\n\\r\nStudents take part in Core PE in Key Stages 3-5 with BTEC, GCSE and A Level options available for Key Stages 4 & 5.\\r\n\\r\nIf you have a passion for teaching developing young people's skills, confidence and leadership plus the challenge of expanding your experience in all aspects of PE we would love you to come and work with our dedicated, dynamic teams.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You are required to hold a UK honours degree or equivalent before commencing teacher training. You may still be completing your degree when you apply.\\r\n\\r\nYour degree should be in, or closely related to, your proposed teaching subject. If your degree is not in the subject you wish to teach, please contact us at teacher.recruitment@bracknell-forest.gov.uk to discuss the qualifications/knowledge required to teach this subject.\\r\n\\r\nYou will also need to have achieved Grade 4 (or C) or above in GCSE Mathematics and English or equivalent.\\r\n\\r\nPlease note: International qualifications require NARIC certification. We will request this before considering you for interview.\\r\n",
    "FeeInternational": 15650.0,
    "InterviewProcess": "Once we receive your application, we will undertake a short listing process. For practical reasons we cannot interview everyone so please ensure your application tells us all the relevant skills, knowledge and experience you have to offer.\\r\n\\r\nThe ability to relate to and motivate young people is essential, and successful applicants will be those who will work well as part of a team, who are able to reflect on their own learning, be highly organised with good personal communication skills and keen to play a part in the wider life of the school. \\r\n\\r\nThe strongest candidates will be invited to an interview, at one of the partnership schools. Here you will have the opportunity to demonstrate your rapport with young people, subject knowledge and other professional skills, through a variety of recruitment activities, including:\\r\n•\\tA tour of the school\\r\n•\\tA written test \\r\n•\\tPresentation and discussion with a group of students \\r\n•\\tFormal Interview  \\r\n\\r\nThe University of Reading will also be involved with the selection process to ensure applicants can meet the academic requirements of the course.\\r\n",
    "OtherRequirements": "Before you commence training you will need to:\\r\n* pass the Professional skills tests both in literacy and numeracy.\\r\n* receive a satisfactory medical report and meet the standards for 'Fitness to Teach'\\r\n* complete a Disclosure and Barring Service (DBS) Enhanced level check.\\r\n* have completed any subject knowledge requirements\\r\n",
    "PersonalQualities": "We are looking for potential teachers with a passion for their subject, a desire to immerse themselves in the school community and to take responsibility for their professional growth and development.  \\r\nThe ability to relate to and motivate young people is essential. Their enthusiasm and depth of knowledge for their subject should be apparent as should their keenness to share this with pupils.  \\r\nWe are looking for highly motivated, enthusiastic individuals, who set their own high standards, work well as part of a team, are able to reflect on their own learning and set appropriate targets for their own development. \\r\n",
    "HowSchoolPlacementsWork": "Our partnership schools include:\\r\nThe Brakenhale School RG12 7BA\\r\nCharters School SL5 9QY\\r\nEasthampstead Park Community School RG12 8FS\\r\nEdgbarrow School RG45 7HZ\\r\nGarth Hill College RG12 2AD\\r\nRanelagh CE School RG12 9DA\\r\nSandhurst School GU47 0SD\\r\n\\r\nSuccessful applicants will be allocated to schools after interview, so we can best match trainees to schools. Geographical preference will be taken into account where possible.\\r\n\\r\nSchool Direct is a personalised route to qualified teacher status and your initial teaching responsibilities will be influenced by prior experience, however you can be sure you will have a structured introduction into teaching and can expect to build up your teaching gradually.\\r\n\\r\nDuring the first half of the autumn term you will observe lessons, work with small groups and teach with another teacher in your subject, using their lesson plans. Gradually as the term goes on you will have the chance to develop your own lesson plans and will take on more teaching with the focus being on shared teaching. In the first half of the term you will spend two days a week at the University, building knowledge relating to teaching your subject area.\\r\n\\r\nIn the Spring term you will spend two separate weeks at the university in January and February. After the first week you will start a second school placement in another school in the partnership. The focus moves to guided teaching and you will work towards teaching 50% of the week. \\r\n\\r\nAfter the Easter break leading up to the summer half term (May) you will have an extended period of teaching, during which you should expect to become increasingly independent in taking responsibility for teaching and learning. For your final half term of training, if you have already demonstrated that you are meeting the requirements of the Teaching Standards, you will have the opportunity to gain additional experience beyond your normal teaching timetable. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "You will have the opportunity to receive invaluable ‘on the job’ experience in school with the Bracknell Forest School Partnership. This consists of seven co-educational secondary schools with sixth forms, a pupil referral unit and a special school all part of the small friendly and successful local authority of Bracknell Forest, Berkshire.\\r\n\\r\nThis training programme is a one-year school based full-time route into teaching leading to the award of Qualified Teacher Status or a Postgraduate Certificate in Education and credits towards a Masters degree.\\r\n\\r\nOne school will be your host school, but more importantly you will be part of a wider community of trainee teachers across all the partnership schools.  Your training will be carried out in conjunction with University of Reading.\\r\n\\r\nThe aim of all involved in the partnership is to train excellent practitioners who have a positive impact on the learning of pupils.  You will take ownership of your development during your first year and establish the skills to allow you to reflect on your own learning to enable you to continuously improve during the training year and throughout your career.\\r\n\\r\nBracknell Forest is renowned for being a small, friendly and very effective local authority. New teachers often tell us how easy it is to settle in our schools and how valuable the networking opportunities are. There is a real sense of community amongst our teachers.\\r\n\\r\nAfter the course you will be in an ideal situation to apply for suitable vacancies in any of the partnership schools .\\r\n",
    "TrainWithDisability": "Disability access varies from school to school. If you have any specific concerns about access please contact us at teacher.recruitment@bracknell-forest.gov.uk  as early as possible in the application process.  If your application is shortlisted we will make adjustments to ensure you can attend and participate fully in the interview process and, if successful at interview, place you in the most suitable school with training places.\\r\n\\r\nThe University of Reading's London Road campus is a compact and level campus. Most teaching buildings are accessible for wheelchair users, although some older buildings have limited access.  They are continually improving access to buildings and operate a central room booking system so that lectures are timetabled in accessible rooms .\\r\n\\r\nAll University buildings are accessible by car and most have disabled parking spaces nearby.\\r\n\\r\nStudents with mobility difficulties may apply for a permit to park on campus, for which there is a small annual charge. Permits for Blue Badge holders are free.\\r\n\\r\nThere are buses into town from campuses with around 50% of the Reading buses having low floors.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The Institute of Education at the University of Reading focuses on training you to excel in your teaching career, not just to simply pass the course.\\r\n\\r\nThe University is ranked in the top ten in the UK for Education (The Guardian University League Table 2019) and have been consistently for over a decade.\\r\n\\r\nThe IoE is located on the historic London Road campus. It is vibrant, exciting and centrally placed in an elegant but renovated site to suit a modern educational environment.\\r\n\\r\nThe University holds regular Information Evenings where you can meet the Partnership and discuss your training requirements.\\r\n",
        "UcasInstitutionCode": "R12"
      }
    ]
  },
  "has_inst": true
}
