{
  "locationType": "University",
  "accrediting": null,
  "provider": "Sheffield Hallam University",
  "subjects": [
    "Citizenship",
    "Secondary"
  ],
  "name": "Citizenship",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "S21/L9X1",
  "providerCode": "S21",
  "programmeCode": "L9X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "S21",
    "addr_1": "City Campus",
    "addr_2": "Pond Street",
    "addr_3": "Sheffield",
    "addr_4": null,
    "postcode": "S1 1WB  ",
    "url": "http://www.shu.ac.uk",
    "geocode": true,
    "formatted_address": "City Campus, Howard St, Sheffield S1 1WB, UK",
    "latitude": 53.37958769999999,
    "longitude": -1.4651842,
    "post_code": "S1 1WB",
    "city": "South Yorkshire",
    "route": "Howard Street",
    "postal_town": "Sheffield"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "- Undertake school-based training in two different school settings.\\r\n- Learn to plan and teach Citizenship across Key Stages 3 and 4 in active, creative ways needed to motivate pupils.\\r\n- Gain knowledge of schools and the education system.\\r\n- Participate in a field trip to explore approaches to teaching outside the classroom.\\r\n\\r\nThis course is professional and vocational in nature and has, as its primary aim, the development and supply of competent teachers who will be capable of securing employment in an education setting. Over 96% per cent of our PGCE graduates are teaching or in further study within six months of graduating.\\r\n\\r\n\\r\nThis course provides a flexible framework to support your academic and professional development through a range of school-based training and university-based sessions. Throughout the course you will be encouraged to critically reflect on your progress, and academic and professional review tutorials will be used to support your development.\\r\n\\r\nYou learn through\\r\n\\r\n- seminars and lectures\\r\n- workshops\\r\n- directed tasks\\r\n- professional studies tasks\\r\n- school-based experiences\\r\n- independent study\\r\n- discussions\\r\n- group work\\r\n- practical work\\r\n- written assessments and feedback\\r\n- subject training days\\r\n- classes on subjects in the humanities to prepare for a wider range of teaching",
    "CourseLength": "OneYear",
    "FeeInternational": 13500.0,
    "InterviewProcess": "If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\\r\n\\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\\r\n\\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\\r\n\\r\n",
    "HowSchoolPlacementsWork": "School-based training in educational settings is the main method by which you develop your professional skills. You will gain at least 120 days of school-based experience in two different settings.\\r\n\\r\nYou will use a range of methods to develop your skills, which could include observation, collaborative planning and actual practice in the classroom.\\r\n\\r\nSheffield Hallam moderates progress against the Teachers' Standards with school visits, including joint lesson observations with your school-based mentor and a review of evidence of progress."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Sheffield Hallam University is one of the UK's largest universities, based in the heart of Sheffield, one of the UK’s biggest student cities.\\r\n\\r\nSheffield is the fifth biggest city in the UK with over 60,000 students, it has a mix of culture and green spaces. \\r\n\\r\nWe have invested over £100 million in new buildings and facilities over the last five years, providing innovative, flexible and sustainable spaces to enhance student experience.\\r\n\\r\nWe pride ourselves on the applied nature of our courses. We offer one of the largest and most diverse\\r\nrange of placements in the region. We’ve built up a network of over 600 partner schools, colleges and other educational establishments, and we work together to our mutual advantage.\\r\n\\t\\r\nYou will study at our centre of education that is recognised for excellence and innovation in teaching and learning. Our academics, researchers and partners in schools work together to ensure you become a committed and professional graduate, with the opportunity to return to us throughout your career to further your professional development.\\r\n\\t\\r\nWe received an overall student satisfaction rating of 86% in the 2018 National Student Survey. This result places us in the top 30 universities in the country for student satisfaction. We also received a Silver rating in the 2017 Teaching Excellence Framework. \\r\n",
    "TrainWithDisability": "If you have a disability, including long term medical conditions, specific learning difficulties (such as dyslexia, dyspraxia and A(D)HD) and mental health conditions, you can access additional support for your academic studies whilst at Sheffield Hallam.\\r\n\\r\nStudents can receive support for a wide variety of conditions. There is extensive support available, including\\r\n\\r\n•\\tLearning contracts- reasonable adjustments to your course such as extensions or extra time in exams\\r\n\\r\n•\\tSupport workers - like a mentor to help with organisation, or a personal assistant to help with mobility\\r\n\\r\n•\\tEquipment/Assistive Technology and software - such as digital recorders or text to speech software\\r\n\\r\nWe have an on-site assessment Centre, the Sheffield Regional Assessment Centre, where a range of disability specialists can carry out Study Needs Assessments.\\r\n\\r\nWe run daily drop in sessions - come and talk to us, no appointment needed. You can also register for support online.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
