{
  "locationType": "School",
  "accrediting": "University of Derby",
  "provider": "Derby Teaching Schools Alliance (DTSA Primary)",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1Z4/2KT2",
  "providerCode": "1Z4",
  "programmeCode": "2KT2",
  "schools": [
    {
      "name": "Main Site",
      "address": "Parkway, Chellaston, Derby, Derbyshire, DE73 5NY",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Parkway, Chellaston, Derby, Derbyshire, DE73 5NY",
      "geocode": true,
      "formatted_address": "Parkway, Derby DE73 5NY, UK",
      "latitude": 52.8693174,
      "longitude": -1.4458606,
      "post_code": "DE73 5NY",
      "city": "Derby",
      "route": "Parkway",
      "postal_town": "Derby"
    }
  ],
  "providerAddress": {
    "inst_code": "1Z4",
    "addr_1": "Chellaton Academy",
    "addr_2": "Swarkeston Road",
    "addr_3": "Derby",
    "addr_4": "Derbyshire",
    "postcode": "DE73 5UB",
    "url": "http://www.dtsa.org.uk",
    "geocode": true,
    "formatted_address": "Chellaston Academy, Swarkestone Rd, Derby, United Kingdom",
    "latitude": 52.8663991,
    "longitude": -1.4396277,
    "post_code": null,
    "city": null,
    "route": "Swarkestone Road",
    "postal_town": "Derby"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "We are currently offering Primary Schools Direct places.\\r\n For successful applicants DTSA will allocate a place in a school that best meets your needs.\\r\nBenefits include:\\r\n•\\tThe possibility of beginning your teaching career in a school where career progression through ITT, as a Newly Qualified Teacher (NQT) and a Recently Qualified Teacher (RQT) are well-developed, offering you the opportunity to study for a masters qualification on an established route\\r\n•\\tWell-developed links between schools across the Alliance from all phases allowing you to experience a range of Key stages; Special School experience and Early Years’ experience\\r\n•\\tLocal professionally facilitated networking with other DTSA School Direct students; access to a range of local curriculum forums and links with Newly Qualified Teachers training and events\\r\nDTSA will ensure that each student is allocated an excellent mentor in their host school. Mentors attend regular network meetings to ensure they keep their skills up to date and for them to share good practice. Your relationship with your mentor is key and DTSA will carefully monitor the quality of mentoring including taking feedback from students on the programme. All students will also be allocated a University Link Tutor who will work closely with you and your mentor.\\r\nPlease note that when applying to DTSA School Direct, you are not applying to work at a specific school, your individual training experience will lead to you being deployed in the schools which the Alliance feels will offer you the best possible opportunities to complete your training successfully.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "•Honours degree: a 2.1 or above UK undergraduate degree or a recognized equivalent qualification. (2:2 is accepted with relevant experience).\\r\n•A GCSE grade C or above in English Science and Mathematics or a recognized equivalent qualification\\r\n•Passed the national English and Maths Skills Tests by Monday 3rd June 2019\\r\n•\\tA reference submitted with your application\\r\nAll places offered are contingent on successful applicants also meeting the ‘suitability’ (DBS) and ‘fitness to teach’ (mental and physical health) requirements.\\r\nIf you studied outside of the UK, you should visit the National Academic Recognition Centre (NARIC) website for a statement of Comparison.",
    "InterviewProcess": "Below you will find a detailed programme explaining what will happen on the interview day.\\r\n\\r\nCandidates arrive and receive PowerPoint presentation about the course\\r\nBasic Skills Test in Numeracy and Literacy\\r\nGroup interview \\t\\r\nCandidates deliver child activity (teaching)\\r\nOne to One Interview\\r\n Candidates do mini discussion/admin/test feedback\\r\n\\r\nChildren activity: To prepare and deliver a 20min activity of your choice for x6 Year 3 and Year 4 children that will motivate discussion and develop speaking, listening and literacy skills.\\r\n\\r\nPlease note you will be required to provide a lesson plan\\r\n",
    "PersonalQualities": "We are looking for individuals who can demonstrate potential and show strong commitment, be ambitious, passionate and enthusiastic about teaching\\r\nYou must have the following:\\r\n•\\tA desire to teach and work with young people\\r\n•\\tEffective communication skills\\r\n•\\tA commitment to work hard on the course\\r\n•\\tDetermination to succeed\\r\n•\\tA readiness to listen and share\\r\n•\\tA flexible approach to learning and teaching\\r\n",
    "HowSchoolPlacementsWork": "Please note that when applying to DTSA School Direct, you are not applying to work at a specific school, your individual training experience will lead to you being deployed in the schools which the Alliance feels will offer you the best possible opportunities to complete your training successfully."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Derby Teaching School Alliance is offering Primary School Direct places from September 2019. We are working in partnership with The University of Derby for primary placements to deliver high quality training for all students. Successful completion of the programme will lead to the award of qualified teacher status (QTS) and our programme also includes a postgraduate certificate in education (PGCE) awarded by the University of Derby",
    "TrainWithDisability": "Our facilities provide full disabled access as do many of the schools in the \\r\npartnership. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the appropriate schools.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "What will you study\\r\nLevel 7\\tUnderstanding the Child as a Learner: 20 credits\\t\\r\n\\r\nUnderstanding the School as a Learning Community: 20 credits\\r\n\\tSpecialist Subject Enhancement: 20 credits\\r\n\\r\nLevel 6\\tAn Introduction to Reflective Teaching: 20 credits\\tReflective Practice in Action: 20 credits\\r\n\\tEffective Learning & Teaching English & Mathematics with ICT: 20 credits\\r\n\\tEffective Learning & Teaching in Science & the Wider Curriculum: 20 credits\\r\n",
        "UcasInstitutionCode": "D39"
      }
    ]
  },
  "has_inst": true
}
