{
  "locationType": "School",
  "accrediting": "George Abbot SCITT",
  "provider": "George Abbot SCITT (School Direct)",
  "subjects": [
    "Art / art & design",
    "Secondary"
  ],
  "name": "Art and Design",
  "slug": "1OV/2P6D",
  "providerCode": "1OV",
  "programmeCode": "2P6D",
  "schools": [
    {
      "name": "Main Site",
      "address": "Woodruff Avenue, Guildford, GU1 1XX",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Woodruff Avenue, Guildford, GU1 1XX",
      "geocode": true,
      "formatted_address": "Woodruff Ave, Guildford GU1 1XX, UK",
      "latitude": 51.2543997,
      "longitude": -0.5468097,
      "post_code": "GU1 1XX",
      "city": "Surrey",
      "route": "Woodruff Avenue",
      "postal_town": "Guildford"
    }
  ],
  "providerAddress": {
    "inst_code": "1OV",
    "addr_1": "George Abbot SCITT",
    "addr_2": "George Abbot School",
    "addr_3": "Woodruff Avenue",
    "addr_4": "Guildford",
    "postcode": "GU1 1XX ",
    "url": "http://www.georgeabbottraining.co.uk",
    "geocode": true,
    "formatted_address": "Woodruff Ave, Guildford GU1 1XX, UK",
    "latitude": 51.2524787,
    "longitude": -0.5453281999999999,
    "post_code": "GU1 1XX",
    "city": "Surrey",
    "route": "Woodruff Avenue",
    "postal_town": "Guildford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "The fee is £8250 for those following the Qualified Teacher Status (QTS) only programme.\\r\n\\r\nThe fee is £9000 for those following the PGCE programme whereby a PGCE qualification will be gained as well as Qualified Teacher Status.  \\r\n\\r\n[For information about tuition fees loans, click here](https://www.ucas.com/finance/undergraduate-tuition-fees-and-student-loans)\\r\n",
    "AboutCourse": "This programme will equip trainees to teach Art & Design to students aged 11 to 16 but may give experience of Key Stage 5 (A level) teaching.\\r\n\\r\nThis is a school based training programme, spending 4 days a week in school completing 'on the job' training.  One day a week will be classroom based where more in depth studies can be made into pedagogy and covering a variety of topics including behaviour management, lesson planning, assessment for learning etc.\\r\n\\r\nTrainees can opt for the QTS only programme or the PGCE programme which requires assignments to be written at Masters level.  These assignments are more research-based whereas the QTS assessments are more reflective, basing your work on your own classroom practice.\\r\n\\r\nOur PGCE is accredited by Kingston University but there is no need to visit Kingston, as you will have access to all the online resources and assessors will visit trainees to introduce assignments.\\r\n\\r\nGeorge Abbot SCITT has 100% employment records for trainees following the end of the programme.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "*An undergraduate degree with honours at 2:2 or above (or equivalent) related to your chosen subject\\r\n*A standard equivalent to level 4/grade C in English Language and Mathematics GCSE (or equivalent)\\r\n\\r\nThese qualifications must have been awarded by the start of the training programme.\\r\n",
    "FinancialSupport": "Exceptional candidates identified at interview may be offered a scholarship which includes a £2000 reduction in fees as well as entry onto a middle management leadership course.  \\r\n\\r\nMore information including qualifying criteria regarding our scholarships can be found in our information pack.  \\r\n\\r\nTo request an information pack, please email: contactscitt@georgeabbot.surrey.sch.uk\\r\n",
    "InterviewProcess": "We operate a one-day interview process comprising of:\\r\n\\r\n*face to face interview\\r\n*teaching activity with a group of students\\r\n*group activity\\r\n*written subject specific paper designed to test your knowledge of the syllabus\\r\n\\r\n[More information on what we are looking for from candidates can be found here.](http://www.georgeabbottraining.co.uk/what-we-are-looking-for/)\\r\n",
    "OtherRequirements": "All offers made will be subject to:\\r\n\\r\n*the candidate passing both the numeracy and literacy skills tests by the start of the training programme\\r\n*receipt of a satisfactory enhanced Disclosure and Barring Service (DBS) check\\r\n\\r\nFor all candidates:  please note we require sight of original GCSE, A level and degree certificates at interview.  For those who have studied overseas we also require sight of any original NARIC documentation.\\r\n",
    "PersonalQualities": "[For information on the personal qualities that we are looking for from candidates, please click here.](http://www.georgeabbottraining.co.uk/personal-skills-and-qualities/)",
    "HowSchoolPlacementsWork": "Successful candidates will be placed in a main placement school for two and a half terms.  All trainees have a mentor within their department for support.  The focus will be on teaching students from age 11 to 16.\\r\n\\r\nWhen selecting a main placement school, we take into consideration the following:  \\r\n\\r\n*which of our partner schools would like a trainee in the subject\\r\n*the ability of our partner schools to support a trainee based on the trainee's strengths and weaknesses\\r\n*distance between the trainee's home and the placement school\\r\n*any links that trainees may have with schools\\r\n\\r\nThe placement school selection is usually done in conjunction with the trainee and is not confirmed until a visit has taken place by the potential trainee to the suggested school.\\r\n\\r\nA second, minor placement will take place in the first half of the Spring term in a contrasting school to the main placement school.  Again, all trainees have a departmental mentor for assistance.\\r\n\\r\nTrainees are expected to be in their placement school before the school day begins and to stay for some time after school to attend necessary meetings etc.\\r\n\\r\nOn Wednesdays all trainees will come together for Professional Studies sessions - these mainly take place at George Abbot School but could take place in any of our partner schools.\\r\n\\r\nAll candidates will also spend one week in an SEN setting as well as occasional days in other settings, with advance notice given.\\r\n\\r\nFor further information, request an information pack via contactscitt@georgeabbot.surrey.sch.uk\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "George Abbot SCITT is a highly respected and well-established provider delivering school-based Initial Teacher Training (ITT) through Teach Surrey.  Teach Surrey represents an alliance of Teaching Schools and their associated partner schools. \\r\n\\r\nWe offer Primary and Secondary teacher training on a full-time basis, all with a core focus on training all teachers to teach all children, and this includes offering trainees the option to specialise in Special Educational Needs (SEN).\\r\n\\r\nWith 17 years’ experience leading ITT, we offer practical training in a variety of schools, with experienced practitioners to mentor you through the course.  We have unrivalled experience in Surrey having trained over 500 teachers, and our provision across the partnership is rated as “Outstanding” by Ofsted, as well as by our past trainees.  \\r\n\\r\nWe are small enough to really get to know our trainees and to be able to tailor our training to meet the needs of everyone on our programme.  We are also proud to say that we have a 100% employment record at the end of our training programmes.\\r\n\\r\nGeorge Abbot SCITT has always led the way in teacher training and we work very closely with the DfE. In 2012, we were the first ITT provider in the UK to pilot the School Direct ITT programme. In 2013, alongside an educational charity, we created an entirely new route into teaching for candidates with PhDs, called Researchers in Schools. We were also selected to pilot a 2 year, part-time school-based training route for shortage subjects in September 2016.\\r\n",
    "TrainWithDisability": "George Abbot SCITT has trained teachers with a variety of individual needs.  We are able to adjust our programme accordingly.\\r\n\\r\nShould you be invited to interview, you will be asked to disclose any needs you may have so that we can support you appropriately.\\r\n\\r\nIf you would like to discuss how we could support you during training with your needs, please do get in touch on 01483 888048.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Please see information above.",
        "UcasInstitutionCode": "G12"
      }
    ]
  },
  "has_inst": true
}
