{
  "locationType": "School",
  "accrediting": "Leeds Trinity University",
  "provider": "Ilkley All Saints’ Teacher Training Partnership",
  "subjects": [
    "Primary"
  ],
  "name": "Primary (3-7)",
  "slug": "2DX/2Z79",
  "providerCode": "2DX",
  "programmeCode": "2Z79",
  "schools": [
    {
      "name": "Main Site",
      "address": "Easby Drive, Ilkley, LS29 9BE",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Easby Drive, Ilkley, LS29 9BE",
      "geocode": true,
      "formatted_address": "Easby Dr, Ilkley LS29 9BE, UK",
      "latitude": 53.9271146,
      "longitude": -1.8351148,
      "post_code": "LS29 9BE",
      "city": "West Yorkshire",
      "route": "Easby Drive",
      "postal_town": "Ilkley"
    }
  ],
  "providerAddress": {
    "inst_code": "2DX",
    "addr_1": "Easby Drive",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Ilkley",
    "postcode": "LS29 9BE",
    "url": "http://www.allsaintsilkley.bradford.sch.uk/",
    "geocode": true,
    "formatted_address": "Easby Dr, Ilkley LS29 9AZ, UK",
    "latitude": 53.9264328,
    "longitude": -1.835227,
    "post_code": "LS29 9AZ",
    "city": "West Yorkshire",
    "route": "Easby Drive",
    "postal_town": "Ilkley"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "We provide unique teacher training opportunities in a supportive and forward-thinking environment. The teachers in our partnership are outstanding practitioners who share a desire to be at the forefront of curriculum innovation, making learning topical, purposeful and thought-provoking. We look forward to working with you, offering high-quality training, mentoring and coaching that will develop you as a teacher. Ilkley All Saints’ Primary School is a National Support School which demonstrates our commitment to teacher development.",
    "CourseLength": "OneYear",
    "Qualifications": "•\\tA degree in the subject area or a degree with a substantial portion relevant to National Curriculum programmes\\r\n•\\tGCSE English, Mathematics and Science at Grade C or above \\r\n(or equivalent, including equivalent test)\\r\n•\\tSuccessful competition of the Professional Skills test for literacy and numeracy prior to the course starting \\r\n",
    "PersonalQualities": "•\\tMeet the ‘national requirements\\r\n(Degree, GCSEs, DBS check, health clearance)\\r\n•\\tHave a good subject knowledge at degree level\\r\n•\\tHave some subject curriculum knowledge\\r\n•\\tHave a good understanding of what teachers do\\r\n•\\tOften have some experience of working with children\\r\n",
    "HowSchoolPlacementsWork": "We offer two Teacher Training programmes; PGCE Primary (3-7) and PGCE Primary (5-11). Both courses provide you with supported, school-based experiences, split into three teaching placements. Your first placement will be in a host school, followed by a second and third placement which will be in a home school. These placements will give you the training experiences and access to specialist support that will develop your confidence for the start of your teaching career. \\r\nDuring those weeks when you are not on placement, you will spend your time between Leeds Trinity University and the placement school. You will receive teaching from the university academic staff and training under the direction of the All Saints’ Primary School Teacher Training Partnership. Through our partnership, you will have access to specialist leaders who will contribute to your professional development. We have a range of professionals who can develop your skills and practice in specific areas, including: EYFS, Computing, SEND, Growth Mindsets and Assessment. In addition, you will supported by an experienced Lead Mentor and outstanding practitioners. \\r\nFor more information about our Schools Direct Teacher Training Partnership please visit:\\r\nallsaintsilkley.bradford.sch.uk/teacher-training\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We offer two Teacher Training programmes; PGCE Primary (3-7) and PGCE Primary (5-11). Both courses provide you with supported, school-based experiences, organised into three teaching placements. Your first placement will be in a host school, followed by a second and third placement which will be in a home school. These placements will give you the training experiences and access to specialist support that will develop your confidence for the start of your teaching career. \\r\nDuring those weeks when you are not on placement, you will spend your time between Leeds Trinity University and the placement school. You will receive teaching from the university academic staff and training under the direction of the All Saints’ Primary School Teacher Training Partnership. Through our partnership, you will have access to specialist leaders who will contribute to your professional development. We have a range of professionals who can develop your skills and practice in specific areas, including: EYFS, Computing, SEND, Growth Mindsets and Assessment. In addition, you will supported by an experienced Lead Mentor and outstanding practitioners. \\r\n",
    "TrainWithDisability": "We welcome applications from candidates with disabilities and other needs.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "L24"
      }
    ]
  },
  "has_inst": true
}
