{
  "locationType": "School",
  "accrediting": "The Manchester Metropolitan University",
  "provider": "Elmridge Primary School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "1V4/27YF",
  "providerCode": "1V4",
  "programmeCode": "27YF",
  "schools": [
    {
      "name": "Main Site",
      "address": "Wilton Drive, Halebarns, Wilton Drive Halebarns, Altrincham, WA15 0JF",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Wilton Drive, Halebarns, Wilton Drive Halebarns, Altrincham, WA15 0JF",
      "geocode": true,
      "formatted_address": "Wilton Dr, Hale Barns, Altrincham WA15 0JF, UK",
      "latitude": 53.36731839999999,
      "longitude": -2.3115567,
      "post_code": "WA15 0JF",
      "city": "Hale Barns",
      "route": "Wilton Drive",
      "postal_town": "Altrincham"
    }
  ],
  "providerAddress": {
    "inst_code": "1V4",
    "addr_1": "Wilton Drive",
    "addr_2": "Halebarns",
    "addr_3": "Wilton Drive Halebarns",
    "addr_4": "Altrincham",
    "postcode": "WA15 0JF",
    "url": "http://www.elmridge.trafford.sch.uk/",
    "geocode": true,
    "formatted_address": "Wilton Dr, Hale Barns, Altrincham WA15 0JF, UK",
    "latitude": 53.3673346,
    "longitude": -2.3124431,
    "post_code": "WA15 0JF",
    "city": "Hale Barns",
    "route": "Wilton Drive",
    "postal_town": "Altrincham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Our School Direct Training Programme is open to graduates and funded by tuition fees, further information is available here (https://getintoteaching.education.gov.uk/bursaries-and-funding) ",
    "AboutCourse": "This is a year-long school-based training programme that will lead to both a Postgraduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS).  It embodies a collaborative approach, enabling you to connect with experienced school-based professionals, whilst also receiving guidance from The Manchester Metropolitan University (MMU) education faculty and staff.  The training will be delivered jointly by MMU and by expert teachers from alliance schools.\\r\n\\r\nThis School Direct programme is a full-time, primary, unsalaried programme running from September to June.\\r\n\\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.  In order to achieve this, you will experience:\\r\n\\r\n* A main placement in a designated school\\r\n* A contrasting placement, from within the wider alliance\\r\n* A special education needs (SEN) placement, from within the wider alliance\\r\n* Classroom observations\\r\n* Working with individuals/small groups/and whole classes to teach lessons\\r\n* Assessment of pupil attainment and progress \\r\n* Lectures and online learning with an iPad on loan for 12 months\\r\n* Planning and delivery of blocked training sessions\\r\n* Professional development training sessions   \\r\n* Mentor sessions/support\\r\n* The wider school community\\r\n* Extra-curricular activities\\r\n\\r\n\\r\nElmridge Teaching School and its alliance partners have a wealth of strengths to offer you.  As well as each school having its own distinctive strengths, the alliance draws upon Specialist Leaders in Education to enhance your training experiences.  These unique school-based learning opportunities build upon the relationships between the alliance partners, the University and you.  \\r\n\\r\nThe Alliance’s commitment to you:\\r\n\\r\n* A nominated, experienced, school-based mentor\\r\n* Regular school-based mentor meetings that support, feedback and challenge your professional development\\r\n* Experience across the primary age range (5-11 years old)\\r\n* Experience in delivering school-based training sessions covering core and foundation subjects.  These include English, maths, science, IT, history, geography, music, art, PE, foreign languages and design technology.\\r\n* Enhanced educational theory sessions and practical advice on succeeding in the classroom.   These include behaviour management, mental health and wellbeing, assessment for learning and metacognition.\\r\n* Opportunities for you to tailor and influence your own professional development\\r\n\\r\n\\r\n\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "The entry requirements for School Direct are:\\r\n\\r\n* An honours degree to a minimum of a 2:2 classification \\r\n* At least 5 GCSEs grade A*- C, including the following, Maths, English, Science (Single or dual Physics, Chemistry or Biology).  We do not accept Adult Numeracy/Literacy/Key Skills as equivalents to GCSEs \\r\n* Pass professional skills tests in numeracy and literacy (http://sta.education.gov.uk/) \\r\n* Applicants who are due to graduate or have graduated within the last 3 years MUST have a University lecturer as their principal referee\\r\n",
    "InterviewProcess": "The Teaching School Alliance recruits and selects its own trainees, using the alliance’s skills and core values:\\r\n\\r\n* Teamwork \\t\\r\n* Commitment \\r\n* Problem Solving \\t\\r\n* Integrity \\r\n* Effective Communication skills\\t\\r\n* Nurturing \\r\n* Effective Time Management \\t\\r\n* Resilience \\r\n* Organisational Skills \\t\\r\n* Passion \\r\n* Adaptability \\t\\r\n* Hard Working\\r\n* Reflective\\t\\r\n* Motivation to Learn\\r\n* Effective Relationships \\t\\r\n* Open Minded\\r\n\\r\n\\r\nSuccessful applicants are invited to attend our interview process where candidates will continue to be assessed against the alliance’s skills and core values criteria.\\r\n\\r\nThe interview process includes a face-to-face interview and the opportunity to lead an activity with a group of children:\\r\n\\r\n* The face-to-face interview is led by 2 members of the teaching school alliance and lasts approximately 30 minutes.  The members of the teaching school alliance are usually senior leaders eg Headteacher, Deputy/Assistant Headteacher.\\r\n* The activity is observed by 2 members of the teaching school alliance and lasts approximately 20 minutes.  The members of the teaching school alliance are usually senior leaders eg Headteacher, Deputy/Assistant Headteacher.\\r\n\\r\n\\r\nAll prospective trainee teachers must pass the skills tests in numeracy and literacy before they can embark on this School Direct programme.  Prospective teachers are assessed on the core skills teachers need to fulfil their professional role in school, rather than the subject knowledge needed for teaching.  This is to ensure all teachers are competent in numeracy and literacy, regardless of their specialism.  Further details are available here (http://sta.education.gov.uk/)\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n",
    "OtherRequirements": "Elmridge Primary School and MMU are committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff, trainees and volunteers to share this commitment.  Trainee appointments will be subject to satisfactory clearances and checks including a Disclosure and Barring Service check, carried out by MMU acting as the admissions authority.",
    "PersonalQualities": "The Teaching School Alliance is looking for the following skills and core values in its future teachers:\\r\n\\r\n* Skills\\t\\r\n* Core Values\\r\n* Teamwork \\t\\r\n* Commitment \\r\n* Problem Solving \\t\\r\n* Integrity \\r\n* Effective Communication Skills\\t\\r\n* Nurturing \\r\n* Effective Time Management \\t\\r\n* Resilience \\r\n* Organisational Skills \\t\\r\n* Passion \\r\n* Adaptability \\t\\r\n* Hard Working\\r\n* Reflective\\t\\r\n* Motivation to Learn \\r\n* Effective Relationships \\t\\r\n* Open Minded\\r\n\\r\n\\r\nWe encourage you to provide evidence of these skills and core values in your personal statement and during the interview process.\\r\n",
    "HowSchoolPlacementsWork": "The Teaching School Alliance will place you into schools that will be most able to meet your specific needs.  You will be designated:\\r\n\\r\n* A 'main' school placement, lasting 21 weeks\\r\n* A ‘contrasting’ placement, lasting 10 weeks\\r\n* An SEN/inclusion placement, lasting 2 weeks\\r\n\\r\n\\r\nA statutory requirement of this School Direct programme is the need to have experienced teaching in both Key Stage 1 (Years 1 and 2) and Key Stage 2 (Years 3, 4, 5 and 6), therefore your main school placement and contrasting school placement will be based in different Key Stages.  \\r\nPlacements will take place in one of the following schools:\\r\n\\r\nAcre Hall Primary School (http://www.acrehall.trafford.sch.uk/)\\r\n\\r\nElmridge Primary School (http://www.elmridge.trafford.sch.uk/)\\r\n\\r\nGatley Primary School (https://www.gatleyprimary.com/)\\r\n\\r\nPark Road Sale Primary School (http://webfronter.com/trafford/parkroadsale/)\\r\n\\r\nThe Orchards (http://www.theorchards.trafford.sch.uk/) \\r\n\\r\nOn both of your main school and contrasting school placements you will be allocated:\\r\n\\r\n* A specific class within which you will teach\\r\n* Opportunities to observe across school\\r\n* A school-based mentor who will support you on placement\\r\n* A university tutor who will visit and support you on placement\\r\n* A representative from Elmridge Primary School to visit and support you on placement\\r\n\\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Elmridge Primary Teaching School Alliance (https://elmridgeteachingschool.co.uk/) is passionate about shaping the minds of the future.\\r\n\\r\nAs a Teaching School, Elmridge is at the forefront of school-led Initial Teacher Training and is uniquely placed to deliver innovative training opportunities.  One of the most empowering routes into teaching is the School Direct route.  It offers the opportunity to learn with and from a team of professionals in an inspirational and dedicated Teaching School Alliance.  Due to strong partnerships, working across an alliance of schools, Elmridge School Direct trainees have an outstanding record since its School Direct programme began in September 2014:\\r\n\\r\n* 100% employed in readiness for start of the new school year upon completion of the course\\r\n* 100% of trainees successfully completed the programme\\r\n* 89% graded as ‘Outstanding’\\r\n\\r\n\\r\nElmridge and its alliance partners, working together, have combined their expertise to continue to deliver the School Direct programme into 2019-20. This will be the alliance’s 6th year of delivering its very successful School Direct Programme.  The diverse representation of schools within the alliance offers a vast range of experiences giving trainees the opportunity to learn and excel.\\r\n\\r\n\\r\nThis School Direct programme is a full-time, primary, unsalaried programme running from September to June.\\r\n",
    "TrainWithDisability": "Teachers with disabilities make an important contribution to schools in both the classroom and in shaping the wider culture and ethos of the schools they work in.  Schools within the Elmridge Primary Teaching School Alliance value diversity and the unique contribution that all their staff and trainees make.  \\r\n\\r\nIf you have a disability please do not be dissuaded from applying.  Whilst it is a personal choice,  informing us of your disability has the advantage of enabling support and reasonable adjustments to be put in place.  We encourage you to contact us (https://elmridgeteachingschool.co.uk/contact-us/) to discuss how we can support you.\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "This is a year-long school-based training programme that will lead to both a Postgraduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS).  It embodies a collaborative approach, enabling you to connect with experienced school-based professionals, whilst also receiving guidance from The Manchester Metropolitan University (MMU) education faculty and staff.  The training will be delivered jointly by MMU and by expert teachers from alliance schools.",
        "UcasInstitutionCode": "M40"
      }
    ]
  },
  "has_inst": true
}
