{
  "locationType": "University",
  "accrediting": null,
  "provider": "King’s College London (University of London)",
  "subjects": [
    "Biology",
    "Science",
    "Secondary"
  ],
  "name": "Science: Biology",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "K60/C1X1",
  "providerCode": "K60",
  "programmeCode": "C1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Franklin-Wilkins Building, Waterloo Bridge Wing, Waterloo Road, London, SE1 9NN",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Franklin-Wilkins Building, Waterloo Bridge Wing, Waterloo Road, London, SE1 9NN",
      "geocode": true,
      "formatted_address": "Waterloo Rd, South Bank, London SE1, UK",
      "latitude": 51.502334,
      "longitude": -0.1100842,
      "post_code": "SE1",
      "city": "Greater London",
      "route": "Waterloo Road",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "K60",
    "addr_1": "King's Admissions Office",
    "addr_2": "James Clerk Maxwell Building",
    "addr_3": null,
    "addr_4": "London",
    "postcode": "SE1 8WA ",
    "url": "http://www.kcl.ac.uk",
    "geocode": true,
    "formatted_address": "57 Waterloo Rd, Lambeth, London SE1 8WA, UK",
    "latitude": 51.50486650000001,
    "longitude": -0.1126887,
    "post_code": "SE1 8WA",
    "city": "Greater London",
    "route": "Waterloo Road",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Science course is consistently graded as good in Ofsted inspections, and will lead to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of science education. They are a diverse and incredibly experienced community of academics with extensive school teaching and academic experience.\\r\n\\r\nTake part in activities designed to help you to plan your teaching effectively and imaginatively. Discover how to evaluate your skills, particularly in terms of the quality of learning achieved by pupils.\\r\n\\r\nYour teaching is through a series of practical seminars and workshops in purpose-built science laboratorieswhere interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\nobservation of other teachers\\r\n\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Experience: King’s has been training teachers for over 120 years and has developed a reputation for excellence in its training methods. The PGCE academics are qualified teachers themselves and are highly experienced in teacher training.\\r\n\\r\nReputation: King’s has developed a reputation for excellence in both training methods and the standards of new teachers we train. At the most recent Ofsted inspection King’s was graded 'Outstanding'.\\r\n\\r\nLocation: Based in the heart of London, King’s is surrounded by landmarks and cultural institutions that we incorporate into our training. Transport links are extensive as the campus is only minutes from Waterloo station.\\r\n\\r\nStudent satisfaction: Trainees value the effectiveness of their training in preparing them for their teaching career. 92% of graduates rated the quality of our training as very good or good in the 2018 student survey.\\r\n\\r\nEmployment prospects: 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. Many schools actively contact us to try and recruit our trainees during the academic year.\\r\n",
    "TrainWithDisability": "All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental health, but few health problems past or present preclude applicants from teaching. \\r\n\\r\nWe always welcome applications from people with disabilities. Candidates offered a place must complete a pre-commencement health declaration form. If this reveals a need, King's provides appropriate school placements, support and monitoring for the trainee during the course. If you have any questions about health, disability, or the support provided, please do not hesitate to contact us.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
