{
  "locationType": "School",
  "accrediting": "Ashton on Mersey School SCITT",
  "provider": "Ashton on Mersey School SCITT",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "24L/2KTC",
  "providerCode": "24L",
  "programmeCode": "2KTC",
  "schools": [
    {
      "name": "Main Site",
      "address": "Cecil Avenue, Sale, Cheshire, M33 5BP",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Cecil Avenue, Sale, Cheshire, M33 5BP",
      "geocode": true,
      "formatted_address": "Sale M33 5BP, UK",
      "latitude": 53.41944950000001,
      "longitude": -2.3389918,
      "post_code": "M33 5BP",
      "city": "Greater Manchester",
      "route": null,
      "postal_town": "Sale"
    }
  ],
  "providerAddress": {
    "inst_code": "24L",
    "addr_1": "Cecil Avenue",
    "addr_2": null,
    "addr_3": "Sale",
    "addr_4": "Cheshire",
    "postcode": "M33 5BP ",
    "url": "http://aomscitt.co.uk/",
    "geocode": true,
    "formatted_address": "Cecil Ave, Sale M33 5BG, UK",
    "latitude": 53.41904,
    "longitude": -2.338882,
    "post_code": "M33 5BG",
    "city": "Greater Manchester",
    "route": "Cecil Avenue",
    "postal_town": "Sale"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "The programme will consist of school-based training and centre-based training days. \\r\n\\r\nOur primary and secondary programmes will have four areas of learning: \\r\n* Centre Based Learning – centre based sessions delivered at Ashton on Mersey School or local partner school where relevant plus Manchester Metropolitan University for Masters Level study.\\r\n\\r\n* School Based Learning – learning at your placement schools.\\r\n\\r\n* Guided Learning – learning completed on an individual basis including subject knowledge audits (SKA) \\r\n* Enrichment Learning – personalising your programme to further explore areas of interest or need.\\r\n\\r\nIt is really important that these learning areas fit together to ensure a cohesive and progressive programme of study.  To ensure this is a success we have grouped the learning that trainee teachers will experience into five clear learning themes which are also linked to the Teachers’ Standards.\\r\n\\r\nThe learning themes will run through all of our learning areas and ensure the programme is integrated and structured across school-based, centre-based, guided and enrichment learning. This will also ensure that you can see a clear link between the different areas of learning and how these fit into your wider training programme.  \\r\n\\r\nOur Learning Themes are - \\r\n* Subject and Curriculum\\r\n* Classroom Management\\r\n*  Challenging and Engaging\\r\n*  Progressing and Assessing\\r\n*  Professional Practice\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "A UK Bachelor’s degree classification of 2:2 or above or an equivalent as judged against NARIC.\\r\n\\r\nAt least GCSE Grade C, or Grade 4, or above in the following subjects English Language, Mathematics and Science or GCSE equivalent\\r\n\\r\nThose applicants who do not hold a minimum of a Grade C or Grade 4 or above will need to apply to take an equivalency test. \\r\n\\r\nWe accept equivalency tests from:\\r\n(www.equivalencytesting.com)\\r\n",
    "InterviewProcess": "The Interview process will consist of 5 elements:\\r\n1.\\tFive minute presentation around the primary/secondary curriculum\\r\n\\r\n2.\\tPupil Activity – Working in small groups you will be asked to facilitate an activity\\r\n\\r\n3.\\tWritten task\\r\n\\r\n4.\\tFormal 1:1 Interview\\r\n\\r\n5.\\tICT Task\\r\n",
    "OtherRequirements": "Skills Test\\r\nAll applicants considering applying for a teacher training course will need to take the numeracy and literacy skills tests as part of the selection process. You must ensure you have passed them both before the start of the course.\\r\n\\r\nDisclosure and Barring Service\\r\nAll trainee teachers must be checked by the Disclosure and Barring Service (DBS) through the 'Disclosure' process and will be assessed for suitability by the SCITT.\\r\n\\r\n\\r\nHealth Clearance\\r\nAs an ITT provider, we need to be certain that applicants are likely to be fit, on completion of the course, for employment as a teacher.\\r\n\\r\n\\r\n\\r\n",
    "PersonalQualities": "We are looking to recruit talented candidates who have the qualities and attributes suited to a career in teaching and the drive and ambition to make it happen.\\r\n\\r\nAs well as meeting the entry requirements for the course we are also looking for the following personal qualities in applicants:\\r\n\\r\n\\r\n* A friendly and approachable nature\\r\n* Good interpersonal skills\\r\n* Organisation and time management\\r\n* A passion for your subject\\r\n* A positive outlook\\r\n* A creative and innovative approach\\r\n* The ability to reflect on and improve practice       \\r\n* Potential leadership capabilities\\r\n\\r\n\\r\n",
    "HowSchoolPlacementsWork": "School Based Learning - School Placements\\r\nYou will experience at least two contrasting placement schools throughout the year as well as some centre based learning being based in schools across the partnership and enrichment opportunities throughout the year. We currently work in partnership with over 50 schools across the North West. \\r\n\\r\n* Placement A – Autumn/Spring Term\\r\n* Placement B - Spring/Summer Term\\r\n\\r\nYour initial classroom based experience will consist of observations, team teaching with qualified teachers, collaborative teaching and intervention support for targeted groups of pupils with other trainee teachers to build up to whole class teaching (part / whole lessons). This will also include working with pupils on an individual, group and whole class level. \\r\n\\r\nSpecific school based learning tasks as outlined by the SCITT to link school and centre based learning should shape your professional development to link school and centre based learning.\\r\n\\r\nEach trainee will have one weekly mentor meeting a week and a minimum of one weekly formal observation by your mentor or class teacher.\\r\n\\r\nPaired Placement Model \\r\n\\r\nDuring one of your school placements we will try to ensure a paired placement model with at least one other trainee teacher from the Ashton on Mersey SCITT. When this is the case we encourage you to take advantage of this opportunity. When placed in a paired placement we would like you to try to arrange the following as part of your timetable\\r\n\\r\n*  An opportunity to plan lessons together which can then be team taught or taught individually to your own class or group. You could then review this lesson together and reflect on the strengths, areas for development and next steps. \\r\n\\r\n*  An opportunity once a week to formally observe each other teach and provide peer feedback – this could link to your Learning Log observation.\\r\n\\r\nWe believe that the best way to learn is from one another and that includes your fellow trainee teachers!\\r\n\\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The aim of Ashton on Mersey SCITT is to develop the teachers of tomorrow, those who will make a difference in the lives of the pupils they teach and to the colleagues they work with. The School is one of the only schools nationally to have been deemed outstanding by Ofsted five consecutive times. \\r\n\\r\nOur Ethos is\\r\nEvery trainee matters - our programme allows trainees to personalise learning through enrichment opportunities.\\r\nTeam of high quality partner schools, mentors and quality improvement leads working collaboratively on all elements of the programme.\\r\nHolistic course with school and centre based learning dovetailed through five clear learning themes linked to the Teachers’ Standards. \\r\nOutstanding practice to allow you to develop your full potential as a trainee.\\r\nSpecialist facilitators from partner schools deliver the centre based learning ensuring current educational practice is at the forefront of all learning.\\r\n\\r\nThe Ashton on Mersey SCITT Ofsted inspection noted;\\r\n\\r\n“Well-structured, cohesive and innovative training programmes enable trainees to gain the skills and knowledge to be successful teachers.”\\r\n\\r\n“Trainees and NQTs from this partnership share a number of notable characteristics. They are thoughtful, buoyant and enthusiastic.\"\\r\n\\r\n“Trainees are fulsome in their praise of the SCITT. NQTs echo these positive views time and time again.”\\r\n\\r\n“A highly effective, cohesive and ambitious leadership team accounts for the successful establishment of Ashton on Mersey SCITT. They share the same reflective qualities as the trainees they nurture. They seek out advice, listen to feedback and take immediate action to bring about positive change.”\\r\n\\r\n\\r\n",
    "TrainWithDisability": "If you have any special needs please contact us so that we can discuss your requirements and how these can be met. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the appropriate schools.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
