{
  "locationType": "University",
  "accrediting": null,
  "provider": "Roehampton University",
  "subjects": [
    "Primary"
  ],
  "name": "Primary (FS/KS1)",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "R48/X121",
  "providerCode": "R48",
  "programmeCode": "X121",
  "schools": [
    {
      "name": "Main Site",
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "geocode": true,
      "formatted_address": "Roehampton Ln, London SW15 5PU, UK",
      "latitude": 51.4579866,
      "longitude": -0.2432869,
      "post_code": "SW15 5PU",
      "city": "Greater London",
      "route": "Roehampton Lane",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "R48",
    "addr_1": "Roehampton Lane",
    "addr_2": "London",
    "addr_3": null,
    "addr_4": null,
    "postcode": "SW15 5PU",
    "url": "http://www.roehampton.ac.uk",
    "geocode": true,
    "formatted_address": "Roehampton Ln, London SW15 5LS, UK",
    "latitude": 51.4554361,
    "longitude": -0.2431242,
    "post_code": "SW15 5LS",
    "city": "Greater London",
    "route": "Roehampton Lane",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Our Post Graduate Certificate Education (PGCE) Primary - the Early Years pathway leads to the award of Qualified Teacher Status (QTS) giving you the experience, the opportunity and the knowledge to work in both Early Years Foundation Stage (EYFS) settings and Infant/Primary school settings.\\r\n\\r\nThe EYFS is a unique phase of education which involves learning through play and first hand experiences both inside and outdoors. This phase leads into Key Stage 1, when children really start to engage with learning to read, applying their mathematical knowledge and making sense of how the world works.\\r\n\\r\nChoose the Early Years pathway if you are interested in early learning and early child development. In choosing this pathway you will experience both the EYFS and Key Stage 1 phases and therefore be highly skilled in two curricula. If you are interested in the rewards and challenges of being an Early Years expert teacher choose this pathway.\\r\n\\r\nTutors are internationally or nationally renowned and their research regularly has a direct impact on school curricula and learning techniques, both in the UK and abroad. As experts in their field, their research also directly informs the focus and content of your course.\\r\n\\r\nLearning takes place through a series of lectures,, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) .  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics, English Language and a Science subject (or equivalent qualifications). \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nYou will have plenty of opportunities throughout your PGCE to apply your developing skills to real-life settings. We have strong partnerships with over 300 local schools and are renowned for our relationships with these partner schools.\\r\n\\r\nIt is a testament to the strength of our partnerships and the regard in which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education at Roehampton is one of the principal providers of teacher training in the UK, with partnerships with over 350 schools. We have a rich history of over 175 years providing teacher training education through our four Colleges. \\r\n\\r\nAs a student in our School, you will enjoy high quality teaching, which will equip you for a successful career with a competitive starting salary. Your employment prospects will be excellent: 99% of our teacher training graduates are in work or further study six months after leaving us (Destinations of Leavers of Higher Education 2013/14). \\r\n\\r\nWe are based on a beautiful parkland campus in south-west London, close to Putney and Hammersmith, and just 30 minutes from the West End. Our School is ranked third in London for the quality of our research in the field of education (Research Excellence Framework 2014), reflecting the work-class expertise of our staff.\\r\n\\r\nFor more information about the university, please see here.\\r\n\\r\n(https://www.roehampton.ac.uk/why-roehampton/)",
    "TrainWithDisability": "The University of Roehampton welcomes students with disabilities and offers flexible support services tailored to your needs. Our Disability and Dyslexia Services are on the main campus, Digby Stuart, along with our Access Centre: Access@SW15.\\r\n\\r\nFor new students, we strongly recommend that you get in touch to let us know about your specific disability and support needs. Any information provided will be kept strictly confidential and will only be used to support you with your studies. \\r\n\\r\nWe recommend to inform us of your specific learning difference (SpLDs) such as Dyslexia, Dyspraxia, Dyscalculia and Attention Deficit Hyperactivity Disorder (ADHD).\\r\n\\r\nFor more information please see our disability services website here.\\r\n\\r\n(https://www.roehampton.ac.uk/disability-services/)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
