{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Leicester",
  "subjects": [
    "English",
    "Secondary"
  ],
  "name": "English",
  "slug": "L34/QXXX",
  "providerCode": "L34",
  "programmeCode": "QXXX",
  "schools": [
    {
      "name": "Main Site",
      "address": "School of Education, 21 University Road, Leicester, LE1 7RF",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "School of Education, 21 University Road, Leicester, LE1 7RF",
      "geocode": true,
      "formatted_address": "21 University Rd, Leicester LE1 7RH, UK",
      "latitude": 52.6268992,
      "longitude": -1.1223128,
      "post_code": "LE1 7RH",
      "city": "Leicester",
      "route": "University Road",
      "postal_town": "Leicester"
    }
  ],
  "providerAddress": {
    "inst_code": "L34",
    "addr_1": "21 University Road",
    "addr_2": null,
    "addr_3": "Leicester",
    "addr_4": null,
    "postcode": "LE1 7RF ",
    "url": "http://www.le.ac.uk/pgce",
    "geocode": true,
    "formatted_address": "21 University Rd, Leicester LE1 7RH, UK",
    "latitude": 52.6268992,
    "longitude": -1.1223128,
    "post_code": "LE1 7RH",
    "city": "Leicester",
    "route": "University Road",
    "postal_town": "Leicester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Tuition fees for the 2019/20 academic year are yet to be confirmed.\\r\n\\r\nAs an indication of what you might pay, the fee for students who started in September 2018 was:\\r\n•\\t£9,250\\r\n\\r\nPGCE students can apply for loans from Student Finance England and may be entitled to a tax-free bursary -https://getintoteaching.education.gov.uk/funding-and-salary/overview\\r\n\\r\nFind out more about scholarships and funding on our website - https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts\\r\n\\r\n",
    "AboutCourse": "The PGCE English (M) and (H) level courses aim to prepare you to meet QTS Standards fully and to learn to teach the 11 - 19 English/Media curriculum with confidence, authority and enthusiasm. The course will ensure that, as a creative teacher, you can facilitate your own students' development as fully literate young adults who can understand, engage with and create a multiplicity of texts both within and beyond the classroom.\\r\n\\r\nYou will have taught sessions and in-school mentoring from some of the best practitioners in the field and learn how to become an effective practitioner yourself. The programme will cover all areas of the National Curriculum for English and also address preparation for public examinations across the 16 -19 age range and KS3 school-based assessments. \\r\n\\r\nThe course has a number of distinctive features. You will gain experience of writing poetry and composing a writing portfolio of a wide range of other texts in collaboration with others. You will take part in practical drama workshops and learn about teaching many aspects of Media and Film Studies. \\r\n\\r\nWe want you to:\\r\n•reflect critically on the English/Media curriculum and be inspired by the dynamic nature of your subject;\\r\n\\r\n•learn from examples of best practice and become effective practitioners yourselves;\\r\n\\r\n•be well supported by both university and school tutors and support each other in the development of subject knowledge and classroom expertise;\\r\n\\r\n•set high expectations for yourselves and your students;\\r\n\\r\n•develop an understanding of your professional roles within a department and whole school team; and\\r\n\\r\n•view the PGCE course as the beginning of your CPD. \\r\n\\r\nApplications are welcome from students with good/very good qualifications in their English qualifications at GCSE and AS/A level (or equivalent) and at honours degree level. Those students with joint or combined honours degrees in which English is a major subject are also welcome to apply. \\r\n\\r\nStudents with degrees in a range of academic backgrounds including American Studies, Classical Studies, History and Law have also made successful applications previously.  In all cases applicants are required to have an A level English Language or Literature or Lang/Lit qualification (or equivalent) and should be able to demonstrate a genuine interest in and enthusiasm for English at interview. \\r\n\\r\nApplicants without English as a major subject would be expected to undertake essential background reading before the start of the course and may need to undertake a Subject Knowledge Enhancement course prior to starting.  ",
    "CourseLength": "OneYear",
    "Qualifications": "•\\t2:1 degree for English, Geography, History or Social Science\\r\n•\\t2:2 degree for Mathematics, MFL, Sciences or RE\\r\n(We may, under exceptional circumstances, accept a Third if there are \\r\nother very strong recommending features in your application.)\\r\n\\r\n•\\tGCSE Grade 4 (old grade C) or above in English Language and Maths (equivalency test available if needed)\\r\n\\r\n•\\tA-levels (or equivalent) in relevant subjects\\r\n\\r\n•\\tAlthough not essential, you may find it useful to have recent experience working with children and/or observing teaching in a school setting.\\r\n\\r\n•\\tA pass in the Professional Skills Tests in literacy and numeracy\\r\n",
    "FeeInternational": 15405.0,
    "InterviewProcess": "If invited for interview, you will meet members of the course team who will give an overview of the course and answer any questions you may have. \\r\n\\r\nYou will participate in a group task with candidates from a range of subjects and give a brief presentation as part of a small group. \\r\n\\r\nSubject tutors will introduce a written subject task that you will complete during the day and you will have an individual interview with a subject tutor. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.",
    "OtherRequirements": "Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\\r\n\\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\\r\n\\r\nEnglish Language Requirements - you must have a GCSE Grade 4 (old grade C) in English Language. \\r\n\\r\n\\r\nWe offer an equivalency test in English and/or Mathematics for any successful applicant who does not hold this qualification or an equivalent one.  \\r\n",
    "PersonalQualities": "We strongly encourage all prospective students to spend time observing, and possibly  assisting, learners and teachers in secondary English classrooms in order to familiarise themselves with current developments.  We welcome applicants who have creative writing, drama, performance and media production skills which they wish to develop further for use in the classroom.  \\r\n\\r\nThe Secondary PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills also include the ability to form relationships,  good communication skills, a commitment to learning and teaching and reflective qualities. \\r\n\\r\n",
    "HowSchoolPlacementsWork": "You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with learners from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\\r\n\\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\\r\nPhase A.  In planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \\r\n\\r\nPhase A\\r\nAfter induction you will spend about 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you. \\r\n\\r\nPhase B\\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education has a long and successful history of teacher training and a strong reputation for producing graduate teachers prized by schools.\\r\n\\r\nThe School of Education is located in the heart of Leicester, identified in recent research as one of the most affordable study destinations in Britain. We are within five minutes’ walk of both the railway station and the main University of Leicester campus with its student support services and award-winning library.\\r\n\\r\nThe School of Education works in partnership with over 150 local schools. They represent an unusually varied and interesting range of institutions, including rural village schools, suburban and inner city schools and academies, and special schools. Many of the schools have a diverse, multi-ethnic population. Training to teach here provides the solid foundations to teach in a range of different contexts.\\r\n\\r\nWe are also a proactive partner with individual schools and alliances who offer the University of Leicester PGCE via the School Direct and SCITT training routes. Our close and collaborative relationship with partner schools ensures that, whichever training route they choose, University of Leicester PGCE students benefit from the same wide-ranging but consistently high quality experiences.\\r\n",
    "TrainWithDisability": "The School of Education's AccessAbility Tutor contacts all students who declare a disability to the University to advise about the support which they may be entitled. We ask students to tell us how their disability may affect their learning and any adjustments they need in order to access their studies. \\r\nThese requests, with students' permission, are passed on to the relevant tutors, lecturers and schools so that they can accommodate all student needs. \\r\nStudents can contact the School of Education's AccessAbility Tutor and the University's AccessAbility Centre for further advice or to report a problem. \\r\n\\r\nSome examples of how we support students with disabilities include:\\r\n\\r\n•\\tAccessible school placements provided for students with a physical disability.\\r\n•\\tTutors are sensitive to the needs of students with mental health difficulties. \\r\n•\\tSlide presentations and resources are available at least 24 hours before a session takes place. \\r\n•\\tThe AccessAbility Centre provides late appointments for PGCE students who are on placement and unable to attend during the day.\\r\n•\\tDisabled parking permits are provided to enable students with physical disabilities to park close to university buildings.\\r\n•\\tA variety of lesson planning templates is discussed with students to find one that is more accessible for those with dyslexia.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
