{
  "locationType": "School",
  "accrediting": "UCL, University College London (University of London",
  "provider": "Brent Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "25Z/2PNF",
  "providerCode": "25Z",
  "programmeCode": "2PNF",
  "schools": [
    {
      "name": "Main Site",
      "address": "Spencer Road, Wembley, Middlesex, HA0 3SF",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Spencer Road, Wembley, Middlesex, HA0 3SF",
      "geocode": true,
      "formatted_address": "Spencer Rd, Wembley HA0 3SF, UK",
      "latitude": 51.5691735,
      "longitude": -0.3125293,
      "post_code": "HA0 3SF",
      "city": "Greater London",
      "route": "Spencer Road",
      "postal_town": "Wembley"
    }
  ],
  "providerAddress": {
    "inst_code": "25Z",
    "addr_1": "Spencer Road",
    "addr_2": null,
    "addr_3": "Wembley",
    "addr_4": "Middlesex",
    "postcode": "HA0 3SF ",
    "url": "http://www.btsa.london",
    "geocode": true,
    "formatted_address": "Spencer Rd, Wembley HA0 3SF, UK",
    "latitude": 51.5693045,
    "longitude": -0.3116673,
    "post_code": "HA0 3SF",
    "city": "Greater London",
    "route": "Spencer Road",
    "postal_town": "Wembley"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "Primary Key stage 1 & 2\\r\nThe School Direct (Salaried) programme is an employment based route. For this programme students will spend the majority of the programme in school, employed as an unqualified teacher.\\r\n\\r\nThe BTSA offers a comprehensive training programme throughout the year to support your professional development. You will be assigned a mentor from the staff of your assigned school. Our mentors are outstanding teachers with a wealth of experience including but not limited to coaching, effective classroom observation and feedback skills. \\r\nYou will be in school from the first day of the school year so you will feel part of the team from day one. \\r\n\\r\nThe Salaried programme involves attending a programme of lectures and workshop at the UCL Institute for education for approximately 16 days during the Autumn and Spring terms. These sessions will engage with generic and subject specific areas and will encourage you to become a reflective teacher.  You will also be assigned a university tutor who will help to create your bespoke training programme as well as support your development as a teacher through tutorials, visits to school and guidance with assignments.  \\r\n\\r\nCompleting the course will lead to the award of QTS. \\r\n\\r\nAn additional PGCE pathway is also available which trainees can apply to join during the course.  This optional pathway continues into your NQT year and is not included as part of the main course.  This will be self-funded. \\r\n\\r\nThere are two compulsory school placements. The main placement will be hosted by one of the schools within the Brent Teaching School Alliance. The second, lasting 6 weeks will be within a contrasting Primary school and key stage, this will be organised by the BTSA. \\r\n\\r\nStudents are expected to complete the associated tasks, and to build a portfolio of evidence during the academic year to demonstrate they have met national teaching standards.\\r\n\\r\nStudents do not undertake academic credits on this programme. However, all components will need to be assessed to gain QTS.\\r\n\\r\nhttps://publish-teacher-training-courses.education.gov.uk/organisation/25z/course/u80/2pnf/about",
    "CourseLength": "OneYear",
    "SalaryDetails": "Student are paid on point 1 un-qualified scale \\r\n\\r\nSalary based on school year 2019/20 – Inner London rate – £21,541.32\\r\n\\r\nNo fees for this programme\\r\nUCL Institute of Education initial teacher training fees paid by the BTSA\\r\n\\r\n\\r\n",
    "Qualifications": "UCL requires a minimum of a 2:2 honours degree and GCSEs in English Language and Maths plus Science at grade C/5 or above. UCL does not accept ‘additional’ or ‘applied’ GCSE subjects. For equivalency testing UCL will only accept tests from www.equivalencytesting.com” \\r\nA minimum of a lower second-class UK Bachelor’s degree or an overseas qualification of an equivalent standard. \\r\n\\r\nApplicants must pass the Literacy and Numeracy Professional Skills Tests before training begins. ",
    "InterviewProcess": "The BTSA will coordinate the selection process. All applications will be checked to see if the applicant meets the entry criteria. Those who are shortlisted will be invited for an interview, which will involve a range of  activities to assess suitability for teaching. \\r\n\\r\n",
    "OtherRequirements": "You must have 3 years’ work experience in any field.  In addition, 2 weeks’ classroom experience is recommended.\\r\n\\r\nTeacher Training providers have a responsibility to ensure that trainees have the health and physical capacity to teach and will not put children at risk of harm. All applicants will be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks.\\r\n\\r\nIf you have lived, worked or travelled in another country for three months or longer in the last ten years, you will need to obtain a Certificate of Good Conduct from the relevant country/countries.\\r\n",
    "PersonalQualities": "We are looking for ambitious trainee teachers who demonstrate their passion and enthusiasm for teaching and have a desire to share this with young people. \\r\n\\r\nYou should be highly motivated, able to adapt and have the resilience to work well under pressure. Ideal candidates will be organised and demonstrate good inter-personal skills.\\r\n\\r\nTrainees should have the ability to reflect critically on their own practice and progress.\\r\n\\r\n",
    "HowSchoolPlacementsWork": "As a School Direct salaried trainee you will be employed by one of the Primary schools within the Brent Teaching School Alliance as an unqualified, trainee teacher. You will have a  full-time, one year contract.\\r\n\\r\nDuring your teaching practice you will be supported by an experience Class Mentor and Professional Coordinator Mentor.  You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. \\r\n\\r\nYou will have a well structured and supported introduction to teaching. A graduate approach to building up to a maximum of 80% of the timetable by the final term.\\r\n\\r\nYour placement school will provide a vast range of training activities, alongside the practical teaching experience. You will be assessed on your practical teaching and your progress in achieving the standards for Qualified Teacher Status by gathering evidence in the form of a portfolio and through observations.\\r\n\\r\nThe BTSA offers a comprehensive training programme for all School Direct salaried students to enhance their professional development. These courses are delivered across the schools within the Alliance,by outstanding practitioners. \\r\n\\r\nStudents must undertake a second school placement in a contrasting school in a different phase for  6 weeks in the Spring term – this will be arranged by the BTSA. You will then return to your host school until the end of the programme.\\r\n\\r\nStudents on the salaried route will not be given sole responsibility for a class.\\r\n\\r\nYour tutor from the UCL Institute of Education will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your Institute tutor will carry out your final assessment in school against the national Teachers’ Standards.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "If you want an interesting career where you can really make a difference to the lives of young people, train to be a teacher with the Brent Teaching School Alliance.\\r\n\\r\nThe Brent Teaching School Alliance (BTSA) is a strong partnership of primary and secondary schools working with the UCL Institute of Education to provide high quality teacher training among our mainly 'outstanding' establishments. Our vision is to train and develop the next generation of outstanding teachers. \\r\n\\r\nWe have been successful providers of initial teacher training for many years. The consortium of schools involved have a high level of expertise and strong commitment to delivering excellent quality training. We enable our student teachers to realise their full potential. A high percentage of our students gain full employment within their placement school or within the Alliance, once qualified. \\r\n\\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. Our teachers are excellent practitioners with exemplary behaviour management strategies and are eager to share their skills, knowledge and practice with the next generation of teachers. \\r\n\\r\nThe Brent Teaching School Alliance can provide a broad range of experiences and developmental opportunities within a multi-culturally diverse population, which enriches the experience of teaching within this unique community.\\r\n",
    "TrainWithDisability": "The BTSA is fully inclusive. \\r\nApplicants who would benefit from disabled access should let us know on their application form so that they can be considered for placements at the appropriate schools. \\r\n\\r\nTrainees with a disability or other needs will be offered additional  support with reasonable adjustments made to accommodate their individual circumstances.  \\r\n\\r\nSchool Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information here:- \\r\nhttps://www.ucl.ac.uk/students/disability-support\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "UCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in very criterion across Primary and Secondary Education.”\\r\n\\r\nAll UCL School Direct students have full access to UCL student support services and facilities\\r\n\\r\n\\r\nhttps://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes\\r\n",
        "UcasInstitutionCode": "U80"
      }
    ]
  },
  "has_inst": true
}
