{
  "locationType": "University",
  "accrediting": null,
  "provider": "Loughborough University",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "L79/26WV",
  "providerCode": "L79",
  "programmeCode": "26WV",
  "schools": [
    {
      "name": "Main Site",
      "address": "TEU Matthew Arnold, Loughborough University, Epinal Way, Loughborough, LE11 3TU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "TEU Matthew Arnold, Loughborough University, Epinal Way, Loughborough, LE11 3TU",
      "geocode": true,
      "formatted_address": "Epinal Way, Loughborough LE11 3TU, UK",
      "latitude": 52.769227,
      "longitude": -1.224632,
      "post_code": "LE11 3TU",
      "city": "Leicestershire",
      "route": "Epinal Way",
      "postal_town": "Loughborough"
    }
  ],
  "providerAddress": {
    "inst_code": "L79",
    "addr_1": "Loughborough University",
    "addr_2": null,
    "addr_3": "Loughborough",
    "addr_4": "Leicestershire",
    "postcode": "LE11 3TU",
    "url": "http://www.lboro.ac.uk",
    "geocode": true,
    "formatted_address": "Epinal Way, Loughborough LE11 3TU, UK",
    "latitude": 52.769227,
    "longitude": -1.224632,
    "post_code": "LE11 3TU",
    "city": "Leicestershire",
    "route": "Epinal Way",
    "postal_town": "Loughborough"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Travel\\r\n\\r\nThe vast majority of partnership schools are normally within 40 miles (one way) from the University. Due to the distance of many of our schools from Loughborough, we are reliant on trainees travelling to schools using public transport or their own cars to transport themselves (and others) to school.\\r\n\\r\nWe ask that car owners co-operate by transporting peers, and that passengers co-operate by being organised and ready to be picked up at the arranged time and at the agreed venue. Drivers should not have to wait for passengers. Passengers should expect to contribute to travel cost at the rate of 15 pence per mile and this payment should be organised between trainees. We also ask that trainees make every effort to reduce the number of cars travelling to any one school as car parking space is limited in many schools.",
    "AboutCourse": "The Loughborough PGCE course trains individuals to teach the 11-18 age range. It is formally registered with the Department for Education as an 11-16 QTS (Qualified Teacher Status) course with post-16 enhancement. In effect, this means that all individuals on the PGCE course will experience teaching the 11-16 curriculum as well as post-16, and will be qualified to take up teaching posts in all secondary schools covering the 11-18 age range.\\r\n\\r\nThe Loughborough PGCE has been designed by university staff and teachers from schools, and is intended to set you on the path to becoming a well informed and reflective professional. The heart of the course is the development of your teaching competences. The course lasts 36 weeks and will give you teaching experience in two different secondary schools. Two thirds of the course is spent in schools where you will have the support and guidance of experienced teachers. For the rest of the time, you will work in the university with tutors and teachers who prepare you for your school experience, and guide you in making the important links between the theoretical and practical components of the course.\\r\n\\r\nOur course will help you to:\\r\n\\r\n* learn how to teach and relate to young people in a variety of learning situations;\\r\n* develop the ability to plan sequences of lessons, and to teach and manage pupils effectively;\\r\n* gain the confidence and competence to undertake your full role as a teacher within a secondary school;\\r\n* develop sufficient knowledge and understanding of educational issues to be able to contribute effectively to the highest standards of teaching and learning, and to whole school improvement.\\r\n\\r\nAlongside teaching experience in schools, you will undertake two other elements within the course:\\r\n\\r\n1.Subject Methods courses in which you learn to teach your chosen subject (Physical Education or Mathematics).\\r\n2.General Professional Studies through which you come to understand the framework of the education system and how to contribute professionally to the wider role of the teacher responsible for the personal, social and health education of pupils.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "On entry, a relevant degree (i.e. one in which at least 50% is recognisable as Mathematics) or to have completed successfully a suitable Subject Knowledge Enhancement Course (to be discussed at interview).\\r\n\\r\nOn entry, a Mathematics A-level or equivalent, or evidence of equivalent study in the degree profile or elsewhere.\\r\n\\r\nOn entry, a Grade C (4 from 2017) or above in GCSE (or equivalent) English Language and mathematics.\\r\n\\r\nOn entry, passed Professional Skills tests in Literacy and Numeracy.\\r\n",
    "FeeInternational": 18500.0,
    "FinancialSupport": "PGCE students permanently resident in the United Kingdom (this excludes Wales, the Isle of Man and the Channel Islands) who are from households with an annual income of between £18,001 and £30,000 (including training bursary and income declared to Student Finance England) are eligible for a £500 Travel Bursary from Loughborough University.\\r\n\\r\nPGCE students permanently resident in the United Kingdom (this excludes the Isle of Man and the Channel Islands) who are from households with an annual income of £18,000 or less (including training bursary and income declared to Student Finance England) are eligible for a £3,000 Travel and Living Costs Bursary from Loughborough University.  Income declared to Student Finance England - generally described as 'household income' can be based on various figures depending on the trainee’s situation.\\r\n\\r\nLoughborough University awards a bursary of 10% of your tuition fees, set against tuition fees, to Loughborough University graduates commencing the PGCE course in the following subjects:\\r\n\\r\n* Maths\\r\n* Physical Education\\r\n\\r\nThis bursary payment will be in addition to other bursaries from the Department for Education, the Institute of Mathematics or Loughborough University which are associated with your specialist teaching subject, degree classification or income.\\r\n\\r\nTo be eligible for the Alumni Bursary of 10% of your tuition fees, you must have studied at and obtained a Bachelors degree from Loughborough University which qualifies you for entry to the PGCE course. You do not have to apply for the Alumni Bursary; it will be set against your tuition fees automatically on registration.",
    "InterviewProcess": "You will have one interview for the Provider led PGCE route.  Interviews will occur here at Loughborough University.  The panel will consist of PGCE university staff and teaching members of our partnership schools.\\r\n\\r\nFurther details will be sent to successful candidates.",
    "OtherRequirements": "On entry, recent experience of observing mathematics lessons in a state secondary school, at least 3 days.\\r\n\\r\nYou are required to satisfy this University that you are physically and mentally ‘fit to teach' before embarking on the course.\\r\n\\r\nYou are required to undergo an enhanced Disclosure and Barring Service (DBS) check to verify your suitability for working with young people.\\r\n",
    "PersonalQualities": "Awareness of, and sensitivity to others; a sense of responsibility; a balanced and positive outlook; open mindedness; enthusiasm; hard working; well organised; self-disciplined; adaptable; resilient; leadership.  Strong commitment to teaching mathematics and an enthusiasm for working with young people.",
    "HowSchoolPlacementsWork": "School experience is the heart of the course.  Prior to coming to the University, you will begin the course by spending time in a primary school close to where you are living.  Your primary school experience gives you the opportunity to understand the curriculum for 7-11 year olds, and how the basis of your teaching subject is built into the early years of schooling. You will assist in an experienced primary teacher's classroom, helping individual pupils and small groups to do the work set by the teacher, assisting with activities which suit your skills, and generally observing, assisting and analysing teachers and pupils.\\r\n\\r\nOnce you arrive at the University, you will concentrate on secondary schooling. In the first phase of the course (October to January), you will spend time in a secondary school working with experienced teachers. You will undertake a planned programme of observing and assisting experienced teachers designed to develop your confidence in working with pupils. You will spend the whole of the following ten weeks in that school on a block teaching practice, gradually increasing the amount of teaching you do as your skills and confidence grow.  You will then spend one week in a special school in order to learn more about meeting complex needs.\\r\n\\r\nIn the second phase of the course (February to June), you will follow a similar pattern but in a different secondary school. During this phase, you will undertake another teaching practice of eleven weeks. As during your first teaching practice, you will be given full support during your second practice and helped to develop and evaluate your own performance. In phase 2, you will gradually learn to experience the full responsibilities of a teacher.\\r\n\\r\nBoth of these long teaching practices will be in secondary schools which have signed a contract with the University to deliver teacher training as part of the Loughborough Initial Teacher Training Partnership.  These are known as Partnership schools.  We work with over 60 Partnership schools across 14 Local Authorities (LAs).\\r\n\\r\nThe vast majority of partnership schools are normally within 40 miles (one way) from the University."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Loughborough University has a strong tradition of teacher education and a history of successfully producing teachers who are in great demand by schools and colleges in the UK and overseas.\\r\n\\r\nOur courses have been highly rated in Ofsted inspections and Loughborough has been assessed as a category 'A' provider, representing 'outstanding' provision, three consecutive times since 2005.  Loughborough University is ranked 2nd in the top ten of higher education institutions in the 'Good Teacher Training Guide 2017' and has been ranked Top 10 for the past five years\\r\n\\r\nThe Loughborough Post-Graduate Certificate in Education course contributes towards half of a masters degree. Individuals wanting to complete the masters degree can do so on a part-time basis during their early teaching career.\\r\n\\r\nIf you are interested in training to teach Physical Education or Mathematics in secondary schools, you will find the information you need to get started on this site.\\r\n\\r\n",
    "TrainWithDisability": "The University encourages the development of an environment in which diversity is valued. An important part of putting this into practice is a commitment to prohibit discrimination on the grounds of disability in all employment matters, to increase employment opportunities for people who have a disability and to ensure that its recruitment and selection processes are fully accessible.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
