{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of East London",
  "subjects": [
    "French",
    "Italian",
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages (French with Italian)",
  "financial_support": "Student finance if you’re eligible",
  "slug": "E28/RX1C",
  "providerCode": "E28",
  "programmeCode": "RX1C",
  "schools": [
    {
      "name": "Main Site",
      "address": "Student Admissions Office, 4-6 University way, London, E16 2RD",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Student Admissions Office, 4-6 University way, London, E16 2RD",
      "geocode": true,
      "formatted_address": "4, East Building, 6 University Way, London E16, UK",
      "latitude": 51.5075163,
      "longitude": 0.0648165,
      "post_code": "E16",
      "city": "Greater London",
      "route": "University Way",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "E28",
    "addr_1": "Docklands Campus",
    "addr_2": "4-6 University Way",
    "addr_3": "Newham",
    "addr_4": "London",
    "postcode": "E16 2RD ",
    "url": "http://www.uel.ac.uk",
    "geocode": true,
    "formatted_address": "University Way, London E16 2RD, UK",
    "latitude": 51.5076024,
    "longitude": 0.0650809,
    "post_code": "E16 2RD",
    "city": "Greater London",
    "route": "University Way",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "This course leads to the award of Qualified Teacher Status (QTS) for the 11-to-16 age range, which qualifies you to be a teacher in secondary schools in England and Wales. Where possible, we also give you the chance to gain experience in the 11-to-18 age range.\\r\n\\r\nIt is of the utmost importance that all young people get the chance to learn at least one language to a high standard.\\r\n\\r\nThat’s why schools will always need highly-skilled language teachers to help pupils develop valuable, lifelong skills – and why trainee language teachers can benefit from the highest range of training bursaries.\\r\n\\r\nThe three most commonly taught languages in east London schools are French, German and Spanish, followed by Italian, Russian, Mandarin, Japanese, Urdu and Bengali. \\r\n\\r\nYour teacher training will help you discover how to open young people’s eyes and ears up to the beauty of the language by exploring its uses in business, everyday life and culture.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "*A minimum 2:2 degree or higher (although we will consider lower classifications from candidates with subject relevant alternative experiences);\\r\n*GCSE English Grade C/ Level 4 (or higher) or the equivalent of;\\r\n*GCSE Maths Grade C/ Level 4 (or higher) or the equivalent of.",
    "InterviewProcess": "You will be interviewed at UEL by the ML ITT course tutor, and where possible, a practising teacher from one of our partner schools. The interview will involve two tests - one that focuses on your literacy expertise and one that considers you subject knowledge. These tests are not pass/ fail in design, but simply enable us to ascertain the best ways of supporting these areas as you hopefully progress onto the programme. You are also asked to prepare a lesson plan for Year 7 pupils, which you will present during the interview. ",
    "PersonalQualities": "*Good interpersonal skills with young people and/or adults;\\r\n*Evidence of ability to respond to a challenge and overcome setbacks;\\r\n*Resilience and commitment;\\r\n*Evidence of knowledge of wider education issues and the ability to express and justify opinions and to consider those of others.",
    "HowSchoolPlacementsWork": "We work within a very large partnership of schools across London and also Essex, Hertfordshire, Kent and Surrey. We do not wish to disadvantage our trainees by asking them to travel a long distance to their placement schools. Generally, we look at one hour door to door as being the maximum travel time expected. You will be teaching all year groups in the 11-16 age range but we do provide 16-18 experience as well in many school placements. You will experience two, twelve week placements in two complementary schools. You will be supported in these schools by a school based mentor as well as your UEL tutor. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The University of East London is a highly experienced and successful initial teacher training (ITT) and education provider. Courses are taught and supported by exceptional and dynamic staff. All of whom foster creativity, collaboration, innovation and student engagement at the heart of what they offer. We also value the link between the academic and the practice, and this will form a significant part of the ITT programme you undertake.\\r\n\\r\nThis year, UEL has achieved its best ever student satisfaction score and we officially have  the happiest students of any modern university in London, according to recent NSS league tables. To complement this, our end of programme survey outcomes in July 2018, suggest that over 95% of our teacher trainees rate the quality of their training through UEL as good or higher. Employability is also excellent with most subjects, phases and routes achieving 95-100% employment each year. \\r\n\\r\nUEL is an inclusive university and our teacher training programmes are highly diverse and multicultural. We are very proud of our trainee teachers, new and old, and what they have gone on to achieve in our schools. We are especially proud of the community we serve and how we take people from the local community who then go back into this community to teach - over 70% of our trainees find jobs within our partner schools each year. \\r\n\\r\nWe look forward to welcoming you to UEL and the Cass School of Education and Communities.",
    "TrainWithDisability": "Applications from students with disabilities or other specific needs are welcomed. Initial teacher training programmes are based at our Stratford campus, which is fully accessible to all. UEL operates a very clear inclusivity policy. As a large provider of ITT, we have access to various support mechanisms for students who need this or would benefit from this additional support.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
