{
  "locationType": "School",
  "accrediting": "University of Sunderland",
  "provider": "West Park Partnership",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1DB/35JQ",
  "providerCode": "1DB",
  "programmeCode": "35JQ",
  "schools": [
    {
      "name": "Main Site",
      "address": "Alderman Leach Drive, Darlington, DL2 2GF",
      "code": "-"
    },
    {
      "name": "Catchgate Primary School",
      "address": "Blackett Street, Catchgate, Stanley, DH98LX",
      "code": "C"
    },
    {
      "name": "Hetton Primary School",
      "address": "Moorsley Road, Houghton - le - Spring, DH5 9ND",
      "code": "E"
    },
    {
      "name": "Broomley First",
      "address": "Main Road, Stocksfield, NE43 7NN",
      "code": "F"
    },
    {
      "name": "Red Hall Primary School",
      "address": "Headingley Crescent, Darlington, DL1 2ST",
      "code": "H"
    },
    {
      "name": "St Mary's RC Primary",
      "address": "Meadowside,, Sunderland, SR2 7QN",
      "code": "M"
    },
    {
      "name": "Norham St Ceowulfs",
      "address": "West Street, Berwick Upon Tweed, TD15 2JZ",
      "code": "N"
    },
    {
      "name": "Reid Street Primary School",
      "address": "Reid Street, Darlington, DL3 6EX",
      "code": "S"
    },
    {
      "name": "West Park Academy",
      "address": "Alderman Leach Drive, Darlington, DL2 2GF",
      "code": "W"
    }
  ],
  "addresses": [
    {
      "address": "Alderman Leach Drive, Darlington, DL2 2GF",
      "geocode": true,
      "formatted_address": "Alderman Leach Dr, Darlington DL2 2GL, UK",
      "latitude": 54.54711289999999,
      "longitude": -1.5865632,
      "post_code": "DL2 2GL",
      "city": "Darlington",
      "route": "Alderman Leach Drive",
      "postal_town": "Darlington"
    },
    {
      "address": "Blackett Street, Catchgate, Stanley, DH98LX",
      "geocode": true,
      "formatted_address": "Blackett St, Newcastle upon Tyne NE1 5BS, UK",
      "latitude": 54.9740596,
      "longitude": -1.614504,
      "post_code": "NE1 5BS",
      "city": "Tyne and Wear",
      "route": "Blackett Street",
      "postal_town": "Newcastle upon Tyne"
    },
    {
      "address": "Moorsley Road, Houghton - le - Spring, DH5 9ND",
      "geocode": true,
      "formatted_address": "Moorsley Rd, Hetton-le-Hole, Houghton le Spring DH5 0ED, UK",
      "latitude": 54.8170458,
      "longitude": -1.4577557,
      "post_code": "DH5 0ED",
      "city": "Hetton-le-Hole",
      "route": "Moorsley Road",
      "postal_town": "Houghton le Spring"
    },
    {
      "address": "Main Road, Stocksfield, NE43 7NN",
      "geocode": true,
      "formatted_address": "Stocksfield NE43 7NN, UK",
      "latitude": 54.9488217,
      "longitude": -1.9104481,
      "post_code": "NE43 7NN",
      "city": "Northumberland",
      "route": null,
      "postal_town": "Stocksfield"
    },
    {
      "address": "Headingley Crescent, Darlington, DL1 2ST",
      "geocode": true,
      "formatted_address": "Headingley Cres, Darlington DL1 2ST, UK",
      "latitude": 54.5335987,
      "longitude": -1.519036,
      "post_code": "DL1 2ST",
      "city": "Darlington",
      "route": "Headingley Crescent",
      "postal_town": "Darlington"
    },
    {
      "address": "Meadowside,, Sunderland, SR2 7QN",
      "geocode": true,
      "formatted_address": "Meadowside, Sunderland SR2 7QN, UK",
      "latitude": 54.8948601,
      "longitude": -1.3966531,
      "post_code": "SR2 7QN",
      "city": "Tyne and Wear",
      "route": "Meadowside",
      "postal_town": "Sunderland"
    },
    {
      "address": "West Street, Berwick Upon Tweed, TD15 2JZ",
      "geocode": true,
      "formatted_address": "West St, Berwick-upon-Tweed TD15 1AS, UK",
      "latitude": 55.76931090000001,
      "longitude": -2.0047977,
      "post_code": "TD15 1AS",
      "city": "Northumberland",
      "route": "West Street",
      "postal_town": "Berwick-upon-Tweed"
    },
    {
      "address": "Reid Street, Darlington, DL3 6EX",
      "geocode": true,
      "formatted_address": "Reid St, Darlington DL3 6EX, UK",
      "latitude": 54.53334049999999,
      "longitude": -1.563871,
      "post_code": "DL3 6EX",
      "city": "Darlington",
      "route": "Reid Street",
      "postal_town": "Darlington"
    },
    {
      "address": "Alderman Leach Drive, Darlington, DL2 2GF",
      "geocode": true,
      "formatted_address": "Alderman Leach Dr, Darlington DL2 2GL, UK",
      "latitude": 54.54711289999999,
      "longitude": -1.5865632,
      "post_code": "DL2 2GL",
      "city": "Darlington",
      "route": "Alderman Leach Drive",
      "postal_town": "Darlington"
    }
  ],
  "providerAddress": {
    "inst_code": "1DB",
    "addr_1": "Alderman Leach Drive",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Darlington",
    "postcode": "DL2 2GF ",
    "url": "http://www.westparkacademy.org.uk",
    "geocode": true,
    "formatted_address": "Alderman Leach Dr, Darlington DL2 2GL, UK",
    "latitude": 54.54711289999999,
    "longitude": -1.5865632,
    "post_code": "DL2 2GL",
    "city": "Darlington",
    "route": "Alderman Leach Drive",
    "postal_town": "Darlington"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "https://www.sunderland.ac.uk/study/education/pgce-school-direct/",
    "AboutCourse": "This course will mostly be based in your host school, supported by time spent in a second school to develop teaching and allow you to experience a diverse range of teaching opportunities. You will be supported by the University of Sunderland’s experienced trainers, as well as having a school-based subject and a generic trainer. Your school will be able to give you more information about the specific support that they will provide for you. \\r\nYou will usually spend one full day a week at the University of Sunderland, plus induction days and review weeksIf you choose the more widely available tuition route you will pay a tuition fee for your course and you will be eligible to apply for the many generous, tax-free government scholarships on offer.\\r\nDepending on the route you take, assessments will be a mix of written assignments, case studies and one to one assessments of your teaching practice. You will be taught via lectures, seminars, tutorials, project work and group work. You will be in University for an average of 15 days during the full training year; the University will provide support with your education assignments and practice based research. You can train to be either a Primary or a Secondary teacher on this route.\\r\n\\r\nOn the School Direct route your work-based learning will be based in the school. You will have a School Mentor and a University Tutor who will assess your written work and your teaching practice. You will also have support from a University Mentor.\\r\n\\r\n\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You will  need a 2:2 (or above) honours degree from a UK Higher Education institution or an equivalent qualification and be deemed suitable to train to teach by the School of Education at the University of Sunderland.\\r\n\\r\nYou should also hold a GCSE grade C or above (or equivalent) in Mathematics, Science, and English Language and a range of National Curriculum subjects. If you have studied for a GCSE which has a numerical grade then you will need to achieve a grade 4 or above. We will only accept equivalencies from equivalencytesting.com.",
    "InterviewProcess": "If your application is successful, you will be asked to attend an interview either at the University of Sunderland or at a school within the Training Alliance where your course will be running from. Each school can choose what they require from you at interview to demonstrate your understanding and practice, this may include: giving a brief presentation on a topic chosen by the school, reading a story to young children, teaching a short episode to a designated class, leading a discussion with young adults or even being interviewed by the School Council. Every interview will finish with a formal interview, where the school and University will explore your motivation for wanting to enter the teaching profession and your understanding of the role and responsibilities of teachers. The interview is a chance for you to show your personality and motivation behind your decision to teach, and what knowledge and transferable skills you will bring with you to your training.\\r\n",
    "OtherRequirements": "An enhanced Disclosure and Barring Service (DBS) check\\r\nA completed medical pro forma (based on DFEE Circular 8/92)\\r\nA pass on the professional skills tests in numeracy and literacy, set by the Department for Education. This is essential before you can achieve Qualified Teacher Status (QTS)",
    "PersonalQualities": "Trainees should be able to: \\r\nDemonstrate a passion for working with children and inspiring learning.\\r\nDevelop excellent professional relationships across the school community based on mutual respect. \\r\nTake initiative in a range of school contexts and accept responsibility for accessing training opportunities in school. \\r\nUse reflection and evaluation to adapt their teaching, drawing on a wide range of practical and creative strategies. \\r\nExhibit passion and desire to become an outstanding teacher. \\r\nWork effectively as a team member, bringing fresh ideas as well as acknowledging the importance of learning from more experienced colleagues. \\r\n\\r\n",
    "HowSchoolPlacementsWork": "All the schools in our partnership are primary schools. The Darlington primary schools in the partnership are West Park Primary School (W), Red Hall Primary (R) Reid Street Primary (S) and George Dent Nursery School (G). In Sunderland we have St Mary's RC Primary (M).\\r\nThe school that you are applying for will be one of two placement schools where you will be placed throughout the year.  \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "West Park Darlington Partnership is a commitment to ensuring that all learners within our partnership schools and wider partners have access to bespoke learning pathways enabling them to succeed. This ethos applies to our children and young people as well as out trainees, teachers and support staff as learners. We work closely with the University of Sunderland, the partnership schools and our own strategic partners to provide continuity of experiences to ensure judgements and training reaches the required standards. \\r\nTraining as a PGCE School Direct student ensures that you will be in your host school from your first day on the course and will have the opportunity to spend the year being part of an accomplished and experienced school staff team working within the wider curriculum. You will complete an additional placement in the spring term in one of our contrasting partner schools. You will study at the University of Sunderland for around fifteen days during your full training year.\\r\nWest Park Academy (W) is the lead school for the partnership and as a Lead School we help to advertise School Direct vacancies for our host schools. The Darlington primary schools in the partnership are West Park Primary School (W), Red Hall Primary (R) Reid Street Primary (S) and George Dent Nursery School (G). In Sunderland we have St Mary's RC Primary (M).\\r\nThe school that you are applying for will be one of two placement schools where you will be placed throughout the year.\\r\n",
    "TrainWithDisability": "We follow the University of Sunderland Diversity Statement:\\r\n“We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability. “\\r\nThe University of Sunderland Disability Support Team provides advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. \\r\nOn application please contact the Disability Support Team for disability-related queries:\\r\nWebsite: Disability Services Email: disability.support@sunderland.ac.uk\\r\nTel: 0191 515 2952\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We are proud to work in Partnership with the University of Sunderland. The University has successfully trained teachers for over 100 years making a difference in educating the next generation of learners.\\r\nThrough our partnership with the University our Trainee Teachers benefit from the support of our  Primary  Tutor Team who are experts in their subject fields and related pedagogies. The School of Education is world leading in research according to the latest Research Excellence Framework. Trainees are allocated a Personal Tutor from the university who will work with their School Mentor to give academic, pastoral and placement support. \\r\n",
        "UcasInstitutionCode": "S84"
      }
    ]
  },
  "has_inst": true
}
