{
  "locationType": "School",
  "accrediting": "Kingston University",
  "provider": "Latchmere Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Salary",
  "slug": "1LZ/2YB4",
  "providerCode": "1LZ",
  "programmeCode": "2YB4",
  "schools": [
    {
      "name": "Latchmere School",
      "address": "Latchmere Road, KT2 5TT",
      "code": "K"
    }
  ],
  "addresses": [
    {
      "address": "Latchmere Road, KT2 5TT",
      "geocode": true,
      "formatted_address": "Latchmere Rd, Kingston upon Thames KT2 5TT, UK",
      "latitude": 51.4222323,
      "longitude": -0.2966321,
      "post_code": "KT2 5TT",
      "city": "Greater London",
      "route": "Latchmere Road",
      "postal_town": "Kingston upon Thames"
    }
  ],
  "providerAddress": {
    "inst_code": "1LZ",
    "addr_1": "Latchmere School",
    "addr_2": "Latchmere Road",
    "addr_3": null,
    "addr_4": "Kingston upon Thames",
    "postcode": "KT2 5TT ",
    "url": "http://www.latchmereschool.org",
    "geocode": true,
    "formatted_address": "Latchmere Rd, Kingston upon Thames KT2 5TT, UK",
    "latitude": 51.4225922,
    "longitude": -0.294416,
    "post_code": "KT2 5TT",
    "city": "Greater London",
    "route": "Latchmere Road",
    "postal_town": "Kingston upon Thames"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "The trainees are given a termly programme to follow and this sets out what the trainees are focussing on week by week. In the Autumn Term, the trainees are 'information gathering' by reading pedagogy from the latest theorists, observing excellent practitioners, attending training and unpicking the teacher standards. They also gradually build up to teaching a 40% timetable towards the end of the term. In this term, two short reflective pieces are written looking at traditional theories of education and looking at the impact of observed practice. There is also a focus on behaviour management, the essence of teaching and learning and writing lesson plans. \\r\n\\r\nIn the Spring Term, the trainees go on a placement in a different school and a different key stage. This is to appreciate a different age range and how to adjust your teaching accordingly and also to experience teaching the curriculum to younger or older children and the subject knowledge this involves. The teaching time increases to 60%\\r\n\\r\nThe Summer Term sees the trainees back to their base school to embed and refine their teaching practice. The teaching timetable increases to 80%.\\r\n\\r\nThe majority of time is spent in school to 'learn on the job'. Other times are spent at training sessions at Latchmere and some lectures at the university.\\r\n\\r\nThe trainees are assessed through evidence against the teacher standards via observations which occur on a regular basis. All feedback is advice!",
    "CourseLength": "OneYear",
    "SalaryDetails": "School Direct salaried trainees are paid on the unqualified teacher pay scale. There are no fees to pay.",
    "Qualifications": "The course requirements are:\\r\nAn honours degree at 2:2 or above\\r\nGCSE in Maths, English and Science\\r\nPassing the professional skills tests in English and Maths",
    "InterviewProcess": "At interview, the candidates sit the Kingston University maths and English tests. These are short tests and you do not need to revise for them. You will also read with a small group of children and here we are looking at how you engage with children, what questions you might ask them and what learning is taking place. Then there will be a panel interview. We invite heads from schools who are looking to employ a school direct trainee to form the panel. ",
    "OtherRequirements": "All candidates are subject to a criminal record check and are asked to complete a health questionnaire.",
    "PersonalQualities": "We are looking for those who are passionate about improving outcomes for children. A school is a busy workplace so you need to be flexible, adaptable, resourceful and resilient.",
    "HowSchoolPlacementsWork": "When you are offered a place, we will already know the school that you will be working at and we will tell you this on your offer letter. All the schools that take trainees are within the local authority of Kingston upon Thames.\\r\n\\r\nYou will begin your training as an employee of the school and, as such, you will follow that school's protocols. You will work alongside an experienced teacher and have a mentor at that school and will participate in all aspects of school life. This is your base school.\\r\n\\r\nThe second placement takes place in the 2nd half of the Spring Term. Latchmere Teaching School will organise this and the placement lasts for 6 weeks. You return to your base school for the Summer Term.\\r\n\\r\nWe take into account locality, family, travel distance, experience and many other factors when organising placements."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Latchmere is an outstanding school and our passion is teaching and learning. As a Teaching School, we are committed to providing a high quality route into teaching through the School Direct programme. This programme enables you to train on the job whilst receiving pedagogical input through training sessions based at Latchmere or the University. We draw on the latest theories in education and on the expertise across our alliance. We support you from the interview to preparation to start, beginning the programme, the placements and the award of QTS. Each trainee is visited every half term to engage in professional dialogue on a 1:1 basis alongside an observation and each trainee has a mentor at their base school who provides weekly support. We hold a 100% employment record over the last 3 years. Of our programme this year, a trainee said, 'Outstanding support from everyone involved with my training. I never felt I couldn't do it because of the support provided. I would recommend school direct as a brilliant way to get into teaching, especially through Latchmere.'",
    "TrainWithDisability": "We are an equal opportunities employer. We recruit, train and promote people because of their ability, the needs of the post and other relevant criteria. We treat all employees who apply to us equally. When an applicant has a disability and they meet the essential criteria of the post, they are automatically shortlisted for interview. This positive action helps ensure young people with disabilities get their fair share of jobs. We regularly review our practices and procedures to make sure our equal opportunities policy is working.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Our higher education partner is Kingston University and we have worked collaboratively with them for the last five years. The University ensures that our programme and the interview process is compliant.",
        "UcasInstitutionCode": "K84"
      }
    ]
  },
  "has_inst": true
}
