{
  "locationType": "School",
  "accrediting": "Nottingham Trent University",
  "provider": "Leicestershire Learning Alliance",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "27P/2X9Z",
  "providerCode": "27P",
  "programmeCode": "2X9Z",
  "schools": [
    {
      "name": "Main Site",
      "address": "Melton Road, Leicester, LE4 8GQ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Melton Road, Leicester, LE4 8GQ",
      "geocode": true,
      "formatted_address": "Melton Rd, Thurmaston, Leicester LE4 8GQ, UK",
      "latitude": 52.68651300000001,
      "longitude": -1.0928418,
      "post_code": "LE4 8GQ",
      "city": "Thurmaston",
      "route": "Melton Road",
      "postal_town": "Leicester"
    }
  ],
  "providerAddress": {
    "inst_code": "27P",
    "addr_1": "997 Melton Road",
    "addr_2": "Thurmaston",
    "addr_3": "Leicester",
    "addr_4": null,
    "postcode": "LE4 8GQ ",
    "url": null,
    "geocode": true,
    "formatted_address": "997 Melton Rd, Thurmaston, Leicester LE4 8GQ, UK",
    "latitude": 52.6881223,
    "longitude": -1.092191,
    "post_code": "LE4 8GQ",
    "city": "Thurmaston",
    "route": "Melton Road",
    "postal_town": "Leicester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This is an innovative training route which allows you to choose the school, or group of schools, in which you train, with an intention – but no absolute guarantee – that they will employ you once you successfully graduate. School Direct is run as a partnership between a lead school, other schools in their alliance and an accredited teacher-training provider.\\r\n\\r\nWe have established successful partnerships with schools to offer both School Direct salaried and non-salaried courses for Primary and Secondary teaching.\\r\n\\r\nThis is open to all graduates (including those who expect to complete their first degree prior to the September start date). You will pay tuition fees and may be eligible for student loans, and a bursary or scholarship.\\r\nThe School Direct route enables you to work within a school and train in the classroom, supported by qualified teachers and mentors. You will also spend time studying at the University as you progress towards gaining a PGCE and Qualified Teacher Status.\\r\n\\r\nSchool Direct places are offered by a school or group of schools in partnership with NTU. The schools involved have an excellent history of involvement in teacher training and a long history of supporting trainees to become confident and effective teachers.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": " * A good UK honours degree or equivalent, at a minimum 2.2 with at least 50% focused on subject areas that are very closely related to the subject that you wish to teach. \\r\n * GCSE Grade C (or equivalent) in English Language and Maths \\r\n * A levels (or equivalent) in the subject you intend to specialise in.\\r\n * Skills test in Numeracy and Literacy must be completed before starting the course. \\r\n\\r\n",
    "InterviewProcess": "You will be invited to an interview with Leicestershire Learning Alliance as part of the selection process where you will have an opportunity to take part in a number of school-based activities during a normal school day. \\r\n\\r\nThey will include:\\r\n\\r\n * An opportunity to meet with Head of Subject and other colleagues \\r\n * Subject Knowledge Test\\r\n * An opportunity to observe a lesson and discuss\\r\n * Individual Interview \\r\n * Student Panel Interview \\r\n * Teach part of a lesson to a small group. \\r\n",
    "OtherRequirements": "Following the interview, strong candidates who are not able to demonstrate graduate level knowledge in the subject they wish to teach may be offered a place on the course subject to successfully completing a Subject Knowledge Enhancement (SKE) course in the subject prior to commencing your teacher-training year. ",
    "PersonalQualities": "We are looking for applicants with a range of skills, knowledge, experience and aptitude for teaching: \\r\n\\r\n * Be able to form positive relationships with both young people and adults\\r\n * Have excellent communication skills both orally and in writing \\r\n * Have a commitment to learning and teaching who make young people’s learning their first concern\\r\n * Be able to analyse and reflect upon your own experiences\\r\n * Have an awareness of contemporary issues in education. \\r\n",
    "HowSchoolPlacementsWork": "The school lead organises your placements within the teaching alliance. \\r\n\\r\nThe School Direct course is a flexible approach to teacher training. The majority of your time will be spent in the school, training in the classroom and being supported by experienced teachers and mentors. You will also spend time studying at the University.\\r\n\\r\nAt the University you will study for the same award as other postgraduate teacher trainees except that the delivery will have more emphasis on being trained within a school environment and will involve more staff from schools:\\r\n\\r\n * Postgraduate Certificate in Education (with 60 credit points at Masters level)\\r\n * Professional Certificate in Education.\\r\nSuccessful completion of the course leads to Qualified Teacher Status (QTS)* and a postgraduate qualification.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": " Leicestershire Learning Alliance work in partnership with Nottingham Trent University (NTU), University of Leicester and Loughborough University to train outstanding teachers who make a significant difference to their students, their schools and their profession. The Universities are established and successful providers of initial teacher-training and education-related courses.  Staff at our school work with the experienced researchers and practitioners at the Universities to design and deliver our courses that can be tailored to meet your individual needs.  These courses carefully blend significant hands-on teaching experience in our schools with the critical thinking and theoretical underpinning that is so important for the teaching profession.  The Universities offer a Postgraduate Certificate in Education, which can be obtained alongside the recommendation for Qualified Teacher Status and all universities offer 60 or 90 Masters Credits.  \\r\n \\r\nAs soon as you gain a place with the Leicestershire Learning Alliance, you will immediately become part of our Alliance working with highly supportive and professional mentors across Key Stages 3 to 5. We can offer you ongoing training to help you become an excellent teacher and ensure you are well prepared for your first teaching post.\\r\n\\r\nThe LLA are a group of seven Leicestershire schools led by The Roundhill Academy, \\r\nBrockington College, Manor High, The Cedars Academy, Martin High School, Welland Park and Wreake Valley Academy.   \\r\n \\r\n",
    "TrainWithDisability": "Applicants who would benefit from disabled access should inform us when making their application to enable adequate provision to be made. \\r\n \\r\nThe Equality Act 2010 defines disability as ‘A physical or mental impairment which has a substantial and long-term adverse effect on the ability to carry out normal day-to-day activities.’\\r\n\\r\nThe Academy want to meet the aims and commitments set out in its equality policy.  This includes not discriminating under the Equality Act 2010, and building an accurate picture of the make-up of the workforce in encouraging equality and diversity.  \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The School Direct course is a flexible approach to teacher training. The majority of your time will be spent in the school, training in the classroom and being supported by experienced teachers and mentors. You will also spend time studying at the University.\\r\n\\r\nAt the University, you will study for the same award as other postgraduate teacher trainees except that the delivery will have more emphasis on being trained within a school environment: \\r\nSuccessful completion of the course leads to Qualified Teacher Status (QTS) and a postgraduate qualification.\\r\n",
        "UcasInstitutionCode": "N91"
      },
      {
        "Description": "The School Direct route allows schools to recruit students onto teacher education courses run in collaboration with the university. The lead school ensures you have a range of placement opportunities as schools work together in teaching alliances.\\r\n\\r\nThis course is made up of both campus-based sessions, which will give you a grounding in the principles of good teaching practice and school-based placements giving you the chance to apply your knowledge and experience in a wide range of classroom situations\\r\n",
        "UcasInstitutionCode": "L34"
      },
      {
        "Description": "School Direct is a school-led teacher training route, in which a school recruits and selects their own trainees in collaboration with an accredited teacher training provider with the expectation that the trainees may go on to work within the school or group of schools to which they applied, although there can be no absolute guarantee of employment at the end of the training programme.\\r\n\\r\nThis leads to the award of a PGCE with 90 masters level credits (which represents half a full masters degree) as well as Qualified Teacher Status (QTS). \\r\n",
        "UcasInstitutionCode": "L79"
      }
    ]
  },
  "has_inst": true
}
