{
  "locationType": "School",
  "accrediting": "University of Cumbria",
  "provider": "Bishop Rawstorne School Direct",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "slug": "18C/2RY7",
  "providerCode": "18C",
  "programmeCode": "2RY7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Highfield Road, Croston, Leyland, PR26 9HH",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Highfield Road, Croston, Leyland, PR26 9HH",
      "geocode": true,
      "formatted_address": "Highfield Rd, Croston, Leyland PR26 9HH, UK",
      "latitude": 53.6617554,
      "longitude": -2.7674733,
      "post_code": "PR26 9HH",
      "city": "Croston",
      "route": "Highfield Road",
      "postal_town": "Leyland"
    }
  ],
  "providerAddress": {
    "inst_code": "18C",
    "addr_1": "Bishop Rawstorne Academy",
    "addr_2": "Highfield Road",
    "addr_3": "Croston",
    "addr_4": "Lancashire",
    "postcode": "PR26 9HH",
    "url": "http://www.bishoprts.co.uk",
    "geocode": true,
    "formatted_address": "Highfield Rd, Croston, Leyland PR26 9HH, UK",
    "latitude": 53.6617933,
    "longitude": -2.7693475,
    "post_code": "PR26 9HH",
    "city": "Croston",
    "route": "Highfield Road",
    "postal_town": "Leyland"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "This course has been carefully designed, together with the University of Cumbria, and expert teachers, to ensure you complete it with all the knowledge, pedagogy and teaching and learning skills required to be an excellent ‘Teacher of  History’. We firmly believe that if you want to be able to teach, the best way to do so is to learn from outstanding teacher practitioners; this means that your training is very much school based and ‘hands on’. \\r\n\\r\nYou will undertake placements in two of our carefully selected cluster schools; your first placement is from September to December and the second from January to June. On placement you will be given the chance to build up a teaching timetable, with the help of an experienced subject mentor and professional mentor. The programme will also allow you to gain a Post Graduate Certificate in Education; this will not only help you understand the mechanics of teaching, but also stay ahead of the game when it comes to employment.\\r\n\\r\nThe course also offers immeasurable support, both from placement schools and the University; this is in terms of your assignments, teaching practice and subject knowledge, as well as pastorally. Moreover, during the year you will also be fortunate enough to attend at least 20 school based training days, delivered by a wide range of experts, and 12 subject specific training days at the University. This will ensure you have all the knowledge you require to turn you into a confident, happy and successful teacher. Other exciting opportunities include a day at a primary school, conferences and a day in college to look at transition; however, the beauty of this programme is that we can also offer alternative placements/days out, if you have a particular area or institute you wish to specialize in.\\r\n\\r\nAdditionally, all of our cluster schools are good or outstanding and located within a small geographical area; this means you do not have to travel huge distances – great for those who have family or other commitments. Even the University, where you will go for training, is conveniently located in Lancaster.\\r\n\\r\nFinally, due to the reputation of Bishop Rawstorne, as a national lead teaching school, and our cluster schools as experts in initial teacher training, we guarantee you a fantastic experience and due to our extensive contacts within the area, the best possible chance of securing employment on completion of the course.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Please see our website for eligibility criteria: https://www.redrosetsa.co.uk/teacher-training\\r\n\\r\nIf you have any questions please contact Helen Winter (School Direct Lead) hwinter@bishopr.co.uk. \\r\n",
    "InterviewProcess": "As a School Direct Associate Teacher, you will be trained jointly by our cluster of schools and the University of Cumbria and will benefit from a comprehensive and bespoke training programme, offered by a range of experts within our alliance.\\r\n\\r\nIt is our aim to recruit those candidates who we believe have the potential to become outstanding secondary teachers. Recruitment of applicants for the 2019 intake will take place throughout the year and will involve a half day selection process at Bishop Rawstorne Academy. It will include the following tasks:\\r\n\\r\n•\\tSubject knowledge presentation  \\r\n•\\tTimed written task in response to pre-interview reading – the article will be sent to you to consider prior to the interview\\r\n•\\tInterview – with the School Direct Programme Lead and/or University Partner Lead or Cluster School Professional Mentor/Subject Specialist\\r\n•\\tSubject knowledge audit – so that we can support you with any gaps in knowledge\\r\n\\r\nWe also appreciate that an interview is a two way process and want to ensure that you will be happy working together with us. Therefore, on the day you attend the interview, you will also be given a tour around the school, the chance to speak to our current trainee teachers (where possible) and to ask any further questions you may have about the course. \\r\n\\r\nWe aim to give you a decision about the interview as soon as possible and at the latest within 24 hours.\\r\n",
    "OtherRequirements": " * The DfE require you to undertake and pass Professional Skills Tests in Literacy and Numeracy prior to commencement of this programme. \\r\n\\r\n* If you accept a formal offer of a place you will be required to meet the Department for Education's standards for physical and mental fitness to teach and clearance to work with children. \\r\n\\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS, previously CRB) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\\r\n\\r\n\\r\n",
    "PersonalQualities": "Teaching is an extremely rewarding profession and we are keen to recruit tomorrow’s teachers. We are looking for people who are passionate about getting the best out of young people; have a genuine love for their subject; are hardworking and determined; who are good team players and who have a sense of humour and integrity. \\r\n\\r\nWe welcome applications from a range of backgrounds. If you want to make sure that teaching is right for you, or visit us, please contact the School Direct Lead, Helen Winter (hwinter@bishopr.co.uk) who will be more than happy to answer any questions you have.\\r\n",
    "HowSchoolPlacementsWork": "Bishop Rawstorne Academy was one of the first schools nationally to offer the School Direct programme. As a ‘National Teaching School’ we therefore pride ourselves on having developed a course that is not only unique, but meets the needs of all our trainee teachers.\\r\n\\r\nEach of our cluster schools, where you will be placed, have been chosen not only because Ofsted regard them as either ‘Good’ or ‘Outstanding’ but because they have an excellent reputation for training teachers. On placement you will work within a faculty area, and with a range of experts, who will support you closely as you become a more confident teacher. Each of the subject mentors has been specially trained so they act as mentors and then coaches, helping you to develop your practice. Moreover, as we are a teaching school, we are able to offer you a range of free CPD activities that will give you the edge over other trainees and afford many networking opportunities. \\r\n\\r\nAll of our six cluster schools are geographically close, based in Chorley, Preston, Croston, Leyland and Wigan; this means that your transport time to work does not eat into your working day or your home life. In addition, as we have a close working relationship with our cluster schools, we ensure that our trainee teachers are told in the summer where their first placement school will be. In fact, many of our trainees enjoy visiting their placement school in the summer, relishing the prospect of meeting the team they will be working with and familiarising themselves with school life. \\r\n\\r\nThe age ranges you will teach at our cluster schools will be 11-16; however, we also offer the chance for you to experience a day at a primary school and a college. For those interested in working in specialist schools, this is something we can also look to accommodate.\\r\n\\r\nThe feedback we get from our trainees about our cluster schools is overwhelmingly positive and a large percentage of our trainees often ended up being employed by one of our cluster schools, or another school within our wider alliance.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our unique and well-established programme offers a skilled partnership of schools who work closely with us to ensure you receive the highest quality training, as well as the care, support and resources you require. Our accredited provider, the University of Cumbria, also offer experienced staff and together we guarantee your experiences in school, and at university, or when completing assignments, are not only positive but rewarding ones.\\r\n\\r\nAll placement schools have been carefully selected to provide many fantastic opportunities and a personalised school based experience.  They are conveniently located across the northwest and include: Penwortham Girls’ High School, Byrchall High School, Brownedge St. Mary’s Catholic School, Bishop Rawstorne Academy, Lostock Hall Academy, St.Michael’s Church of England High School and Balshaw’s Church of England High School. Moreover, we pride ourselves on supporting all trainee teachers, on an individual level, and throughout your training you will receive incalculable support with preparing for interviews and job applications. Consequently, our trainees have a fantastic track record of securing employment, often within our own or partnership schools.\\r\n\\r\nIn addition, as we are a lead teaching school, you will have the benefit of many extras; for example, you will have access to a free CPD programme, across our alliance schools, as well as teaching and learning conferences. This will not only allow you opportunities for further networking, but also to gain cutting-edge training from experienced staff, many of whom are specialist leaders in education, thereby allowing you to become an outstanding teacher in your own right.\\r\n",
    "TrainWithDisability": "As an initial teacher trainer provider, we recognise that we are all different and each have our own unique ways of learning. Consequently, we aim to provide a supportive environment that allows all individuals to flourish, and actively encourage applications from disabled people. We are committed to widening participation and provide a range of services to enable those with a disability or specific learning difficulty (SpLD) to access their training. To accomplish this, we offer:\\r\n\\r\n- Adjustments to the interview process, including extra time, readers and scribes, use of computers and rest breaks, subject to receiving appropriate evidence of disability\\r\n\\r\nAt University:\\r\n-\\tDigital recorders for loan to enable you to record your teaching \\r\n        session\\r\n-\\tAssistance in the library \\r\n-\\tAccess to a range of non-medical help services such as practical \\r\n       support, note-taking and specialist mentoring (to access these \\r\n       services you will need to have applied for Disabled Students \\r\n       Allowance through your funding body – the university can assist you \\r\n       with this process if required\\r\n-     An individualised disability/SpLD action plan giving staff an overview \\r\n      of the impact of your disability/SpLD and detailing the adjustments \\r\n      that you require\\r\n\\r\nWe will always discuss any requirements with you to ensure any adjustments necessary reflect your needs and assist you in becoming an independent learner thereby improving your employability skills.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The University of Cumbria, based in Lancaster, is one of the country’s leading providers of teacher education. The success of the PGCE course, offered as part of the School Direct programme, is underpinned by an academic teaching philosophy and the practical skills of real school-based learning. \\r\n\\r\nThe 12 subject based training days, delivered by both University tutors and experienced teachers, will afford you the opportunity to develop your teaching skills, work as a team, reflect on the impact you make on pupils, the school and the community and become a skilled professional able to work in any school.",
        "UcasInstitutionCode": "C99"
      }
    ]
  },
  "has_inst": true
}
