{
  "locationType": "School",
  "accrediting": "The University of Nottingham",
  "provider": "The de Ferrers Trust",
  "subjects": [
    "Chemistry",
    "Science",
    "Secondary"
  ],
  "name": "Chemistry",
  "slug": "1E2/2DYQ",
  "providerCode": "1E2",
  "programmeCode": "2DYQ",
  "schools": [
    {
      "name": "Main Site",
      "address": "The de Ferrers Academy, St Mary's Drive, Burton-on-Trent, DE13 0LL",
      "code": "-"
    },
    {
      "name": "East Leake Academy",
      "address": "Lantern Lane, East Leake, Leicestershire, LE12 6QN",
      "code": "B"
    },
    {
      "name": "Granville Sports College",
      "address": "Burton Road, Woodville, Swadlincote, Derbyshire, DE11 7JR",
      "code": "R"
    },
    {
      "name": "Saint John Houghton Catholic Voluntary Academy",
      "address": "Abbott Road, Ilkeston, Derbyshire, DE7 4HX",
      "code": "Z"
    }
  ],
  "addresses": [
    {
      "address": "The de Ferrers Academy, St Mary's Drive, Burton-on-Trent, DE13 0LL",
      "geocode": true,
      "formatted_address": "St Mary's Dr, Burton-on-Trent DE13 0LL, UK",
      "latitude": 52.8295843,
      "longitude": -1.6406357,
      "post_code": "DE13 0LL",
      "city": "Staffordshire",
      "route": "Saint Mary's Drive",
      "postal_town": "Burton-on-Trent"
    },
    {
      "address": "Lantern Lane, East Leake, Leicestershire, LE12 6QN",
      "geocode": true,
      "formatted_address": "Lantern Ln, East Leake, Loughborough LE12 6QN, UK",
      "latitude": 52.8364798,
      "longitude": -1.1752272,
      "post_code": "LE12 6QN",
      "city": "East Leake",
      "route": "Lantern Lane",
      "postal_town": "Loughborough"
    },
    {
      "address": "Burton Road, Woodville, Swadlincote, Derbyshire, DE11 7JR",
      "geocode": true,
      "formatted_address": "Burton Rd, Midway, Woodville, Swadlincote DE11 7ND, UK",
      "latitude": 52.7755248,
      "longitude": -1.5385506,
      "post_code": "DE11 7ND",
      "city": "Midway",
      "route": "Burton Road",
      "postal_town": "Swadlincote"
    },
    {
      "address": "Abbott Road, Ilkeston, Derbyshire, DE7 4HX",
      "geocode": true,
      "formatted_address": "Abbot Rd, Ilkeston DE7 4HX, UK",
      "latitude": 52.96278419999999,
      "longitude": -1.3282264,
      "post_code": "DE7 4HX",
      "city": "Derbyshire",
      "route": "Abbot Road",
      "postal_town": "Ilkeston"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Following an induction at the University, you will start at your placement school at the beginning of their academic year. This will involve observing lessons and familiarising yourself with school campuses, alongside policies and procedures. In mid-September you will spend a block of time at the University working as part of a cohort of beginning teachers preparing for the year ahead.\\r\n\\r\nFrom late September you will spend most of your time in your placement school with regular days returning to the University to further reflect on, and develop, your practice. During the first term you undertake a variety of tasks and observations and are gradually introduced to teaching your subject. You work closely with your school-based mentors and with your tutor who visits you in school.\\r\n\\r\nYou return to the University either side of your Christmas break. In this block of time you work with your peers, reflecting on your experiences in school and preparing for the next term.\\r\n\\r\nDuring the spring term you complete a placement in a second school that promotes collaborative learning and broadens your experience.\\r\n\\r\nDuring your placements post-Christmas you will return for several University-based days that focus on a wide range of professional development issues and allow for contact with peers and tutors.\\r\n\\r\nAs part of the programme you will undertake a school-based inquiry project where, working with others, you will formulate and develop a research project on an area of interest.",
    "CourseLength": "OneYear",
    "Qualifications": "English Language and Mathematics at GCSE grade C or above, or an approved equivalent qualification.",
    "InterviewProcess": "There is a two stage process for the School Direct course. \\r\n\\r\nThe University of Nottingham screens your application and decides whether to offer you an interview. If you are offered an interview this will be at the University's School of Education. If you are successful at this interview you will then be interviewed by us.\\r\n\\r\nWhen being interviewed at the University, there are likely to be other applicants being interviewed alongside you. They will be keen to see that you can work collaboratively with others. The criteria that will be used at interview to decide whether or not you are suitable for a place on the course are:\\r\n\\r\n- an awareness of current educational issues;\\r\n- a realistic and positive view of schools and schooling;\\r\n- an open and enquiring mind;\\r\n- clear reasons for wanting to teach at the level for which you have applied;\\r\n- motivation and commitment to teaching students of all levels of ability;\\r\n- maturity and self confidence;\\r\n- an appropriate level of subject knowledge in your chosen subject for secondary applicants. \\r\n\\r\nIf you are successful at interview at The University of Nottingham, there will then be a school based interview. This will include:\\r\n\\r\n- a subject knowledge, professional discussion\\r\n- a formal interview\\r\n- a student panel\\r\n- the opportunity to tour the campuses, to get a feel for the ethos of the school and ensure that this is the right place for you to complete your training",
    "PersonalQualities": "A desire to teach and work with young people\\r\n\\r\nEffective communication skills\\r\n\\r\nDetermination to succeed\\r\n\\r\nA readiness to listen and share\\r\n\\r\nA flexible approach to learning and teaching",
    "HowSchoolPlacementsWork": "Your main placement will be in your selected school. You will start at your placement school at the beginning of their academic year. There will be a number of days in university during the first term. As the term progresses, trainees will be in their placement school four days a week, and in university one day a week.\\r\n\\r\nDuring the spring term you complete a five week placement in a second school that promotes collaborative learning and broadens your experience.\\r\n\\r\nYou will experience teaching students from 11 to 18 during your placements "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The de Ferrers Academy is a highly successful and ambitious 11-18 split-site Academy catering for over 2100 students, situated on the outskirts of Burton-Upon-Trent. We have received national and international recognition for the work we are currently doing on transforming teaching and learning through the use of Apple technology. As the Burton-Upon-Trent Apple Regional Training Centre (RTC), trainees with us will be provided with outstanding opportunities to access and develop their teaching in a modern, forward thinking educational establishment.\\r\n\\r\nThe de Ferrers Academy, as you will read in the Ofsted Report of January 2017, is a highly successful Academy, with student outcomes and the quality of teaching, learning and assessment both judged to be Outstanding. Year 7 is significantly over-subscribed annually and demand is growing. The same is true with our Sixth Form.\\r\n\\r\nWe have three sites in close proximity to one another. Two of our sites are approximately 1 km apart: Years 7 - 8 are taught mainly on the Dove Campus and Years 9 - 11 on the Trent Campus. We were very fortunate to open a new Sixth Form campus in 2018 located close to Burton town centre. This new campus is designed to meet the needs of pre-university students with a large lecture theatre, and flexible learning spaces for group work and independent study. \\r\n\\r\nWe currently have over 200 teaching and support staff. You will be working with a dedicated, hard-working team and, as a new colleague, you can expect a comprehensive induction and support programme.\\r\n",
    "TrainWithDisability": "We do not discriminate any candidate who has any form of disability.  If successful we would make the necessary adjustments to facilitate employees to be able to carry out their role, examples such as:\\r\n\\r\n- lessons on the ground floor\\r\n- support of appointments with external agencies\\r\n- use of sound field system\\r\n\\r\nApplicants should be aware that we are a split site Academy and to access all of the required teaching experience to achieve QTS, inter-site travel is necessary during the school day. \\r\n\\r\nWe have staff who have a variety of disabilities, all these staff receive support through HR.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The University of Nottingham is a Russell Group institution that is rated as ‘Outstanding’ by Ofsted to deliver a unique and bespoke School Direct teacher training programme.\\r\n\\r\nTrainees will have short blocks of time through the year in University which coincide with the PGCE trainees in specific subject areas. This enables you to be part of a large group of beginning teachers in your subject.\\r\n\\r\nYou will be assigned a mentor by the Academy who will undertake training at the University. You will also be allocated a University tutor who will work closely with you and your mentor and coordinator. \\r\n",
        "UcasInstitutionCode": "N84"
      }
    ]
  },
  "has_inst": true
}
