{
  "locationType": "School",
  "accrediting": null,
  "provider": "The Learning Institute South West",
  "subjects": [
    "Primary"
  ],
  "name": "Primary 5-11",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "L19/2CTH",
  "providerCode": "L19",
  "programmeCode": "2CTH",
  "schools": [
    {
      "name": "Main Site",
      "address": "Beacon Place, Station Approach, Victoria, Roche, Cornwall, PL26 8LG",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Beacon Place, Station Approach, Victoria, Roche, Cornwall, PL26 8LG",
      "geocode": true,
      "formatted_address": "Station Approach, Victoria, Saint Austell PL26 8LG, UK",
      "latitude": 50.4185208,
      "longitude": -4.828988,
      "post_code": "PL26 8LG",
      "city": "Victoria",
      "route": "Station Approach",
      "postal_town": "Saint Austell"
    }
  ],
  "providerAddress": {
    "inst_code": "L19",
    "addr_1": "The Learning Institute",
    "addr_2": "Rm B304",
    "addr_3": "Beacon Place, Station Approach",
    "addr_4": "Roche, Cornwall",
    "postcode": "PL26 8LG",
    "url": "http://www.learninginstitute.co.uk",
    "geocode": true,
    "formatted_address": "Victoria Beacon Place, Station Approach, Victoria, Roche PL26 8LG, UK",
    "latitude": 50.4182863,
    "longitude": -4.8271063,
    "post_code": "PL26 8LG",
    "city": "Victoria",
    "route": "Station Approach",
    "postal_town": "Roche"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "The course will start on Friday 6th September 2019. You will spend most of your first 2 weeks undertaking central training in our training room in Roche. On completion of induction training, all trainees start their main school placement.\\r\nMost training weeks, trainee teachers are in their school placement from Monday to Thursday with Fridays reserved for General Professional Study days (GPS), which mostly take place at Roche.\\r\nAll trainees need to undertake a second school placement. This normally happens from February half term until Easter. After the Easter holidays, trainees are back in their main placement.\\r\nAll trainees are assigned a School Based Tutor, who mentors and oversees training and trainee progress on a daily basis in school. Each trainee also works closely with their Visiting Tutor, who provides additional guidance.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "a)\\tA good degree (2.2 or above). Equivalent qualifications may also be considered.\\r\nb)\\tGCSE or O levels in English, Maths and Science at Grade C /4 or above. We will consider candidates who are currently working towards these qualifications. We can offer equivalency tests in English, Maths and Science; however we do encourage potential teachers to pursue full GCSEs for their own professional development. \\r\nc)\\tFollowing interview, successful candidates will need to complete Literacy and Numeracy QTS skills test by a specified dated set out in the acceptance information.\\r\n\\r\n",
    "InterviewProcess": "Following your application through UCAS, shortlisting will take place to invite appropriate candidates to interview. This rigorous process will involve a short lesson observation and a discussion with an interview panel.  Interviews will be held in Primary Schools throughout Cornwall and Devon.\\r\nYou will be asked to bring with you a number of original documents, such as examination certificates, for verification.\\r\n",
    "OtherRequirements": "a)\\tRecent experience of working with children in schools or other settings. This may include: nurseries, outdoor education facilities or as a support worker.\\r\n\\r\nb)\\tPotential to become an outstanding, reflective practitioner.\\r\n\\r\nc)\\tThe ability to communicate clearly and accurately in both written and spoken English.\\r\n\\r\nd)\\tThe ability to cope with the demands of an exacting profession. \\r\n\\r\ne)\\tEvidence of appropriate levels of commitment and motivation for successful study, including the potential intellectual capacity for academic study at Masters' level .\\r\n\\r\nf)\\tDetails of appropriate referees who will provide confirmation of the applicant's suitability for teaching \\r\n",
    "PersonalQualities": "We are looking for positive, dynamic applicants who are committed and enthusiastic about working with children, sharing their passion for learning. ",
    "HowSchoolPlacementsWork": "In The Learning Institute we believe a friendly and happy school environment constitutes creative and supportive learning platform for trainees.  We work together with successful candidates in finding the right school for them to complete their training. The list of our partner schools can be found on our website.\\r\nEach trainee needs to complete at least 2 school placements and train across 4 year groups.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Learning Institute South West is a well-regarded SCITT with over 10 years of experience in training teachers.  Since starting in 2004, the SCITT has trained over 400 teachers with exceptionally high employment rates. This year over 75% of primary trainees had secured a teaching post prior to graduating. As a part of WeST (Westcountry Schools Trust) and working in close partnership with Southerly Point Co-Operative Multi Academy Trust, The Learning Institute prepares all trainees for a successful career in the modern world of teaching.\\r\nWe are committed to developing the school leaders of the future through our values-led programmes; supporting reflective practice and principled decision-making.\\r\nOur primary and secondary postgraduate teacher training programmes are school based. This is the best way to experience all aspects of school life, learning from outstanding practising teachers. Across the year you will be supported by mentors and our experienced tutor team. ‘Trainees receive excellent support from their schools and visiting tutors. ’External Moderator 2018. School-based learning is supported by regular taught sessions to help you develop your teaching skills with greater depth and understanding.\\r\nOur trainees benefit from a friendly supportive environment. As noted by External Moderators, ’Leaders ensure that the well-being of trainees is a high priority’. As a smaller provider, we are able to treat trainees as individuals and understand that trainees coming into teaching have different background and strengths. \\r\nWith a range of routes into teaching, including SCITT, School Direct and postgraduate apprenticeship, we have a course to suit everyone.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
