{
  "locationType": "University",
  "accrediting": null,
  "provider": "The Manchester Metropolitan University",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "M40/C6X1",
  "providerCode": "M40",
  "programmeCode": "C6X1",
  "schools": [
    {
      "name": "Faculty of Education (Manchester)",
      "address": "Birley Fields, Hulme, Manchester",
      "code": "1"
    }
  ],
  "addresses": [
    {
      "address": "Birley Fields, Hulme, Manchester",
      "geocode": true,
      "formatted_address": "Birley Fields Campus, 53 Bonsall St, Manchester M15 6GX, UK",
      "latitude": 53.4667373,
      "longitude": -2.2464233,
      "post_code": "M15 6GX",
      "city": "Greater Manchester",
      "route": "Bonsall Street",
      "postal_town": "Manchester"
    }
  ],
  "providerAddress": {
    "inst_code": "M40",
    "addr_1": "All Saints Building",
    "addr_2": "All Saints",
    "addr_3": "Manchester",
    "addr_4": "Greater Manchester",
    "postcode": "M15 6BH ",
    "url": "http://www.mmu.ac.uk",
    "geocode": true,
    "formatted_address": "All Saints Building, All Saints, Manchester M15 6BH, United Kingdom",
    "latitude": 53.471068,
    "longitude": -2.238619,
    "post_code": "M15 6BH",
    "city": null,
    "route": null,
    "postal_town": "Manchester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "These are the course fees for 2018/19, may be subject to change for 2019/20",
    "AboutCourse": "Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach across the physical education secondary school curriculum.\\r\n\\r\nWe teach most of our lessons through practical demonstrations and you’ll mainly study with your PGCE Physical Education group. You’ll use sports facilities in the Brooks building and at Platt Lane Sports complex. \\r\n\\r\nWhen you’re at Manchester Met, you’ll learn the methodology of how to teach the full physical education curriculum to support your pupils to develop their skills, understanding and social involvement in sports, including assessment models, differentiation in ability, organisation models and instruction strategies. \\r\n\\r\nYou will also develop your sports subject knowledge to help you grow the physical education curriculum in schools. Some of the sports you’ll learn include rugby, netball, tennis, gymnastics, football, cricket and table tennis. \\r\n\\r\nAll curriculum activities are delivered through practical sessions with physical education specialists. This is to help you learn the skills you’ll need as a teacher and to introduce you to ways of teaching.\\r\n\\r\nThrough this PGCE, you’ll consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona.\\r\n\\r\nYou won’t simply learn theory with us on-campus though – you’ll teach classes in schools too. \\r\n\\r\nYou will spend at least 120 days on placements in schools, gradually increasing your involvement to become  the class teacher.",
    "CourseLength": "OneYear",
    "Qualifications": "2:2 UK Honours degree (or international equivalent), which must support the National Curriculum subject knowledge requirements \\r\n\\r\nFor exceptional candidates, particularly those with substantial relevant work experience in schools/relevant occupations, we consider applications from those with a 3rd class degree.\\r\n\\r\nGCSEs grade C/4 or above in English Language and Mathematics (equivalency tests may be offered). We do not accept the following qualifications as equivalent to GCSE: Adult Numeracy or Literacy, Functional Skills or Key Skills\\r\n\\r\nAll PGCE applicants must pass Professional Skills Tests in Numeracy and Literacy. Check the Department of Education website at (www.education.gov.uk/ get-into-teaching) for the latest updates. \\r\n",
    "FeeInternational": 15550.0,
    "FinancialSupport": "Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available",
    "InterviewProcess": "Part of the process of applying to study a PGCE course with us is for you to join us at Brooks building for an interview where we can get to know you better and you can demonstrate the skills you have that will make you a great teacher. When you are offered an interview, we will send you a detailed information pack containing everything you need to know in order to prepare effectively for your interview, but here is what you can expect.\\r\n\\r\nIf you have applied to study one of our PGCE Secondary courses, you will have a welcome presentation from our Admissions Tutor to start with, followed by a subject-based interview that usually lasts around 30 minutes.  This will be with the subject tutor and a representative from one of our partnership schools.\\r\n",
    "OtherRequirements": "A Disclosure and Barring Service Check and DfE Fitness to Teach test are also required. \\r\n\\r\nSubject to a satisfactory declaration in relation to the Childcare Disqualification Regulation Act 2009 \\r\n",
    "PersonalQualities": "Successful candidates will demonstrate a good understanding of teaching and learning within a secondary school setting. Candidates may wish to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. ",
    "HowSchoolPlacementsWork": "We try to organise a range of school experiences for you across your two core placements. This helps you to develop your practical teaching skills and explore the types of schools you could work in when you graduate.\\r\n\\r\nWe have partnerships with primary and secondary schools across the North West region. As a trainee teacher, you’ll be expected to travel up to 90 minutes to your placement school.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "At Manchester Met, you won’t just develop the practical and organisational skills you’ll need to teach a subject in the classroom. You’ll explore how children learn and factors that can affect the way we learn, from our environment to our teachers.\\r\n\\r\nYou will look at the latest educational research, identifying how research might help you in the classroom, perhaps when you’re dealing with children’s behaviour or you’re investigating if there’s a new way to teach a topic.\\r\n\\r\nWe offer University-led and School-led routes into teaching both Primary and Secondary education.\\r\n\\r\nBoth routes lead to Qualified Teacher Status (QTS) and include 60 masters level credits (a full-time masters degree typically consists of 180 credits, and you can usually put your 60 credits towards your masters).\\r\n\\r\nWe work with over 500 primary schools and over 400 secondary schools across the North West region. This means you could experience placements in inner city or rural settings, mixed or single gender, faith schools, selective or comprehensive schools. This variety helps you to experience different situations and develop your practical skills as a teacher in different settings.\\r\n\\r\nYou can also choose from over 20 secondary subject specialisms. Maybe you’re excited to share your love of Shakespeare or perhaps you can’t wait to hear your year 7 class share their first words in Mandarin. Or, you’re already thinking of all of the incredible science experiments you’ll show your class. \\r\n\\r\nYou will learn in a diverse community of students, replicating the environment you will experience in schools.\\r\n",
    "TrainWithDisability": "A member of staff from Disability Service is often available at MMU Open days and Visit Days to offer advice on disability related issues. However, you can always phone or email us if you have any specific queries. \\r\n\\r\nManchester Metropolitan University is committed to providing equal opportunities in education for all students and will take reasonable steps to meet both the general need for access and the specific needs of individuals with additional support needs. The University works with disabled students to ensure they are not disadvantaged as a result of their disability.\\r\n\\r\nBefore accepting a place, disabled applicants should explore how the university might be able to meet any additional study support or accommodation needs they may have. This should be done at the earliest opportunity by contacting the Disability Service on 0161 247 3491 or (disability.service@mmu.ac.uk)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
