{
  "locationType": "School",
  "accrediting": "Associated Merseyside Partnership SCITT",
  "provider": "Deyes High",
  "subjects": [
    "Design and technology",
    "Design and technology (food)",
    "Secondary"
  ],
  "name": "Design and Technology (Food)",
  "slug": "1CD/2YDM",
  "providerCode": "1CD",
  "programmeCode": "2YDM",
  "schools": [
    {
      "name": "Main Site",
      "address": "Deyes Lane, Liverpool, L31 6DE",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Deyes Lane, Liverpool, L31 6DE",
      "geocode": true,
      "formatted_address": "Deyes Ln, Liverpool L31 6DF, UK",
      "latitude": 53.5147992,
      "longitude": -2.9338323,
      "post_code": "L31 6DF",
      "city": "Merseyside",
      "route": "Deyes Lane",
      "postal_town": "Liverpool"
    }
  ],
  "providerAddress": {
    "inst_code": "1CD",
    "addr_1": "Deyes High School",
    "addr_2": "Deyes Lane",
    "addr_3": "Maghull",
    "addr_4": "Merseyside",
    "postcode": "L31 6DE ",
    "url": "http://amp-scitt.lydiatelearningtrust.co.uk",
    "geocode": true,
    "formatted_address": "Deyes Ln, Liverpool L31 6DE, UK",
    "latitude": 53.5128251,
    "longitude": -2.9396982,
    "post_code": "L31 6DE",
    "city": "Merseyside",
    "route": "Deyes Lane",
    "postal_town": "Liverpool"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "There is also and administrative fee of £60 for a DBS certificate.",
    "AboutCourse": "The AMP SCITT School Direct model is a school based, 100% teacher led training route, where participating schools recruit and select their own trainees with the expectation that they will then go on to work within the Associated Merseyside Partnership (AMP), although there is no absolute guarantee of employment.\\r\nKey aspects of the training:\\r\n* Day one in school- you start on the first day of term as a member of staff, welcomed by your fellow teaching professionals. \\r\n* Develop the skills, enthusiasm and confidence, you need to be a successful teacher of pupils of all abilities through two separate and contrasting placements\\r\n* Build your knowledge of education and your subject specialism through working with practising teachers and the latest educational research.\\r\n* Learn about the wider role of teachers in school and child development.\\r\n* Develop as a reflective practitioner and be fully prepared for your NQT year.\\r\nThis is an intense school led programme. Support is an important part of the training and you will receive personalised coaching that will enable you to set targets and achieve to your highest potential. You will receive support from;\\r\n* School Subject Coach\\r\n* School Professional Mentor\\r\n* SCITT Management team\\r\n* A subject Expert Practitioner\\r\n\\r\nOne of the major strengths is that the training is delivered throughout the course by practising teachers within our schools who are able to model best current practice. The course structure is\\r\n*  37 working weeks in length. \\r\n* Term 1: 4 days a week on school placement and 1 day a week participating in our professional studies programme based at Deyes High School. \\r\n* Term 2 and 3:  5 days a week, in the classroom, teaching. \\r\nThis means trainees will spend up to 150 days of the course actually training in school. \\r\nDuring the course you will also complete a PGCE (60 Master's level credit), assessed by two written assignments. There 12 taught days which are delivered at either Liverpool Hope University or Deyes High School. As a trainee teacher with AMP you will have full access to the Liverpool Hope University, the on-line library and student services to support your academic writing.\\r\nAssessment for the QTS award is through an e-portfolio of evidence of your teaching practise and lesson observations. There are 4 review points across the training year to support your continued development.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Honours Degree  (2:2 classification or above) from a UK higher education institution or equivalent qualification. You should ideally be able to show that 50% of your degree can be related to the subject you wish to teach.  Subject knowledge can be further evidenced by a grade C or above in your chosen subject at A-level.\\r\nGCSE (or equivalents) at grade C / level 5 or above in English Language and Mathematics. \\r\nEquivalency tests are available for applicants and we are happy to recommend suitable courses.\\r\nOverseas applicants will need a NARIC equivalency certificate. [Please click] (https://www.naric.org.uk/naric/)  for further information.\\r\n",
    "InterviewProcess": "The initial stage of selection is reviewing your UCAS application. We ensure your qualifications meet our entry requirements and your personal statement indicates you have a passion for education and your specialised subject. If you are successful, you will be invited to interview hosted at Deyes High School or one of our partner schools. This is usually within 1-2 weeks of receiving your application.\\r\nThe interview process will include the following:\\r\n\\r\n* Tour of the School\\r\n* Opportunity to ask questions/obtain further information\\r\n* An opportunity to work with students in a classroom\\r\n* A subject knowledge interview with a subject specialist\\r\n* A prepared presentation\\r\n* Group Activity\\r\n\\r\nAt AMP SCITT we are looking for candidates who have a good understanding of their specialist subject, but it is just as important that teachers have personal attributes that will help them to relate to young people and enable them to communicate effectively.  Appropriate ICT and interpersonal skills with an awareness of teaching and educational issues is expected for a successful candidate. Based upon the activities listed above, shortlisting may occur and a panel interviews will take place for the successful candidates.\\r\n",
    "OtherRequirements": "You are also required to undertake Professional Skills Tests in Literacy and Numeracy prior to entry to this programme.  These can be completed after interview as successful completion of the Professional Skills Tests will form part of the conditions of any offer of a place by AMPSCITT.  \\r\nAlthough not essential applicants can benefit from relevant school experience. [Click this link] (https://amp-scitt.lydiatelearningtrust.co.uk/get-school-experience/)  for further details.\\r\n",
    "PersonalQualities": "Teachers inspire, that’s just one of the qualities AMP SCITT looks for in our trainee teachers. You need to have the ability to empower students to think critically, be innovative, creative, adaptable, passionate, and flexible. Your interpersonal skills need to encourage and motivate students and you should able to solve problems, self-direct, self-reflect, and lead. ",
    "HowSchoolPlacementsWork": "All trainee teachers are required to complete two contrasting school placements: with AMP SCITT the main placement is known as the Home School.  In Term 2 you will experience a contrasting placement in your Away school for 6-8 weeks, returning to the Home school for the second half of term 2 and the whole of term 3.\\r\nWe have a personalised approach to placement selection. We utilise information from interview to select the most appropriate home school to allow you to develop quickly and then your away school placement is informed by your e-portfolio.  For details of our 27 partner schools please review our website by [clicking here] (https://amp-scitt.lydiatelearningtrust.co.uk/ourpartners/). There will be some scope for trainees to have additional enrichment placements including Special Needs and pupil referral units depending upon your career aspirations and interests. Additionally, AMP SCITT will ensure all Secondary trainees experience post-16 teaching as our course is 11-16 with post 16 enhancement. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Deyes High School is a lead school for Associated Merseyside Partnership SCITT, a strong and collaborative partnership of schools in Merseyside and the wider area with a number of distinctive features to support our trainees.  Our course is led by experienced practising teachers who ensure your learning is completely focused on working with and in schools. We have an excellent training and employment record.  We are proud that the majority of our trainees complete the course graded outstanding and 100% qualify as teachers. Our employment statistics are also impressive. We continue our 100% record of AMP SCITT trainees working in the teaching profession for the start of the new school year.  Trainee satisfaction is also 100%, with end of course evaluations rating the training experience highly. The wide variety of primary and secondary partner schools is a major strength of the consortium. In secondary we can offer trainees a teaching experience in mixed comprehensives, 11-18 schools, Roman Catholic schools, a studio school and Academies. In short AMP has friendly, well equipped schools that offer a wide range of personalised educational experiences.  We understand the needs of Initial Teacher Training and ensure a successful NQT year by creating a supportive community network. Links to all the partner schools can be found on our website in the Welcome section.\\r\nOur trainees graduate with a PGCE with QTS including 60 credits at Post Graduate level towards a Master's degree through Liverpool Hope University.\\r\nTo access our website, [please click here] (http://amp-scitt.lydiatelearningtrust.co.uk )\\r\n",
    "TrainWithDisability": "We endeavour to ensure equality of training and teaching opportunity across our diverse trainee teacher community. AMP SCITT will take reasonable steps to ensure that the general need for access and the specific requirements of individuals with additional support needs are addressed. Our team works with disabled students in order to minimise any potential disadvantage they may face because of their disability. \\r\nMental health and well-being\\r\nAdjusting to a new role can be difficult for some. Stress factors such as moving away from home, course demands and financial worries can all impact on trainees’ mental well-being. We provide support for anyone who is experiencing any form of mental health difficulty. \\r\nCounselling\\r\nWe provide access to a professional and confidential student counselling service to help you with any personal issues that may be affecting your studies, self-esteem, relationships, emotional or general feelings of well-being. \\r\nDisability access\\r\nApplicants who would benefit from disabled access should let us know on their UCAS application so that they can be considered for placements at the most appropriate schools.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "25F"
      }
    ]
  },
  "has_inst": true
}
