{
  "locationType": "School",
  "accrediting": "University of the West of England, Bristol",
  "provider": "Concorde Partnership",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "25X/2Y3Q",
  "providerCode": "25X",
  "programmeCode": "2Y3Q",
  "schools": [
    {
      "name": "Main Site",
      "address": "Fiddlers Wood Lane, Bradley Stoke, Bristol, BS32 9BS",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Fiddlers Wood Lane, Bradley Stoke, Bristol, BS32 9BS",
      "geocode": true,
      "formatted_address": "Fiddlers Wood Ln, Bradley Stoke, Bristol BS32 9BL, UK",
      "latitude": 51.5351425,
      "longitude": -2.544929,
      "post_code": "BS32 9BL",
      "city": "Bradley Stoke",
      "route": "Fiddlers Wood Lane",
      "postal_town": "Bristol"
    }
  ],
  "providerAddress": {
    "inst_code": "25X",
    "addr_1": "Fiddlers Wood Lane",
    "addr_2": "Bradley Stoke",
    "addr_3": null,
    "addr_4": "Bristol",
    "postcode": "BS32 9BS",
    "url": null,
    "geocode": true,
    "formatted_address": "Fiddlers Wood Ln, Bradley Stoke, Bristol BS32 9BL, UK",
    "latitude": 51.5351425,
    "longitude": -2.544929,
    "post_code": "BS32 9BL",
    "city": "Bradley Stoke",
    "route": "Fiddlers Wood Lane",
    "postal_town": "Bristol"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeDetails": "We are not able to support with travel costs, however, all schools are really close to each other – no further than 15-20 minutes travel time from our lead school in Bradley Stoke.",
    "AboutCourse": "You will follow a blended course which sees you attending both the University of the West of England (UWE) and school led training, based at the North Avon Teaching School Alliance (NATSA), and of course, two placements in our schools. We offer the School Direct route to PGCE. Further information can be found at [NATSA](https://www.olympustrust.co.uk/Careers/Get-Into-Teaching-18072017113556/) \\r\nAt UWE you will attend sessions on how to teach your subject and to ensure your subject knowledge continues to develop in order to be able to deliver the National Curriculum at KS3, KS4 and KS5. You will learn how to plan lessons and the main pedagogical theories relating to the delivery of your subject. You will learn in a group with other trainees who are following the university route or training with other school-based providers allowing you share your own experiences and to learn from their experiences in other schools. These are supportive and practical sessions.  More details of this aspect can be found at [UWE](https://www1.uwe.ac.uk/cahe/edu/courses/secondaryite.aspx)\\r\nAt NATSA you will attend sessions focused on your Professional Development, learning all you need to know as a teacher about e.g. safeguarding; behaviour management; how to meet the needs of pupils with Special Educational Needs; assessment, marking and giving good quality feedback; lesson planning; working with parents and other professionals; how to manage workload and keep healthy etc. These sessions and lively, interactive and delivered so you also pick up ideas to use in your lessons in school. They are taught by teachers with many years of classroom experience. \\r\nYou will teach for a minimum of 120 days in two of our schools, although in reality, this is often in excess of 135 days, as we organise our course to maximise your learning in our school settings. You will begin with observing teaching and work your way up to a full 80% teaching load over the year. However, it is not a race! We encourage you to develop at your own speed, focusing on delivering outstanding teaching as you slowly increase your contact time. You will teach at KS3 and KS4 and have access to teaching at Post 16.\\r\nYour teaching will be assessed against the Teaching Standards four times over the year. You will complete around 4 academic assignments (set and marked by UWE tutors); at least two of these at Master’s level. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "*Degree (usually at 2:2 or above)\\r\n*Secondary: GCSE Maths, English at C grade or equivalent \\r\n*Primary: GCSE Maths, English, Science at C grade or equivalent\\r\n*Pass in the numeracy and literacy skills tests\\r\n\\r\nThe English qualification MUST be in English as a first language. If you do not currently have these qualifications, you may still apply to us but must have these in place before you commence the PGCE course.\\r\n",
    "InterviewProcess": "We look at all application forms.  If your academic qualifications are appropriate, your personal statement is convincing (and accurate in terms of grammar) and your references supportive, you will be called to interview.  Interviews will take place in one of our schools. Typically, an interview day will consist of:\\r\n*working with a group of school students\\r\n*the opportunity to talk with students/staff\\r\n*various interview tasks to complete\\r\n*an individual interview\\r\n*the opportunity to demonstrate subject knowledge \\r\n\\r\nSometimes we also include:\\r\n*a tour of the school by our students\\r\n*a group (peer) discussion\\r\n*giving a presentation (probably with peers)\\r\n\\r\nYou will be interviewed by one of our ITT co-ordinators and either the Headteacher or Head of Department from the school you are interviewed at. If you need to prepare any materials you will be informed of this beforehand, however, we make no apologies for asking you to sometimes ‘think on your feet’ as this is an essential skill you will need for teaching! You will be told if you are going to be offered a place as soon as we have decided – often by the following day.\\r\nThis may seem a rigorous process, but we want to choose the best candidates to train at the North Avon Teaching School Alliance.  We want prospective teachers who are enthusiastic and passionate about their subject, committed to a career in teaching and ready to face the challenges of the training year.\\r\n",
    "OtherRequirements": "*Complete the DBS process and health checks\\r\n*At least 5 days of relevant, recent school experience in a state school.\\r\n*Pass the Literacy and Numeracy Professional Skills tests \\r\n*You may need to complete an additional Subject Knowledge Enhancement course if, e.g., your first degree is different from the subject you wish to teach; you are applying to do the PE with Ebacc course; you are applying to do Design Technology. These courses are fully funded and often have a bursary attached. They are intended to deepen or extend your subject knowledge prior to teaching. This will be discussed at interview.\\r\n",
    "PersonalQualities": "We are looking for creative and dynamic individuals who can motivate and inspire young people. \\r\nResilience, good communication and inter-personal skills, determination, self-awareness and a willingness to learn through success and mistakes are essential personal attributes for a career in teaching. Being well-organised and reflective will help you to progress quickly.\\r\nWe expect applicants to come from a wide range of backgrounds and have a wide range of skills. Whether you are coming straight from university or making a career change, all are very welcome; we believe our School Direct Programme is enriched by this variety. \\r\n",
    "HowSchoolPlacementsWork": "We select your teaching placements by considering your strengths, attributes and skills for your first placement. When we have got to know you a little more we then carefully select your second placement to allow you to develop still further. \\r\nAll our schools are within South Gloucestershire, the furthest being 16 miles from our lead school, Bradley Stoke Community School, however, most are within 15 minutes travelling time. They vary from urban, suburban to rural in nature.\\r\nAll schools are comprehensive and mixed schools with our primaries covering Early Years to Y6 and all our secondaries are 11-18 and all have Post 16 provision. We have 11 secondary schools and 9 primary schools. You will spend at least 120 days in school over the year – often very much more than this as we are deeply committed to a schools-based training programme. \\r\nYou will be placed in two schools over your training, generally in two separate, consecutive blocks of time.\\r\nThese are the schools we work with at Secondary– links to their websites and a brief description of each school is available on our website [NATSA](https://www.olympustrust.co.uk/Careers/Get-Into-Teaching-18072017113556/) \\r\n\\r\nAbbeywood Community School\\r\nBradley Stoke Community School\\r\nBrimsham Green School\\r\nBristol Technology and Engineering Academy\\r\nThe Castle School, Thornbury\\r\nChipping Sodbury School\\r\nDownend School\\r\nMangotsfield School\\r\nMarlwood School, Alveston\\r\nPatchway Community School\\r\nWinterborne Academy\\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The North Avon Teaching School Alliance brings together two very highly regarded consortia based in the north of the city of Bristol and South Gloucestershire: Castle Consortium and Concorde Partnership. Most of the schools are members of two local Academy Trusts, Castle School Education Trust (CSET) and Olympus Academy Trust (OAT). Further information can be found at [NATSA](https://www.olympustrust.co.uk/Careers/Get-Into-Teaching-18072017113556/) \\r\nWe work closely with local universities to provide high quality Initial Teacher Training. We offer our own School Direct PGCE courses accredited by Bath Spa University and the University of the West of England. Trainees on the School Direct programme will be awarded PGCE and QTS at the end of the training year, with perhaps the possibility of being employed by one of our schools.\\r\nWe are committed to developing teachers to serve our local communities and our Teaching School reflects our passion for and expertise in developing teachers and support staff in our institutions and beyond; providing excellent Continuing Professional Development in teaching and learning, career development and leadership skills at all stages and levels of teaching and education.\\r\nWorking together allows us to provide a wide range of placements for PGCE trainees in the North Avon area in both secondary and primary phases; we have schools which are urban, suburban and rural in nature – all are comprehensive. By applying for a place on the School Direct route you will be placed in one of our schools for each of your two teaching placements.\\r\n\\r\n",
    "TrainWithDisability": "We welcome applications from anyone interested in training to teach.\\r\nIf you have additional needs, we will support you in your training. The universities we work with have excellent student support teams to facilitate you in accessing training and to provide additional support for, e.g. written assignments. \\r\nAll of our schools are fully accessible and we pride ourselves on our inclusivity for both our pupils and staff. \\r\nOver the years we have trained teachers with a range of additional needs from medical needs, to ASD through to high level dyslexia. We are also keen to support trainees with mental health needs, again, through accessing university support or by being involved in our active staff wellbeing programmes in our schools.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "B80"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "B20"
      }
    ]
  },
  "has_inst": true
}
