{
  "locationType": "University",
  "accrediting": null,
  "provider": "Liverpool John Moores University",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "L51/X9C6",
  "providerCode": "L51",
  "programmeCode": "X9C6",
  "schools": [
    {
      "name": "Main Site",
      "address": "IM Marsh Campus, Barkhill Road, Aigburth, Liverpool, L17 6BD",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "IM Marsh Campus, Barkhill Road, Aigburth, Liverpool, L17 6BD",
      "geocode": true,
      "formatted_address": "Barkhill Rd, Merseyside, Liverpool L17 6BD, UK",
      "latitude": 53.3705676,
      "longitude": -2.9195544,
      "post_code": "L17 6BD",
      "city": "Merseyside",
      "route": "Barkhill Road",
      "postal_town": "Liverpool"
    }
  ],
  "providerAddress": {
    "inst_code": "L51",
    "addr_1": "Roscoe Court",
    "addr_2": "4 Rodney Street",
    "addr_3": "Liverpool",
    "addr_4": "Merseyside",
    "postcode": "L17 6BD ",
    "url": "http://www.ljmu.ac.uk",
    "geocode": true,
    "formatted_address": "2 Rodney St, Merseyside, Liverpool L1 2UA, UK",
    "latitude": 53.4033069,
    "longitude": -2.9731465,
    "post_code": "L1 2UA",
    "city": "Merseyside",
    "route": "Rodney Street",
    "postal_town": "Liverpool"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Physical Education course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of physical education; these staff are supported by expert practitioners from local schools.\\r\n\\r\nOur excellent teaching facilities, including a sports hall and gymnasium with extensive resources and equipment, will provide the setting for your practical teaching.\\r\n\\r\nThe content of the programme is grounded in the evidence-based principles of teaching and learning. You will examine a range of pedagogical approaches to physical education teaching, including workshop-led and informal approaches to learning. Other teaching methods include a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Liverpool John Moores University (LJMU) has a long established reputation for providing high quality Teacher Training, working in close Partnership with over 300 committed, welcoming and diverse schools across the North West. \\r\n\\r\nOur academic team is made up of successful teachers who maintain strong links with schools and professional bodies, ensuring you receive the most up-to-date training during your course. Our most recent OFSTED inspection acknowledged that: “all trainees are very well prepared to teach their chosen age range and specialist subject”. Employment rates are consistently above average for the sector.\\r\n\\r\nMost Teacher training courses offer a PGCE Award which is worth 60 credits at Masters Level. LJMU, is one of a small number of teacher training providers that offers a Post Graduate Diploma in Education and Qualified Teacher Status. This means that our beginning teachers graduate with 120 Masters level credits. Many  go on to complete a Masters in Education Practice during their early career.\\r\n\\r\nOur emphasis is on developing inclusive and reflective practitioners. Our courses ensure that LJMU teachers develop a deep understanding of the curriculum, learners and learning. This enables them to provide the very best and most appropriate learning opportunities for all children and young people, with a positive impact on all learners’ development and achievements. \\r\n\\r\nSchool-based experience takes place largely in a Home School, supported by  mentors. Shorter placements are also provided in contrasting school settings. This variety ensures that our students can confidently plan, teach and manage learning in different settings and socio-economic contexts.\\r\n",
    "TrainWithDisability": "LJMU is committed to Equality of Opportunity and proud of the help we offer. The Disability Advice Team will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and disclosing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165.\\r\n\\r\n If you need an Individual Student Learning Plan (ISLP) which sets out the type of support you may need and who is responsible for ensuring your support is in place, this will be put in place by an LJMU Disability Adviser once you have met to discuss your needs. Once finalised, your plan will be sent to you via email. As soon as you have agreed the ISLP it will be sent to your Disability Coordinator and then, with your agreement, passed on to the relevant academic and support staff.\\r\n\\r\nAll trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments, both at LJMU and within our Partner Schools. As part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with our Occupational Health Unit. This is designed to ensure that arrangements are in place, from the outset, to support any students who may need additional support or reasonable adjustments to be made.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
