{
  "locationType": "School",
  "accrediting": "University of Derby",
  "provider": "Fairfields Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1L3/24ZM",
  "providerCode": "1L3",
  "programmeCode": "24ZM",
  "schools": [
    {
      "name": "Main Site",
      "address": "Trinity Avenue, Northampton, NN2 6JN",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Trinity Avenue, Northampton, NN2 6JN",
      "geocode": true,
      "formatted_address": "Trinity Ave, Northampton NN2 6JN, UK",
      "latitude": 52.2547009,
      "longitude": -0.8905693,
      "post_code": "NN2 6JN",
      "city": "Northamptonshire",
      "route": "Trinity Avenue",
      "postal_town": "Northampton"
    }
  ],
  "providerAddress": {
    "inst_code": "1L3",
    "addr_1": "Fairfields Teaching School Alliance",
    "addr_2": "Trinity Avenue",
    "addr_3": null,
    "addr_4": "Northampton",
    "postcode": "NN2 6JN ",
    "url": "http://fairfields.northants.sch.uk",
    "geocode": true,
    "formatted_address": "Trinity Ave, Northampton NN2 6JN, UK",
    "latitude": 52.2537089,
    "longitude": -0.8883956,
    "post_code": "NN2 6JN",
    "city": "Northamptonshire",
    "route": "Trinity Avenue",
    "postal_town": "Northampton"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Fees are made payable to the University of Derby.",
    "AboutCourse": "The programme is a school-based localised training.\\r\n\\r\nTrainees will spend approximately 7 days at the University of Derby with a focus on 2 level 7 modules.\\r\n\\r\nThe course is school based with a main placement and a second placement over the Spring term.  The second placement is in an alternative key stage to the main placement.\\r\n\\r\nLocalised training takes place at The Hunsbury Hill Centre, Northampton for 2 days a fortnight which covers all aspects of the Teacher Standards and the primary curriculum, allowing trainees to put their training into practise at their placement schools.\\r\n\\r\nWe offer a 2 week enhancement period, offering experiences in secondary schools, EAL, EYFS and special schools.\\r\n\\r\nTrainees can select from a 3-7 route specialising in EYFS and KS1 or a 5-11 route focused on KS1 and KS2.",
    "CourseLength": "OneYear",
    "Qualifications": "English, maths and science GCSE - grade C or above.\\r\n(equivalencies can be found on the University of Derby website).\\r\n\\r\nA UK honours degree at 2:2 or above.\\r\n\\r\nCompletion of the numeracy and literacy skills tests and full DBS checks will need to be completed and passed before enrolment on the course.",
    "InterviewProcess": "Our interview process covers 2 experiences - school based engagement and a formal interview.\\r\n\\r\nStage 1 - school based engagement\\r\nCandidates will spend time in a local school interacting with a class and be observed on how they engage with learners throughout the experience.\\r\n\\r\nStage 2 - formal interview\\r\nCandidates will be asked to complete a Maths and English indicative test and complete a formal panel interview with the Teaching School lead, School Direct coordinator and local Head Teacher.",
    "OtherRequirements": "DBS check\\r\nPassing numeracy and literacy skills tests\\r\n\\r\nHealth questionnaires will be carried out for those successful at interview.\\r\n\\r\nCandidates must provide 2 good references - one academic and one professional.",
    "PersonalQualities": "We are looking for candidates who have a passion for teaching and encouraging growth and development in learners.\\r\n\\r\nWe are looking for potential trainees with an interest in education and an awareness of what life in a school is like for a teacher, showing understanding of the career pathway.\\r\n\\r\nPersonal attributes include; good organisational skills, excellent communication skills and confidence.",
    "HowSchoolPlacementsWork": "Placement schools for trainees are selected based on experience with ITT, locality and alliance membership.  We work with over 77 different schools to provide placements to meet the needs of our trainees.\\r\n\\r\nCandidates will have 2 placements, their main placement in the Autumn and Summer term and a second placement over the Spring term."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Fairfields Teaching School Alliance is a truly inclusive training provider.  We have an excellent track record of 100% of trainees achieving QTS with 2018 figures showing 100% good or outstanding outcomes.\\r\n\\r\nOur alliance is based at the Outstanding (2018) Fairfields School in Northampton and works with a vast range of local schools and we offer opportunities for placements at special schools and mainstream schools.\\r\n\\r\nWe offer both the tuition fee and salaried training routes with a focus on localised and needs based training.\\r\n\\r\nWe work with the University of Derby, an Outstanding ITT provider.\\r\n\\r\nPlease contact us through teachingschool@fairfields.northants.sch.uk and we would be happy to answer your questions.",
    "TrainWithDisability": "As a special school, being inclusive is at the heart of everything we do.\\r\n\\r\nWe treat all of our trainees as individuals and cater for all needs for successful candidates.  Our vast range of schools allow us to prepare bespoke placements if needed.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "With a rich heritage in teacher training dating back over 150 years, the University of Derby has a strong reputation for nurturing successful, confident and forward-thinking primary teachers.\\r\n\\r\nIn our 2015 Ofsted inspection, they received an ‘outstanding’ rating for the quality of their work. The Primary Leadership Team was praised for putting students at the heart of all they do and for ensuring they have excellent career outcomes.\\r\n\\r\nStudents were described as “highly motivated and passionate about working with children,” keen to be fully involved in the everyday life of schools.",
        "UcasInstitutionCode": "D39"
      }
    ]
  },
  "has_inst": true
}
