{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Chichester",
  "subjects": [
    "German",
    "Languages",
    "Secondary",
    "Spanish"
  ],
  "name": "Modern Languages (German with Spanish)",
  "slug": "C58/2TRD",
  "providerCode": "C58",
  "programmeCode": "2TRD",
  "schools": [
    {
      "name": "Bognor Regis Campus",
      "address": "Upper Bognor Road, Bognor Regis, West Sussex, PO21 1HR",
      "code": "B"
    }
  ],
  "addresses": [
    {
      "address": "Upper Bognor Road, Bognor Regis, West Sussex, PO21 1HR",
      "geocode": true,
      "formatted_address": "Upper Bognor Rd, Bognor Regis PO21 1HR, UK",
      "latitude": 50.7881893,
      "longitude": -0.6658381999999999,
      "post_code": "PO21 1HR",
      "city": "West Sussex",
      "route": "Upper Bognor Road",
      "postal_town": "Bognor Regis"
    }
  ],
  "providerAddress": {
    "inst_code": "C58",
    "addr_1": "Bishop Otter Campus",
    "addr_2": "College Lane",
    "addr_3": "Chichester",
    "addr_4": "West Sussex",
    "postcode": "PO19 6PE",
    "url": "http://www.chi.ac.uk",
    "geocode": true,
    "formatted_address": "College Lane, Chichester PO19 6PE, United Kingdom",
    "latitude": 50.84493000000001,
    "longitude": -0.775787,
    "post_code": "PO19 6PE",
    "city": null,
    "route": null,
    "postal_town": "Chichester"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "The programme is delivered full-time over 38 weeks with 70% practical school experience in established partner schools and 30% university-based time, divided between Professional Studies and subject study.\\r\n\\r\nThis experience provides you with the opportunity to work alongside serving teachers, learning about the broader roles and skills of teachers and other school staff.\\r\n\\r\nThe course is assessed through observation during teaching placements and written assignments. \\r\n\\r\nTo gain a Postgraduate Certificate in Education (PGCE) students need to complete three 4,000 word assignments at FHEQ level 7 (Masters), and two blocks of School ExperienceIn addition to your subject specialism, you’ll study a Professional Studies element of the course, which includes:\\r\n\\r\n    Professionalism in Education\\r\n    Identity, Equality and Inclusion\\r\n    Closing the gap in access and achievement\\r\n    Reflective practice\\r\n    Positive behaviour management\\r\n    Working with learning support assistants\\r\n    English as an additional language\\r\n    Child protection and Prevent\\r\n    Pastoral care in schools\\r\n    Literacy and numeracy across the curriculum\\r\n    Research skills\\r\n    The relationship between theory and practice\\r\n    Special Educational Needs\\r\n    Vocal skills\\r\n    Applying for teaching posts\\r\n    Personal, Social and Health Education\\r\n    Building rapport and resilience\\r\n",
    "HowSchoolPlacementsWork": "Over the duration of your course you will spend 24  weeks on placement. These school experiences are organised  in our partnership schools which extend across East & West Sussex, Hampshire and Isle of Wight and into Surrey. Travel to placements, which  can be by car or public transport, varies but your commute will not usually  exceed 1 hour from your term time address to the placement school (assuming your term time address is within our partnership area). \\r\n\\r\nStudents not in receipt of a government bursary may receive a contribution towards travel costs depending upon the distance.\\r\n\\r\nWhilst on School Experience appropriate professional dress will be required.\\r\n\\r\nStudents may wish to purchase a laptop/tablet to use whilst on school experience as schools are not required to provide these. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are recognised as one of the leading institutions in the country for teacher training, we have a long and distinguished record of training teachers dating back to 1839.\\r\n\\r\n  - We offer high-quality training and experience that will prepare you to become a confident and effective teacher\\r\n  -  Much of your training will be practical, school-based experiences\\r\n   - You’re supported throughout your school-based learning by experienced mentor teachers and university tutors\\r\n   - You’ll gain a respected professional qualification in a career of major importance\\r\n  -  You’ll learn how to use research to improve your teaching skills\\r\n  -  Our courses have varied content, including: lectures, seminars, presentations, group tasks, mini-research projects and assessments\\r\n  -  You’ll develop a range of communication, interpersonal and problem-solving skills that will be invaluable in a teaching career and beyond\\r\n -   Political and public policy announcements are built into the curriculum, so you will be up to date on contemporary teaching issues.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
