{
  "locationType": "School",
  "accrediting": "Goldsmiths, University of London",
  "provider": "Catholic Teaching Alliance (South East London)",
  "subjects": [
    "Art and design",
    "Secondary"
  ],
  "name": "Art and Design",
  "slug": "134/2HCD",
  "providerCode": "134",
  "programmeCode": "2HCD",
  "schools": [
    {
      "name": "Saint John Bosco College",
      "address": "Parkham Street, Battersea, London, SW11 3DQ",
      "code": "3"
    },
    {
      "name": "Bonus Pastor Catholic College",
      "address": "Winlaton Road, Bromley, BR1 5PZ",
      "code": "B"
    },
    {
      "name": "St Ursula's Convent School",
      "address": "70 Croom's Hill, Greenwich, London, SE10 8HN",
      "code": "U"
    },
    {
      "name": "Virgo Fidelis Convent Senior School",
      "address": "Upper Norwood, London, SE19 1RS",
      "code": "V"
    }
  ],
  "addresses": [
    {
      "address": "Parkham Street, Battersea, London, SW11 3DQ",
      "geocode": true,
      "formatted_address": "Parkham St, London SW11 3JL, UK",
      "latitude": 51.47510210000001,
      "longitude": -0.1719899,
      "post_code": "SW11 3JL",
      "city": "Greater London",
      "route": "Parkham Street",
      "postal_town": "London"
    },
    {
      "address": "Winlaton Road, Bromley, BR1 5PZ",
      "geocode": true,
      "formatted_address": "Winlaton Rd, Bromley BR1 5PZ, UK",
      "latitude": 51.4273373,
      "longitude": -0.0019047,
      "post_code": "BR1 5PZ",
      "city": "Greater London",
      "route": "Winlaton Road",
      "postal_town": "Bromley"
    },
    {
      "address": "70 Croom's Hill, Greenwich, London, SE10 8HN",
      "geocode": true,
      "formatted_address": "Greenwich Park, London SE10 8XJ, UK",
      "latitude": 51.4769095,
      "longitude": 0.0014643,
      "post_code": "SE10 8XJ",
      "city": "Greater London",
      "route": null,
      "postal_town": "London"
    },
    {
      "address": "Upper Norwood, London, SE19 1RS",
      "geocode": true,
      "formatted_address": "Central Hill, London SE19 1RS, UK",
      "latitude": 51.4215139,
      "longitude": -0.0945017,
      "post_code": "SE19 1RS",
      "city": "Greater London",
      "route": "Central Hill",
      "postal_town": "London"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "EU and home students can apply to the Student Loans Company for a tuition fee loan.",
    "AboutCourse": "Why should I join the CTA?\\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Teaching Alliance is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\\r\n\\r\nWe at the CTA are passionate about developing a generation of outstanding teachers and want to provide as much support as we can to ensure committed, enthusiastic and capable people make it on to our teacher training scheme. We offer excellent teacher training in partnership with UCL, with all courses resulting in a PGCE qualification. \\r\n\\r\nWe run an extensive CPD programme including two Early Career Conferences in the autumn and summer terms and School Study Visits in the spring term, providing networking opportunities and the chance to observe teaching in other schools within the Catholic Teaching Alliance,  in line with both your university studies and personal areas of development. Opportunities for school-based research and reflection, along with the sharing of outstanding expertise within a business-like model form the heart of our work.\\r\n\\r\nAn induction programme will be provided in school to supplement your university provision. The weekly sessions will cover a range of topics relevant to your training, including safeguarding; lesson planning, marking, and pastoral aspects such as the role of a form tutor. You will be fully involved in the life of the school attending parents' evenings and participating in school trips,\\r\n\\r\nAbout the University Course\\r\nCourses last for one full academic year (September - July) and involve two placements (please see additional information below).  Successful completion leads to a PGCE with Qualified Teacher Status (QTS).\\r\n\\r\nThis secondary programme prepares you to teach art and design. You are shown how to plan, resource and organise lessons, and how to monitor, record, evaluate and assess the art practices of students. Workshops, lectures and seminars are conducted by Goldsmiths lecturers, artist teachers and gallery/arts educators.\\r\n\\r\n[Art and Design at Goldsmiths](https://www.gold.ac.uk/pgce/secondary-art-design/) \\r\n\\r\nYou will attend university training days  with other School Direct and PGCE students. On the Tuition Fee routes you will carry out academic assignments leading to the award of 60 masters level credits.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Subject Specific Requirements\\r\nAn undergraduate degree (eg BA, BSc etc) at 2.2 or above with honours. \\r\n\\r\nArt and Design \\r\n* A degree in a related subject e.g. fine/visual art, graphic design, illustration, architecture, filmmaking, animation, ceramics or textiles. \\r\n* Evidence of drawing skills. \\r\n\\r\nGCSE English and Maths \\r\nAll applicants must possess a grade C/ grade 4 in GCSE English and Maths. Other qualifications classified as equivalent by UK NARIC will also be accepted. Where applicants do not possess a grade C in both subjects they must take and pass an equivalency test prior to commencing the course.",
    "InterviewProcess": "At the CTA we are looking for candidates who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools.  \\r\n\\r\nWhen applying please select your preferred school.  All applications submitted on UCAS are vetted upon receipt. Once your application has passed this process you will be invited to an interview at the location to which you have applied.\\r\n\\r\nThe interview day will include a tour of the school and a panel interview. Some time may also be spent in a class with the Head of Department where a school can arrange this. \\r\n\\r\nWe follow the Enhanced route for School Direct with Goldsmiths University with all of the interview tasks being conducted in school. A member of the teaching team from Goldsmiths may also attend your interview. You will be asked to complete a number of tasks including a numeracy, literacy and subject knowledge task. Your interview for Art and Design will also consist of a creative element. Further information will be provided when details of the interview date are sent to you. \\r\n\\r\nAfter interview, the University and the Lead School will jointly reach a final decision regarding any offer.\\r\n\\r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. \\r\n",
    "OtherRequirements": "Satisfactory occupational health check from your GP, plus the return of completed self-declaration of suitability form. Please refer to the [Fitness to Train](https://www.gold.ac.uk/fitness-to-train/) section of the Goldsmiths website for further information on the required checks. \\r\n\\r\nAlthough not compulsory, at least one day of school observation is recommended prior to application, preferably with the same age group you’d like to work with i.e. primary or secondary\\r\n\\r\nA pass in the professional skills tests for trainee teachers and providing original certificates of academic qualifications to the admissions office. ",
    "HowSchoolPlacementsWork": "School Direct trainees start at their chosen school during the first week of the autumn term. Term dates will be confirmed upon acceptance of an offer. \\r\n\\r\nUniversity sessions usually start on the Friday of that week and will be offered in a number of blocks at the start of each term in addition to one day a week . As with all PGCE courses you will be expected to attend all university sessions.  The course runs from September to June and trainees will spend 120 days in school over the course of the year.\\r\n\\r\nWe offer an ABA placement structure with Goldsmiths and you will spend 6 weeks in the spring term a contrasting school. You will be allocated a Subject Mentor and Professional Co-ordinating Mentor in each school and both placements will be hosted in Catholic Schools. \\r\n\\r\nAround half of the 38 schools within the Catholic Teaching Alliance offer training placements. Those who are able to support the main placement are listed for each respective course. \\r\n\\r\nAt the start of the training year we will contact all registered trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\\r\n\\r\nWe are able to offer contrasting placements in single-sex or mixed schools and in schools with sixth forms where your main placement school is 11-16.  Where you have completed a placement in a single-sex school your second placement will be in a mixed school or a school with students of the opposite sex.\\r\n\\r\nYour tutor from Goldsmiths will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your university tutor will carry out your final assessment in school against the national Teachers’ Standards."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Catholic Teaching Alliance (CTA) is a strong and growing alliance of 38 schools. It is a cross-phase partnership from primary, through to secondary and sixth form colleges. Our partner schools are based throughout South-East London and Kent covering Southwark, Lewisham, Bromley, Bexleyheath and Chatham. This diversity in type of school and location gives a richness to our shared work. Our shared vision is Growing Teachers, Growing Learners, Growing Schools. \\r\n\\r\nOur schools have a long history of Initial Teacher Education and have offered School Direct places since the initiative began. We have selected several universities that match our ethos. By carefully selecting the right universities to work with we are able to offer you an excellent start to your career in education. \\r\n\\r\nWe offer both Primary Salaried and Tuition Fee School Direct places and are able to provide training in a range of secondary subjects. Some subjects are available with a choice of provider. \\r\n\\r\nWe run an extensive CPD programme for trainees and most secure an NQT position within the group of schools. We also provide flexibility as your career progresses, with opportunities to move between schools.\\r\n\\r\nWe would encourage applicants to contact us to arrange a school tour prior to application and we are happy to answer any questions that you may have. Please contact the CTA Co-ordinator, [Clare Barclay](c.barclay@catholicteachingalliance.org.uk) for more information or visit our website [here](https://catholicteachingalliance.org.uk/) to find out more about our schools and the career opportunities that we are able to offer. \\r\n",
    "TrainWithDisability": "All School Direct trainees must meet the Secretary of State's requirements for physical and mental health,  but few health problems past or present preclude applicants from teaching. \\r\n\\r\nThe activities that a teacher must be able to perform are set out in the [Education (Health Standards) (England) Regulations 2003](http://www.legislation.gov.uk/uksi/2003/3139/pdfs/uksi_20033139_en.pdf). \\r\n\\r\nWe welcome applications from people with additional needs and disabilities.  Successful applicants will be asked to complete a fitness questionnaire prior to commencing the programme. \\r\n\\r\nWithin our group of 38 schools, we are able to provide support for a range of disabilities and other needs and are usually able to arrange appropriate school placements and additional support as required. We have trained applicants with dyslexia, physical, hearing and visual impairments, as well as students with mental health issues. If you have any questions about health, disability, or the support provided or wish to discuss your own requirements further, please contact the CTA Co-ordinator, Clare Barclay, c.barclay@catholicteachingalliance.org.uk. \\r\n\\r\nFor further information on the support provided by our university partners please see the links below.\\r\n\\r\nGoldsmiths University\\r\n[Disability Service](https://www.gold.ac.uk/students/disability-support/support-when-applying/)\\r\n\\r\nKing's College London\\r\n[Disability Access:](http://www.kcl.ac.uk/campuslife/services/disability/index.aspx)\\r\n\\r\nSt Mary's University\\r\n[Student Wellbeing Service](https://www.stmarys.ac.uk/student-support/wellbeing/about.aspx)\\r\n\\r\nUniversity College London\\r\nSchool Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information [here](https://www.ucl.ac.uk/students/disability-support)\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Goldsmiths, University of London have been training teachers since 1904 and are renowned as a leader in the field of educational research and teacher training. Goldsmiths work in close collaboration with a range of partner schools across London, in both teacher training and research. Goldsmiths programmes have a strong emphasis on active learning, creativity, inclusion and languages and graduates benefit from excellent employment opportunities. They have internationally recognised professors in their Educational Studies Department, including Michael Rosen. Goldsmiths campus is set in vibrant New Cross, with excellent London Overground, National Rail and bus links into central London.  [Goldsmiths School Direct](https://www.gold.ac.uk/educational-studies/schooldirect/)",
        "UcasInstitutionCode": "G56"
      },
      {
        "Description": "Experience: King’s has been training teachers for over 120 years and has developed a reputation for excellence in its training methods. The PGCE academics are qualified teachers themselves and are highly experienced in teacher training.\\r\n\\r\nReputation: King’s has developed a reputation for excellence in both training methods and the standards of new teachers we train. At the most recent Ofsted inspection King’s was graded 'Outstanding'.\\r\n\\r\nLocation: Based in the heart of London, King’s is surrounded by landmarks and cultural institutions that we incorporate into our training. Transport links are extensive as the campus is only minutes from Waterloo station.\\r\n\\r\n[KCL](https://www.kcl.ac.uk/sspp/departments/education/study/schooldirect/Index.aspx)",
        "UcasInstitutionCode": "K60"
      },
      {
        "Description": "Established in 1850 as a Catholic teacher training college, St Mary’s has a long-standing reputation for academic excellence and the granting of university title is an exciting milestone in its history. With an original intake of just six students, St Mary’s has now grown to around 6,000 undergraduate and postgraduate students across the four academic Schools. St Mary’s prepares its students for flourishing lives, successful careers and social commitment through excellent, research-enriched teaching in a strong community of mutual respect based on our Catholic ethos and identity.\\r\n\\r\n[School Direct at St Mary’s University](http://www.stmarys.ac.uk/education-theology-and-leadership/school-direct-information-for-trainees.htm)\\r\n",
        "UcasInstitutionCode": "S64"
      },
      {
        "Description": "UCL Institute of Education is the world’s leading centre for research and teaching in education and related social sciences. You can view UCL’s online teacher training prospectus is here:-\\r\n[UCL](https://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes)",
        "UcasInstitutionCode": "U80"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "C10"
      }
    ]
  },
  "has_inst": true
}
