{
  "locationType": "University",
  "accrediting": null,
  "provider": "Bishop Grosseteste University",
  "subjects": [
    "Chemistry",
    "Science",
    "Secondary"
  ],
  "name": "Science with Chemistry",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "B38/F2X1",
  "providerCode": "B38",
  "programmeCode": "F2X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Bishop Grosseteste College, Lincoln, Lincolnshire, LN1 3DY",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Bishop Grosseteste College, Lincoln, Lincolnshire, LN1 3DY",
      "geocode": true,
      "formatted_address": "Bishop Grosseteste College, Lincoln LN1 3DY, UK",
      "latitude": 53.243995,
      "longitude": -0.5357153,
      "post_code": "LN1 3DY",
      "city": "Lincolnshire",
      "route": null,
      "postal_town": "Lincoln"
    }
  ],
  "providerAddress": {
    "inst_code": "B38",
    "addr_1": "Admissions",
    "addr_2": null,
    "addr_3": "Lincoln",
    "addr_4": "Lincolnshire",
    "postcode": "LN1 3DY ",
    "url": "http://www.bishopg.ac.uk",
    "geocode": true,
    "formatted_address": "Lincoln, UK",
    "latitude": 53.230688,
    "longitude": -0.5405789999999999,
    "post_code": null,
    "city": "Lincoln",
    "route": null,
    "postal_town": "Lincoln"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The PGCE Secondary course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable trainees to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. All trainees undertaking the University-led PGCE route into teaching will work towards securing 60 Master’s level credits. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. Trainees on the PGCE Secondary programme will be well supported in becoming critically reflective teachers capable of inspiring their pupils to learn, achieve and flourish.\\r\n\\r\nAt the University of Hertfordshire, trainees will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for trainees to learn about pedagogical approaches relevant to their subject specialism and the professional responsibilities of all teachers.\\r\n\\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT).",
    "CourseLength": "OneYear",
    "Qualifications": "Honours degree (2.2 or higher), awarded by a UK university or an overseas award recognised as equivalent by NARIC.\\r\n\\r\nUsually we would expect the degree to have a minimum 50% content of the subject in which the applicant is applying. However, applicants whose degree does not meet this requirement should contact us to discuss further.\\r\n\\r\nEnglish Language and mathematics GCSE  grade 4 or above (grade C under the old grading structure).\\r\n\\r\nStudents from non-majority English speaking countries require proof of English language proficiency, equivalent to an overall IELTS Academic score of 6.5 with a minimum of 6.0 in each band. ",
    "InterviewProcess": "Suitability to train to teach is assessed at interview. \\r\n\\r\nWe are looking to select trainees who:\\r\n\\r\n* have the passion, commitment and enthusiasm to teach in secondary schools\\r\n* are resilient and able to work under pressure\\r\n* have good subject knowledge to train to teach in the area they are interested in\\r\n\\r\nThe day will begin with a talk about the PGCE programme and is followed by you completing a short written task. You will then lead a short lesson in your subject discipline, details will be sent with the letter inviting you to interview. Finally there is an individual interview.\\r\n\\r\n",
    "OtherRequirements": "You will be required to pass the [Professional Skills tests](http://sta.education.gov.uk/) in literacy and numeracy before starting the course.\\r\n\\r\nYou will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\\r\n\\r\nWe recommend that you undertake observation time in a state secondary school prior to interview but this is not essential. [Activities to support observation in school - either before or after interview - that you may find useful](https://www.herts.ac.uk/__data/assets/pdf_file/0006/164436/Secondary-School-experience-tasks.pdf)\\r\n\\r\n",
    "PersonalQualities": "Through the application and interview process, you will need to demonstrate your passion for teaching and potential to lead learning. Excellent interpersonal and communication skills are vital in classrooms of today alongside the ability to be organised, adaptable and resilient. As a successful candidate you will be able to provide evidence of empathy, respect and an inclusive attitude. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Bishop Grosseteste University (BGU) has been educating students in the historic heart of Lincoln for over 150 years. Our beautiful campus is located just a few minutes’ walk from Lincoln Cathedral, Castle and the old Roman city. \\r\n\\r\nWe’re exceptionally proud that over the past 150 years, our commitment to first-class teacher training has remained consistent. Life after BGU is also extremely important to us and we offer many different methods of support for our trainees as they begin their teaching careers. Figures released by the Higher Education Statistic Agency (HESA) in July 2018 show that 97% of BGU graduates find work or are continuing to study six months following graduation. \\r\n\\r\nWe were also recently rated Gold in the first ever Teaching Excellence Framework (TEF) assessment, one of only a few universities from across the UK given the top award, demonstrating that we deliver consistently outstanding teaching, learning and outcomes for our students. We organise school placements for our trainees in a diverse range of partnership schools located across the East Midlands and ensure our teacher training both in schools and at the University allows trainees to develop an extensive understanding of every aspect of teaching. \\r\n",
    "TrainWithDisability": "We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. \\r\n\\r\nOur Student Advice team plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, along with students with specific learning differences or other access needs, before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\\r\n\\r\n* Specific learning differences including dyslexia\\r\n* Physical mobility difficulties\\r\n* Hearing impairments\\r\n* Visual impairments\\r\n* Persons requiring personal care\\r\n* Autistic Spectrum Disorders including Asperger’s Syndrome\\r\n* Mental health difficulties\\r\n* Medical conditions such as epilepsy, diabetes or asthma\\r\n\\r\nPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
