{
  "locationType": "School",
  "accrediting": "The University of Huddersfield",
  "provider": "Trinity TSA",
  "subjects": [
    "Art and design",
    "Secondary"
  ],
  "name": "Art and Design",
  "slug": "1YF/2QLB",
  "providerCode": "1YF",
  "programmeCode": "2QLB",
  "schools": [
    {
      "name": "Main Site",
      "address": "Shay Lane, Halifax, West Yorkshire, HX2 9TZ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Shay Lane, Halifax, West Yorkshire, HX2 9TZ",
      "geocode": true,
      "formatted_address": "Shay Ln, Halifax HX3 6QU, UK",
      "latitude": 53.7483096,
      "longitude": -1.8770284,
      "post_code": "HX3 6QU",
      "city": "West Yorkshire",
      "route": "Shay Lane",
      "postal_town": "Halifax"
    }
  ],
  "providerAddress": {
    "inst_code": "1YF",
    "addr_1": "Trinity Teaching School Alliance",
    "addr_2": "c/o The Maltings College",
    "addr_3": "Maltings Road",
    "addr_4": "Halifax",
    "postcode": "HX2 0TJ ",
    "url": "http://www.trinitytraintoteach.co.uk",
    "geocode": true,
    "formatted_address": "Maltings Rd, Halifax HX2 0TJ, UK",
    "latitude": 53.7379367,
    "longitude": -1.9008984,
    "post_code": "HX2 0TJ",
    "city": "West Yorkshire",
    "route": "Maltings Road",
    "postal_town": "Halifax"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "A School Direct place costs £9,250 and is payable in 3 instalments across the academic year. Payments are made directly to Huddersfield University. Non-salaried applicants can make an application for a Student Loan to cover the cost of tuition fees and living expenses where necessary.",
    "AboutCourse": "Our School Direct programme allows you to qualify as a teacher within one year. We have created a school led teacher training programme, with a commitment to ensure all trainees have the potential to be outstanding. You'll develop your subject specialist knowledge alongside hands-on classroom experience. In doing so you will have the opportunity to experience teaching as it really is, whilst working alongside and being mentored by outstanding practitioners. \\r\n\\r\nThe course is a one year postgraduate certificate in secondary education with QTS and 90 Masters credits. The programme is divided into two main themes: \\r\n\\r\nInitial Professional Development \\r\nYou'll have the opportunity to explore creative ways to interpret your knowledge into a language a child can understand. We help prepare you for the classroom, allowing you to develop your own thinking, teaching and subject knowledge base to a level which you can trial in your placements. Themes include educational psychology, how young people learn, behaviour management, assessment, inclusion, creative and innovative teaching methods and designing learning. You research theories of child development, gain a greater understanding of current professional issues in secondary schools and develop your own educational philosophy. \\r\n\\r\nSpecialist Subject Pedagogy \\r\nYou'll have the opportunity to develop your subject teaching in a stimulating way, using different methodologies and new technologies to inspire and engage young people. We'll help develop your understanding of the curriculum; progression; planning and developing activities; examination requirements; teaching approaches; leadership; and inclusion. \\r\n\\r\nYour training will incorporate school based practice with weekly professional learning delivered by leading practitioners and Huddersfield University. Professional learning will take place in our training centre at The Maltings College in Halifax. At the training centre you will work with a group of trainees from other subjects, which will allow you time to collaborate, share good practice and engage in peer support. \\r\n\\r\nCourse tutors are very experienced and supportive and you'll have a personal tutor to support you through your studies. Teaching is through workshops, tutorials and lectures, some with guest speakers, and through group work with other teacher trainees from a variety of subject specialisms as well as specialist subject groups. \\r\n\\r\nDuring the course you'll study four modules: \\r\n* Curriculum Development \\r\n* Inclusion, Equality and Diversity \\r\n* Specialist Subject Development \\r\n* Developing Critical Professional Practice \\r\n\\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence. ",
    "CourseLength": "OneYear",
    "Qualifications": "An Honours degree of 2:2 or above with at least 50% relevant content in your chosen subject area. If you've got an overseas degree, we'll need a full transcript of your award.\\r\n\\r\nYou must have passed the skills tests in literacy and numeracy before you start the course.\\r\n\\r\nYou should provide two references. If you are about to graduate or have graduated within the past three years, one referee should be a university or college lecturer who can comment on your academic ability. \\r\n\\r\nStrong subject knowledge and literacy skills.\\r\n\\r\nAll conditions must be met by 31 August 2019.",
    "InterviewProcess": "The Trinity Teaching School Alliance and Huddersfield University partnership have a rigorous recruitment and selection procedure. We select our trainee teachers not only by seeing whether they meet the academic criteria, but also on their passion for teaching all learners, whether they have excellent subject knowledge and whether they have the aspirations to be an outstanding and inspirational teacher in and out of the classroom. \\r\n\\r\nYou will be shortlisted for interview based on your application. The interview process typically lasts for a full day. We advise that you spend some time prior to the interview in a secondary school to give you a greater insight into your career choice. The following selection procedures are designed to assess your suitability for training to teach: \\r\n\\r\n* panel interview with a member of the lead school \\r\n* pre-prepared presentation about why you want to be a teacher\\r\n* subject knowledge test based on aspects of the subject curriculum in school \\r\n* a short task to test your literacy skills\\r\n* lead a 15/20 minute discussion topic lesson with a mixed aged group of students from 11-16. \\r\nFrom this process we will see whether you have the passion and drive to potentially be an outstanding teacher. ",
    "OtherRequirements": "Disclosure and Barring Service and Medical\\r\nOffers will be subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. We also ask you to complete a conduct a health declaration to ensure that you have the health and physical capacity to teach. \\r\n\\r\nExperience\\r\nWe advise that you spend some time gaining experience in a secondary school to give you a greater insight into your career choice and help you decide whether teaching is right for you. Other areas of relevant experience may also support your application. \\r\n\\r\n",
    "PersonalQualities": "What We Are Looking For:\\r\n- Enthusiasm and a genuine desire to inspire young people \\r\n- A commitment to helping every child to make the most of their talents \\r\n- Excellent communication and inter-personal skills \\r\n- Resilience and the willingness to receive and act on advice \\r\n- A realistic understanding of the role of the secondary school teacher \\r\n- The ability to manage time effectively \\r\n- Evidence of self-motivation in personal learning \\r\nIf you have the drive and passion and want to make a difference to learners and their communities, we want to hear from you!",
    "HowSchoolPlacementsWork": "We have a school based approach where you will spend the majority of your training year in one school, but will also complete a short alternative placement in a contrasting alliance school. You will be fully immersed in the culture of your school, and will be able to take ownership of your classes. A second placement allows you to build new networks and challenge yourself.\\r\n You will be teaching age 11-16 but will also be offered experience within post 16.\\r\n \\r\n\\r\nYou will also carry out three placements within alternate provision and primary which will enhance your wider knowledge around areas such as social and emotional behaviour and transition.\\r\n\\r\nWe work with a wide range of partner schools to deliver our training. Each school has its own unique features, but all are involved with the alliance because they want to play their part in training - and then hopefully recruiting - the outstanding teachers of the future.\\r\n\\r\nPlacements are assigned on the basis of a range of factors. Our partner schools are based across West Yorkshire and are constantly expanding due to our growing popularity."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Trinity Teaching School Alliance and Huddersfield University have developed an innovative school-led teacher training programme for School Direct 2019. We are a large alliance of over 45 schools across West Yorkshire, offering rich opportunities for trainees to access the highest quality training in a diverse range of establishments including academies, church schools, schools with 6th forms, primary schools with early years provision, grammar schools, and schools with dedicated special needs provision. \\r\n\\r\nOur School Direct programme has been created in partnership with  leading practitioners from both the University and across the alliance, as well as subject specialists from our sister organisation White Rose Maths. We ensure a collaborative approach between all partners, led and quality assured by a team of experienced senior leaders, dedicated to providing \\r\nthe very best training experience for our School Direct students. We  have a strong focus on ensuring that our trainees are fully supported to develop their knowledge, skills and professional attributes in order to become outstanding and inspirational teachers. \\r\n\\r\nA world-class education system requires world-class teachers and this unique programme sets out to address this challenge. Trinity Academy Halifax is the lead school - graded outstanding in all areas. As the Teaching School Alliance within Trinity MAT, we are dedicated to developing the teachers and educational leaders of the future. Staff are able to access quality CPD programmes, designed to ensure our outstanding teachers also have the opportunity to develop into outstanding leaders.",
    "TrainWithDisability": "We offer disabled access across the Alliance and recommend applicants to discuss their individual needs with us so that we can place you in the most appropriate school for your training year. ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Huddersfield University have been developing great teachers since 1947. Today, the School of Education and Professional Development is a Centre for Excellence in Teacher Training (CETT) and in 2017, were recognised as a Gold Rated university by the Teacher Excellence Framework (TEF). The Research Excellence Framework (REF), deemed an impressive 94% of research to be world class or of international significance. Ranked top five in the Guardian Guide for Education for the sixth year running, every year Huddersfield train over 1,200 teachers combining the latest research, cutting-edge teaching practice, ensuring graduates are equipped with the most relevant and up-to-date skills.",
        "UcasInstitutionCode": "H60"
      }
    ]
  },
  "has_inst": true
}
