{
  "locationType": "School",
  "accrediting": null,
  "provider": "Carmel Teacher Training Partnership (CTTP)",
  "subjects": [
    "Music",
    "Secondary"
  ],
  "name": "Music",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "C23/W3X1",
  "providerCode": "C23",
  "programmeCode": "W3X1",
  "schools": [
    {
      "name": "Main site",
      "address": "The Headlands, Darlington, DL3 8RW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "The Headlands, Darlington, DL3 8RW",
      "geocode": true,
      "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
      "latitude": 54.5236052,
      "longitude": -1.5836444,
      "post_code": "DL3 8RP",
      "city": "Darlington",
      "route": "The Headlands",
      "postal_town": "Darlington"
    }
  ],
  "providerAddress": {
    "inst_code": "C23",
    "addr_1": "The Headlands",
    "addr_2": "Darlington",
    "addr_3": null,
    "addr_4": "Co. Durham",
    "postcode": "DL3 8RW ",
    "url": "http://www.carmel.org.uk",
    "geocode": true,
    "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
    "latitude": 54.52360299999999,
    "longitude": -1.5825947,
    "post_code": "DL3 8RP",
    "city": "Darlington",
    "route": "The Headlands",
    "postal_town": "Darlington"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Music course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYour tutors are a diverse and incredibly experienced community of academics. You will be taught by staff with national and international reputations as experts in the field of music in education, and together you examine a range of pedagogical approaches to music teaching, including workshop-led and informal approaches to learning\\r\n\\r\nYou will learn through a series of practical seminars and workshops in our purpose-built music and music technology studios with extensive resources of music, instruments and equipment.\\r\n\\r\nTeaching is through a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Carmel Teacher Training Partnership (CTTP) is an outstanding Initial Teacher Training Provider based at Carmel College Darlington, an outstanding 11-18 college. Our training programmes are Primary 5-11 years and Secondary 11-16. We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary and secondary schools, widely spread across the North East of England. The CTTP School Centred Initial Teacher Training course aims to promote excellence in all aspects of education.  This is achieved through high quality central and school-based training activities, regular observations with developmental feedback, to secure progress throughout the training programme.  Central training takes place in clusters around our Lead Schools. Our overarching aim is to provide the most skilled and competent practitioners for our schools, improving the outcomes and life chances for young people. \\r\n\\r\nA very high percentage of trainees on our programme either gain employment in their placement schools, or within our Partnership of schools. Carmel Teacher Training Partnership is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees. Successful completion leads to Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards Masters accreditation, which is completed via the flying faculty of St.  Mary’s University Twickenham but delivered at Carmel College and one of our Northern Lead schools, St Cuthbert’s High, Newcastle.  \\r\n",
    "TrainWithDisability": "All Schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site. Please contact Claire Hutton on chutton@carmel.org.uk with any specific disability access requirements.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
