{
  "locationType": "School",
  "accrediting": "The University of Warwick",
  "provider": "Caludon Castle School",
  "subjects": [
    "Chemistry",
    "Science",
    "Secondary"
  ],
  "name": "Chemistry",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "179/27S7",
  "providerCode": "179",
  "programmeCode": "27S7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Axholme Road, Wyken, Coventry, CV2 5BD",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Axholme Road, Wyken, Coventry, CV2 5BD",
      "geocode": true,
      "formatted_address": "Axholme Rd, Coventry CV2 5BA, UK",
      "latitude": 52.4146922,
      "longitude": -1.4532363,
      "post_code": "CV2 5BA",
      "city": "West Midlands",
      "route": "Axholme Road",
      "postal_town": "Coventry"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "School Direct programmes contain a core Professional Studies element and a series of Subject Studies sessions designed for your chosen specialism.  Some of these take place at the placement school and some at the University of Warwick.\\r\n\\r\nTrainees then take what they have learned in the training room directly into the classroom where they put it into practice under the supervision and guidance of mentors and fellow colleagues who will provide support, feedback and key guidance to ensure that all trainees make the required progress. Professional Studies sessions, based at Caludon Castle School, are facilitated by leading practitioners who have a track record of excellence in teaching.\\r\n\\r\nTopics covered include:\\r\n\\r\nUnderstanding learning\\r\nBehaviour for learning\\r\nOutstanding lesson planning\\r\nUsing ICT to enhance learning and teaching\\r\nLiteracy and numeracy\\r\nQuestioning techniques\\r\nDifferentiation\\r\n\\r\n\\r\nThere is a broad curriculum at KS3 and KS4, focussing on:\\r\n\\r\nmaintaining subject knowledge in Chemistry       \\r\ndelivering excellence in general science and specialist Chemistry lessons\\r\ngood laboratory practice\\r\nplanning for and setting up practical lessons       \\r\nmaking the most STEM\\r\ninspiring learners to become tomorrow's chemists\\r\nsupporting literacy and numeracy in Chemistry       \\r\ndesigning and supporting learning outside the classroom\\r\nlinking Chemistry to the wider curriculum\\r\npost-16 Chemistry teaching\\r\n\\r\nTrainees will have experience in at least two secondary or primary schools (depending on phase) and have the opportunity to immerse themselves in school life, participating in extra-curricular activities, parent meetings, and cross-curricular events.  Trainees, also get the chance to spend some time working with children with special educational needs.\\r\n\\r\nAll programmes lead to QTS and PGCE status, including the award of 60 CATS credits towards Masters accreditation, upon meeting the assessment criteria, specified by the University of  Warwick.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Selection criteria are broad and we welcome applications from all sections of the community.  Candidates must have at least 5 GCSE's at C grade or better, including a C grade in English and Maths, Science for Primary as well.  We prefer at least a high second-class UK honours degree (or its equivalent) for all subjects although a 2.2 is acceptable.  All applicants are advised that at least 50% of their degree should focus on the relevant subject, but if a candidate wishes to teach in a subject different from their degree, then they must undertake a SKE.",
    "InterviewProcess": "If shortlisted for selection, applicants will be invited to an interview day, where they will be involved in a range of activities, including teaching a short lesson to students, undertaking a literacy exercise, and undergoing a panel interview.  All applicants offered a place will subsequently be required to produce a clear enhanced disclosure certificate from the Disclosure and Barring Service, pass the 'fitness to teach' requirements laid down by the Department for Education, and pass the Professional Skills Tests in literacy and numeracy, before taking up their place on the course.",
    "PersonalQualities": "Applicants need to have a passion for teaching and show a sincere professional interest in working with children.  Applicants need to be in good health.  Applicants are required to show a commitment to their subject, as well as a desire to train in a school-based environment.  They are encouraged to highlight in particular any prior teaching experience in their application.",
    "HowSchoolPlacementsWork": "Successful School Direct candidates will complete their Post Graduate Certificate of Education (PGCE11-18) with the University of Warwick, allowing them to achieve Qualified Teacher Status (QTS) as well as gaining 90 CATs points towards their Masters. Practical, school-based training will take place at the lead school.  The School Direct programme will involve candidates being supported in and engaged with the schools from the beginning of September 2019, developing relevant professional skills and learning from the wealth of experience that exists both within the schools and the university. High quality support will be available at all times from the schools and the university to help candidates on their journey towards becoming outstanding classroom practitioners. At the end of the training year, there is an expectation that schools will do all that they can to assist the training teacher with securing a teaching position."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "A National Teaching School and the lead school in the Coventry East Alliance, we comprise secondary and primary schools in Coventry and Warwickshire. \\r\nApplying for a School Direct place through us guarantees an exceptional training experience. We have an excellent record of teacher training: in 2017-2018, we trained approximately 50 trainees, most achieving the highest grades and all securing employment.\\r\nOur partner provider, The University of Warwick, confirm the Alliance is ‘outstanding’.\\r\n“outstanding training provision for all trainees, … some of the best feedback to trainees that we have ever seen. The mentor practice is to match those of the very best.” Warwick University Ofsted\\r\n\\r\nPractical, school-based training takes place at the lead school and within the Alliance. We offer placements across all subject areas. Trainees are supported by experienced Subject Mentors, experts in their academic fields.\\r\n“The feedback on placements is very positive, providing excellent training experiences for the trainees.” Director of Teacher Education, Warwick University\\r\n\\r\nSchool Direct programmes in schools contain a core Professional Studies element and a series of Subject Studies sessions designed for the chosen specialism. The programme includes: safeguarding, inclusion, behaviour for learning, learning and teaching. Trainees are then encouraged to put their learning into practice under the supervision and guidance of mentors and fellow colleagues. \\r\nTrainees will have a complementary experience in at least two secondary or primary schools, immersing themselves in school life: extra-curricular activities, parent meetings, and cross-curricular events. Trainees, also, spend time gaining experience in Special Education within their own schools.\\r\n",
    "TrainWithDisability": "The staff at Castle Phoenix Trust are committed to ensuring that all students and teachers develop their full potential. Therefore we aim to provide a caring and supportive environment for all of our students and staff and are committed to the active promotion of Equal Opportunities.\\r\n\\r\nThe school wishes to ensure that it complies with the requirements of the Disability Discrimination Act (as amended by the Special Educational Needs and Disability Act 2001 and 2005) and the Equality Act 2010 and the Children and Families Act 2014.  We are committed to ensuring that disabled people, including those with learning difficulties, are treated fairly. All reasonable adjustments to provision will be made to ensure that disabled students and other disabled people are not substantially disadvantaged.\\r\n\\r\nThis Disability Statement supports Castle Phoenix Trust’s drive towards inclusive learning.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Ofsted has rated us an \"Outstanding\" provider of teacher training, and part of the Russell Group, whose members represent outstanding teaching and learning experience. 94% of our trainees are awarded good or outstanding grades. \\r\nWarwick's employment rate into teaching is 95% . \\r\nUpon completing this course you gain 90 credits at master's level for        our MA in Professional Education. This allows you to fast-track to stage two of a master's degree, quickly progressing your professional development.\\r\nYou will be supported by highly experienced tutors, class teachers and school mentors who have national reputations for the quality of their training.\\r\n\\r\n\\r\n\\r\n",
        "UcasInstitutionCode": "W20"
      }
    ]
  },
  "has_inst": true
}
