{
  "locationType": "School",
  "accrediting": "Suffolk and Norfolk Primary SCITT",
  "provider": "West Ipswich Teaching School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary General",
  "financial_support": "Student finance if you’re eligible",
  "slug": "2FO/36M6",
  "providerCode": "2FO",
  "programmeCode": "36M6",
  "schools": [
    {
      "name": "Main Site",
      "address": "Chesterfield Drive, Ipswich, Suffolk, IP1 6DW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Chesterfield Drive, Ipswich, Suffolk, IP1 6DW",
      "geocode": true,
      "formatted_address": "Chesterfield Dr, Ipswich IP1 6DW, UK",
      "latitude": 52.0761109,
      "longitude": 1.131865,
      "post_code": "IP1 6DW",
      "city": "Suffolk",
      "route": "Chesterfield Drive",
      "postal_town": "Ipswich"
    }
  ],
  "providerAddress": {
    "inst_code": "2FO",
    "addr_1": "West Ipswich Teaching School",
    "addr_2": "Chesterfield Drive",
    "addr_3": "Ipswich",
    "addr_4": "Suffolk",
    "postcode": "IP1 6DW ",
    "url": "http://www.westipswichteacing.org",
    "geocode": true,
    "formatted_address": "Chesterfield Dr, Ipswich IP1 6DW, UK",
    "latitude": 52.076064,
    "longitude": 1.1320823,
    "post_code": "IP1 6DW",
    "city": "Suffolk",
    "route": "Chesterfield Drive",
    "postal_town": "Ipswich"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "We offer specialisms in General Primary, General Primary with Mathematics, Early Years, Special Needs or Key Stage 2. We provide a unique opportunity across Norfolk and Suffolk for trainees to immerse themselves in a diverse range of teaching and training experiences which by the final term are highly personalised.\\r\nThe training comprises of 3 placements in 2 contrasting schools over the course of the year combined with 66 days in centre training. \\r\nThe centre based training is provided by expert trainers, many of whom are still serving teachers. It covers all National Curriculum subjects and key aspects of primary education such as behaviour management, SEND and assessment. Trainees also have sessions focused on the two assignments and one presentation which contribute to their PGCE qualification (including 60 credits at M Level).\\r\nAll trainees have a personal tutor who is committed to supporting each trainee over their training year.  This includes weekly email contact, visits to observe teaching and end of term progress interviews. Ofsted 2013 commented on the ‘very high-quality pastoral and academic support for trainees which results in outstanding outcomes’. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "\\r\nGCSE English, Mathematic and Science Grade C/4 or above (or equivalent) \\r\nLevel 2 Adult Numeracy and Literacy are not accepted as equivalents.\\r\nDegree\\r\nA UK first degree (or equivalent). Honours Degree, normally 2.2 or better (or equiv. 360 CAT points) \\r\nIf your qualifications were not gained in the UK, you can visit the National Academic Register Centre (NARIC) website to find out whether your qualifications are equivalent to UK GCSEs and degrees. Please note that the responsibility is on you to prove that your qualifications are equivalent and you must include a NARIC statement with your application verifying this. \\r\n",
    "InterviewProcess": "The Primary Tuition SCITT team will be co-ordinating the recruitment process with their partnership school head teachers. You will lead a 10-minute teaching activity in a partnership school. If this this is successful, you will be invited to attend a task day.\\r\nAt the task day you will undertake some short written tests and some interpersonal tasks. This will be followed by an interview.\\r\n",
    "OtherRequirements": "A satisfactory enhanced DBS check before commencing training. Suffolk and Norfolk SCITT will arrange this.\\r\nIf an applicant has lived overseas for more than six months in the past five years in line with safer recruitment practice they will be required to provide a certificate of good conduct from that country.\\r\nApplicants must pass the professional skills tests for literacy and numeracy before the start of the course.\\r\n",
    "PersonalQualities": "We are looking for committed, resilient individuals who are ready to undertake an exciting but rigorous training year. We are interested in people who are passionate and enthusiastic about children's learning and have a desire to promote the best outcomes for children of all abilities. You need to be open to constructive feedback and see it as a tool to help you to achieve your potential by the end of the year.  You must be organised and self-motivated as although there is lots of support, you also need to be focused on the commitment involved within this training year.  \\r\n",
    "HowSchoolPlacementsWork": "Our partnership of over 150 schools is well-established and we have clear and strong working relationships with a range of primary schools across Suffolk and Norfolk and into Cambridgeshire. We go to great lengths through quality assurance and our local knowledge to ensure that all placements are of a high standard. Trainees are supported by school mentors who are enthusiastic, committed and well-trained individuals. \\r\nTrainees spend approximately 26 weeks on school placement. Most of this is in the main placement school in the autumn and summer terms, with at least 6 weeks in the spring term in a contrasting school.\\r\nThe distance to school placements will vary. These take into account the trainee’s home address, whether they have their own transport and the placement that the school is able to offer. Our policy is to endeavour to keep journey times to school to a maximum of 50 minutes each way.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The West Ipswich Teaching School are offering an exciting and innovative School Direct Initial Teacher Training programme. \\r\nWest Ipswich Teaching School is a hub of two outstanding and inclusive schools. We have a proven history of developing quality early years practice in Ipswich and across Suffolk specialising in SEND.\\r\n\\r\nWe are  offering an exciting and innovative School Direct Initial Teacher Training programme.   An application through our alliance will give a duality of benefits. In addition you will have your core training through SCITT which has an outstanding reputation providing a quality start for your career in a dynamic and exciting career.\\r\n\\r\nWIT provides extra input which will be extremely beneficial in preparation for the demands of the classroom. Providing:\\r\n\\r\n*A person centred learning approach for all\\r\n*Access quality CPD provided as part of the WIT Alliance and partners as well as working in partnership with families and health and care teams.\\r\n*Access to relevant quality CPD provided by Teaching Schools within the regional area.\\r\n*Access support from experienced practitioners for your first year of practice to help you on the journey to achieving QTS.\\r\n*On-going mentor support to ensure each individuals learning action in the classroom.\\r\n*Additional regular training sessions with specialised SEND education provision to gain hands on experience of physical, medical and sensory conditions\\r\n*Access to research and information networks provided through the Teaching School and Ipswich Research School\\r\n*On-going  mentor support for your RQT and RQT +1 years with a designated program on CPD and supervision cycle.\\r\n",
    "TrainWithDisability": "Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\\r\nSuffolk & Norfolk Primary SCITT has full disabled access as do all the schools in the partnership. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Do you want to get into schools early and start to practice teaching as soon as possible?\\r\nDo you want to be part of a very supportive cohort of trainees who receive personal support from committed, experienced and enthusiastic tutors? \\r\n\\r\nSuffolk and Norfolk Primary SCITT Tuition has an excellent reputation for providing high quality training and support for all trainees. In 2018, 71% of trainees graduated with a grade of ‘outstanding’. The programme has been rated by Ofsted as 'outstanding' in the last two consecutive inspections. The course offers a PGCE with 60 Masters Level credits as well as QTS. \\r\n",
        "UcasInstitutionCode": "S13"
      }
    ]
  },
  "has_inst": true
}
