{
  "locationType": "School",
  "accrediting": "University of Derby",
  "provider": "Forest Way Teaching School Alliance",
  "subjects": [
    "Business studies",
    "Secondary"
  ],
  "name": "Business Studies",
  "slug": "1L8/2PW7",
  "providerCode": "1L8",
  "programmeCode": "2PW7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Warren Hills Road, Coalville, LE67 4UU",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Warren Hills Road, Coalville, LE67 4UU",
      "geocode": true,
      "formatted_address": "Warren Hills Rd, Coalville LE67 4UU, UK",
      "latitude": 52.729982,
      "longitude": -1.3248195,
      "post_code": "LE67 4UU",
      "city": "Leicestershire",
      "route": "Warren Hills Road",
      "postal_town": "Coalville"
    }
  ],
  "providerAddress": {
    "inst_code": "1L8",
    "addr_1": "Forest Way Teaching School Alliance",
    "addr_2": "Warren Hills Road",
    "addr_3": "Coalville",
    "addr_4": "Leicestershire",
    "postcode": "LE67 4UU",
    "url": "http://www.forestwaytsa.org/initial-teacher-training.html",
    "geocode": true,
    "formatted_address": "Warren Hills Rd, Coalville LE67 4UU, UK",
    "latitude": 52.7290658,
    "longitude": -1.3251641,
    "post_code": "LE67 4UU",
    "city": "Leicestershire",
    "route": "Warren Hills Road",
    "postal_town": "Coalville"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "If you are training to be a teacher, you can get finance for your Initial Teacher Training PGCE. \\r\n\\r\nBursaries are also available – these don’t need to be repaid but they do vary according to the subject you’re planning to teach and the classification of your first degree.\\r\n\\r\nFind out more about paying for your teacher training on the [Get Into Teaching website](https://getintoteaching.education.gov.uk/)\\r\n",
    "AboutCourse": "Our Secondary teacher training programme for Business Studies is an exceptional partnership of Forest Way Teaching School Alliance – FWTSA, the University of Derby and six local secondary schools all with Good Ofsted ratings. \\r\n\\r\nThe majority of your time on this course will be spent in a local school, gradually taking on the role of class teacher, working closely with an experienced and skilled practitioner and mentor.  In addition, nine weeks will be spent in an additional secondary school, focussing on a different key stage to experience the full range of the secondary curriculum.\\r\n\\r\nThe start of the course will consist of a preliminary experience in a primary school that feeds in to your main secondary placement and trainees will also get the chance to spend on week in a special school.\\r\n\\r\nOne day each week your training will be split between FWTSA Hub sessions, held at a local school and time spent at the University of Derby. This training will focus on all aspects of teaching pedagogy, including lesson planning and evaluation, behaviour management, literacy and functional skills, learning theory, diversity and inclusion, equality, safeguarding, creative engagement, PSHE and form tutoring.\\r\n\\r\nIn school, your subject teaching will be closely monitored and supported by a co-tutor in the department. Senior members of staff hold overall responsibility in each school for the training of trainee teachers, including tutorials and the provision of opportunities for professional development and whole school concerns.\\r\n\\r\nSuccessful completion of the course leads to the award of PGCE and 60 credits at Masters level awarded by the University of Derby and Qualified Teacher Status.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You will need to be working towards or have gained the following:\\r\n\\r\n* At least 2:1 degree in relevant subject (in exceptional circumstances in shortage subjects a 2:2 may be accepted with other experience)\\r\n* GCSE at C/4 or above in English and Maths, prior to application\\r\n* Professional Skills Test PASS for literacy and numeracy, by the start of the course\\r\n* Academic and professional references\\r\n",
    "FinancialSupport": "Find out about fees, postgraduate loans and support you may be entitled to at the [University of Derby website](https://www.derby.ac.uk/postgraduate/fees-and-finance/)\\r\n\\r\nThe University of Derby offer a discount on postgraduate course fees for all Derby alumni. For details please see [University of Derby website](https://www.derby.ac.uk/postgraduate/fees-and-finance/alumni-discount/)\\r\n",
    "InterviewProcess": "Interviews will usually take place at one of the secondary schools in our Alliance and dates will be set as required throughout the year.\\r\n\\r\nThe interviews will comprise of:\\r\n\\r\n* Group discussion on selected topics and current educational issues\\r\n* Individual interview\\r\n* Completion of a written subject task\\r\n* Visit to class to meet pupils and teachers\\r\n \\r\n\\r\nThe interview panel will be a selection of:\\r\n\\r\n* FWTSA School Direct Programme Manager\\r\n* FWTSA Lead Practitioner\\r\n* Senior teacher from an Alliance school\\r\n\\r\nYou will need to bring the following with you to the interview:\\r\n* Photo ID (Passport/Driving Licence)\\r\n* Original Degree Certificate (if available)\\r\n* Original Maths GCSE Certificate\\r\n* Original English GCSE Certificate\\r\n* QTS Literacy Test Evidence (if available)\\r\n* QTS Numeracy Test Evidence (if available)\\r\n",
    "OtherRequirements": "You will be required to satisfy the University that you are physically and medically “fit to teach”.\\r\n\\r\nA Disclosure and Barring Service (DBS) check is required and will be undertaken by the University of Derby before you begin the course.\\r\n",
    "PersonalQualities": "We are seeking to recruit highly motivated and inspiring individuals who are excited about the School Direct PGCE and have:\\r\n\\r\n* a genuine commitment to teaching\\r\n* excellent communication skills \\r\n* ability to form good and effective relationships\\r\n* reflective qualities \\r\n* emotional resilience \\r\n* awareness of current educational issues  \\r\n* energy and a sense of humour!\\r\n* experience  in educational related settings, or wider experience of working with children or young people\\r\n* any particular outstanding/subject specific skills\\r\n\\r\nPlease use your personal statement to highlight these qualities and give us a clear picture of why you want to teach.\\r\n",
    "HowSchoolPlacementsWork": "Secondary schools in our Alliance are divided into High Schools and Upper Schools. There are four high schools who take pupils from age 11 to 14, Years 7,8 and 9 and two upper schools who take pupils from age 14 to 19, Years 10, 11,12,13. You will have a placement at both age ranges, with you main placement being in your preferred phase.\\r\n\\r\nYou will spend the majority of the autumn and summer terms with your main school placement and the spring term with your second school placement.  You will also have the opportunity to experience a Special School and a bespoke placement based on individual needs.\\r\n\\r\nPlease see our website [www.forestwaytsa.org](http://www.forestwaytsa.org/alliance-partners.html) Alliance Partners page for details of all our partner schools and links to their websites.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Training with FWTSA\\r\nForest Way Teaching School Alliance is based in the North West Leicestershire area and our accredited providers are University of Derby, University of Leicester and Loughborough University. We are now in our seventh year of delivering both Primary and Secondary School Direct PGCE.\\r\n\\r\nYour placement will be at one of our Alliance schools. With 40+ primary, 6 secondary and 3 special schools, there is a huge array of expertise on hand which gives trainees a great breadth of opportunity.\\r\n\\r\nOur teacher training is led by Programme Managers and a team of experienced practitioners offering a wealth of educational skills and knowledge, and are dedicated to the professional development of outstanding teachers. Working with our partners we have developed a programme which incorporates hands on work at schools, regular time at university and, where appropriate, practical, locally based training by skilled and experienced practitioners ‘doing the job’.\\r\n\\r\nOur Alliance is progressive and proactive with a major focus on career development – from Initial Teacher Training, NQT Induction and training, right though to headship. \\r\nTraining at FWTSA Hub takes place in our local training suite. Primary and Secondary students will undertake some joint training and will have the opportunity to network. For details of student facilities at our partner universities please see their individual websites.\\r\n\\r\nFor more information please see our website [www.forestwaytsa.org]( http://www.forestwaytsa.org/initial-teacher-training.html) or contact our Programme Managers\\r\n\\r\n* Primary – Heidi Malliff, Email:  hmalliff@forestway.leics.sch.uk \\r\n* Secondary – Sheila Dennis, Email:  sdennis@forestway.leics.sch.uk\\r\n",
    "TrainWithDisability": "Forest Way Teaching School Alliance and our accrediting providers, University of Derby, University of Leicester and Loughborough University, are committed to Equal Opportunities for all trainees, and support is available for candidates who require it. Please make clear any support you may require.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "University of Derby have been involved with teacher training for over 150 years,  and have a strong reputation for nurturing successful, confident and forward-thinking teachers.longstanding partnerships with more than 300 schools across the \\r\n\\r\nOne of the major ITT providers in the East Midlands, they  have region, including rural, multi-cultural and inner city schools.\\r\n\\r\nThey work collaboratively with School Direct partner schools who are committed to providing trainees with a high-quality, challenging and exciting training experience.\\r\n\\r\nIn their 2015 Ofsted inspection, inspectors said their students show excellent professional conduct and are highly regarded in the schools in which they train.\\r\n",
        "UcasInstitutionCode": "D39"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "24V"
      },
      {
        "Description": "University of Leicester have a long and proud history of training outstanding teachers. Their long-standing partnership with schools ensures that students can experience practical teaching placements in a diverse range of schools. So when you start your teaching career, you’ll have the confidence and ability to teach in a variety of settings.\\r\n\\r\nSchool Direct Course content is the same as the University-Led PGCE, though some elements are delivered  in  school. Other elements are delivered on campus as with the University-Led PGCE.\\r\n\\r\nFWTSA as School Direct provider, organises your placements within the Forest Way Teaching Alliance schools.",
        "UcasInstitutionCode": "L34"
      },
      {
        "Description": "Loughborough University have a strong tradition of teacher education and of producing teachers who are in great demand by schools and colleges. the are well renowned for the high quality courses they offer in Physical Education.\\r\n\\r\nLoughborough's School Direct programme runs in parallel with their provider-led PGCE programme; both programmes are high-quality and lead to equivalent outcomes in terms of the award of a masters level PGCE (90 credits) and QTS.",
        "UcasInstitutionCode": "L79"
      }
    ]
  },
  "has_inst": true
}
