{
  "locationType": "School",
  "accrediting": "Oxford Brookes University",
  "provider": "The Downland Alliance",
  "subjects": [
    "Art / art & design",
    "Secondary"
  ],
  "name": "Art and Design",
  "slug": "236/2PR4",
  "providerCode": "236",
  "programmeCode": "2PR4",
  "schools": [
    {
      "name": "Main Site",
      "address": "The Downs School, Compton, Newbury, Berkshire, RG20 6AD",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "The Downs School, Compton, Newbury, Berkshire, RG20 6AD",
      "geocode": true,
      "formatted_address": "Manor Cres, Compton, Newbury RG20 6AD, UK",
      "latitude": 51.512656,
      "longitude": -1.2537454,
      "post_code": "RG20 6AD",
      "city": "Compton",
      "route": "Manor Crescent",
      "postal_town": "Newbury"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Our programme is a bespoke professional development training programme developed in conjunction with Oxford Brookes University, \\r\n\\r\nIt covers a range of activities related to important educational issues and practical classroom strategies. \\r\n\\r\nEvery part of the programme is aimed at preparing you to be the best teacher possible. Immersion into the life of a teacher and daily exposure to outstanding practice  ensures that you have the best possible opportunity to reach your full potential. \\r\n\\r\nWe are looking for trainees who display the potential to become outstanding teachers of the future.\\r\n\\r\nAs one of our trainees, you are attached to one “host” school for much of the year, and mainly in one subject department. This makes it possible for you to get to know teachers and pupils in the school really well, and to understand the school's policies and practice. \\r\n\\r\nThe core training package provides \\r\n\\r\n* a main placement in one of our partner secondary schools \\r\n\\r\n* a second placement of 6 weeks in a contrasting school \\r\n\\r\n* a primary placement in one of our linked primary schools \\r\n\\r\n* 6th form experience \\r\n\\r\n* the possibility of experience in a special setting such as a Pupil Referral Unit.\\r\n\\r\nTraining modules will cover:\\r\n\\r\n* motivating and engaging learners \\r\n\\r\n* creative lesson planning and design\\r\n\\r\n* behaviour management \\r\n\\r\n* assessment for learning \\r\n\\r\n* special educational needs and disabilities \\r\n\\r\n* subject knowledge and curriculum development \\r\n\\r\n* inclusion and differentiation \\r\n\\r\n* understanding school data and its use in the classroom \\r\n\\r\n* attachment theory and working with adolescents\\r\n\\r\n* working with parents/carers \\r\n\\r\n* safeguarding and Child Protection \\r\n\\r\nAssessment is through a combination of written academic assignments and successful completion of two teaching placements with classroom practice observation and feedback from your mentor and tutor.\\r\n\\r\nOur training sessions are held in schools within our partnership.  Some PGCE sessions may be held at Oxford Brookes University. \\r\n\\r\nWhat do our trainees say?\\r\n\\r\n“All the schools are excellent nurturing supportive environments and the training staff are engaging and informative; crucially the majority are senior leaders in the three schools so their expertise is up to date and hands on”\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You need to have a degree (or equivalent qualification). For equivalent qualifications, you’ll need to confirm your qualification is equivalent to a degree. \\r\n\\r\nIf all or part of your qualifications are from outside the UK -you will need to get formal recognition through UK NARIC. \\r\n\\r\nYou must also be able to show that you can communicate effectively in both spoken and written English.\\r\n\\r\nYou’ll need to have GCSE grade C / 4 (or standard equivalent) in mathematics and English. \\r\n\\r\nAll teacher training applicants must successfully pass the Literacy and Numeracy skills tests before they start the course in September. \\r\n\\r\n\\r\n",
    "FinancialSupport": "Many courses are supported by scholarships and bursaries and student finance is available if you are eligible. \\r\n\\r\nTo encourage and reward training to teach in certain specified subjects teachers in specific areas of England, the Teachers’ Student Loan Reimbursement scheme will pay back the student loan repayments you’ve made in the previous year. ",
    "InterviewProcess": "How do we select our trainees? \\r\n\\r\nYou should be very clear in your personal statement about why you want to become a teacher, the skills involved and what you can bring to the profession. \\r\n\\r\nYour application will be shortlisted from your application form and references. \\r\n\\r\nIf shortlisted you will be invited for interview through UCAS and by email at one of our partner schools. You will be sent all the details of what will be involved before you come along to a selection session but it could include the following:\\r\n\\r\n* Meeting students and staff with some time spent in the classroom \\r\n* Tour of the school\\r\n* Subject specific presentations by applicants\\r\n* Individual interviews\\r\n* Lesson observation and teaching task \\r\n* Written task\\r\n\\r\nYou will be judged by the criteria:-\\r\n\\r\n* Appropriateness of subject qualifications and relevance to subject teaching\\r\n* Capacity to continue professional learning\\r\n* Awareness of the role and responsibilities of the teacher\\r\n* Any school experience\\r\n* Resilience\\r\n* Ability to communicate effectively\\r\n* Enthusiasm for and commitment to teaching and your portfolio\\r\n* Awareness of your personal strengths and weaknesses\\r\n\\r\nYou will be expected to be familiar with key issues and developments in schools – especially in your subject area. You will be judged on your ability to communicate clearly and on your engagement with the audience whether students or staff. \\r\n\\r\nThe programme for the selection process includes a collaborative approach between Oxford Brookes University and our partner schools. \\r\n",
    "OtherRequirements": "It is expected that you will have a “Fitness to Teach” declaration designed to ensure that our trainees have the health and physical capacity to teach and will not children and young people at risk of harm. \\r\n\\r\nStatutory guidance, Safeguarding Children and Safer Recruitment in Education, requires us to ensure that all successful applicants have been subject to Enhanced Disclosure and Barring Service (DBS) and criminal records check. \\r\n\\r\nHaving school experience may help you make a strong application, but don’t worry if you don’t have any – it isn’t a mandatory requirement. \\r\n\\r\n\\r\n\\r\n\\r\n\\r\n",
    "PersonalQualities": "You should have a commitment to education and young people and be passionate about making a difference. \\r\n\\r\nYou'll need to: \\r\n\\r\n* Be enthusiastic about your subject \\r\n\\r\n* Have a keen interest or hobby \\r\n\\r\n* Work on joint projects so your successes in team working are important\\r\n\\r\n* Take part in discussions and respond to written materials  so  interpersonal, communication and writing skills are important. \\r\n\\r\n*Have organisational skills, a good work ethic, a positive approach to your own learning, resilience and a sense of humour! \\r\n\\r\n*Have the perseverance required to successfully complete your training and become a member of the profession\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n",
    "HowSchoolPlacementsWork": "From the beginning our trainees have a focus on school-based learning. \\r\n\\r\nYou will be based in one of our partner schools. You will be asked at interview if you have a preference for a particular host school. The final decision as to which school you will be placed in will take account of a number of factors following this discussion. \\r\n\\r\nAll our trainees have a mentor in their who co-ordinates your classroom-related activities. \\r\n\\r\nYour mentor provides guidance and support, and, as the year goes by,  judges when and how to increase your experience and responsibilities until you are ready to take on whole classes. \\r\n\\r\nYou’ll be part of a team from the very start, receiving intensive support from experienced teachers and mentors. That means you won’t be teaching classes unsupported until the school thinks you’re ready.\\r\n\\r\nAnother experienced teacher in the school (the ITT coordinator) co-ordinates activities related to general educational issues. \\r\n\\r\nYou will also have individual tutor visits from Oxford Brookes University in school. \\r\n\\r\nThis personalised approach means that you are supported throughout the course and you don’t have to worry about being thrown in at the deep end.  \\r\n\\r\nGradually you will begin to teach parts of lessons, and then short series of lessons. Before and after Christmas almost all your time will be spent in schools, with a complementary placement at another local school arranged for approximately 6 weeks before February. \\r\n\\r\nWhat do our trainees say? \\r\n\\r\n“Training across three schools enables you to learn as much as possible and see a range of techniques”\\r\n\\r\n“Our mentors as well as the training staff are invaluable for their experience teaching wisdom and support. There is always someone to turn to if you feel your ship is sinking!”\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "This is a unique opportunity to train with a highly successful group of schools that make up our partnership, located in the beautiful county of West Berkshire but close to Oxford, Reading, Winchester and London. \\r\n\\r\nA wide spectrum of high achieving schools ensures a range of opportunities including a primary / secondary placement and 6th form experience for secondary trainees. \\r\n\\r\nThe secondary in-school training is organised jointly by The Downs School, Compton, St Bartholomew’s School, Newbury, and Kennet School, Thatcham. \\r\n\\r\nOur Primary training is organised jointly by our primary partners. These include Beedon CE Primary, Compton CE Primary, Lambourn C of E Primary and Chaddleworth and Shefford CE Primary.\\r\n\\r\nThe Downs School is lead school; it has been judged outstanding in all areas by Ofsted. \\r\n\\r\nOur course leads to QTS and PGCE - both professional qualifications are awarded by Oxford Brookes University so you get the best of both worlds – high quality school led training linked to a renowned higher education institution. \\r\n\\r\nOur training programme is just the first step on your teaching career.\\r\n \\r\nThere is a complete programme of training offered in West Berkshire from NQT to becoming a school leader, if you have the right skills. \\r\n\\r\nSchool-led courses have high rates of employment and, above all, of trainee satisfaction.\\r\n\\r\nEvery part of our programme is aimed at preparing you to be the best teacher possible. Immersion into the life of the teacher and daily exposure to outstanding practice and teachers ensures you have the best possible opportunity. \\r\n",
    "TrainWithDisability": "We welcome applications from all sectors of the community including if you have a disability or other need.  with a disability. \\r\n\\r\nWe will make any necessary arrangements to help you attend for interview and your training. Please ensure you let us know by contacting our Teaching School Manager for further information. \\r\n\\r\nSchools within the partnership have partial disabled access and Oxford Brookes University has full disabled access. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Our partnership with Oxford Brookes University brings together high-quality teaching with our school led programmes designed for the real world of education.  \\r\n\\r\nSupport and academic teaching is provided by both school mentors and academic tutors at Oxford Brookes University. You will attend lectures and seminars and complete a variety of assignments and research tasks. \\r\nYou will be able to use all the facilities at the Harcourt Hill campus for your studies should you want to –including the Library Resources. Further information is available on the Oxford Brookes website. \\r\n(http://www.education.brookes.ac.uk/Partnerships/) \\r\n\\r\n\\r\n\\r\n\\r\n",
        "UcasInstitutionCode": "O66"
      }
    ]
  },
  "has_inst": true
}
