{
  "locationType": "University",
  "accrediting": null,
  "provider": "Roehampton University",
  "subjects": [
    "Chemistry",
    "Science",
    "Secondary"
  ],
  "name": "Science with Chemistry",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "R48/F1X1",
  "providerCode": "R48",
  "programmeCode": "F1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "geocode": true,
      "formatted_address": "Roehampton Ln, London SW15 5PU, UK",
      "latitude": 51.4579866,
      "longitude": -0.2432869,
      "post_code": "SW15 5PU",
      "city": "Greater London",
      "route": "Roehampton Lane",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "R48",
    "addr_1": "Roehampton Lane",
    "addr_2": "London",
    "addr_3": null,
    "addr_4": null,
    "postcode": "SW15 5PU",
    "url": "http://www.roehampton.ac.uk",
    "geocode": true,
    "formatted_address": "Roehampton Ln, London SW15 5LS, UK",
    "latitude": 51.4554361,
    "longitude": -0.2431242,
    "post_code": "SW15 5LS",
    "city": "Greater London",
    "route": "Roehampton Lane",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Science course is consistently graded as good in Ofsted inspections, and will lead to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYou will be taught by staff with national and international reputations as experts in the field of science education. They are a diverse and incredibly experienced community of academics with extensive school teaching and academic experience.\\r\n\\r\nTake part in activities designed to help you to plan your teaching effectively and imaginatively. Discover how to evaluate your skills, particularly in terms of the quality of learning achieved by pupils.\\r\n\\r\nYour teaching is through a series of practical seminars and workshops in purpose-built science laboratorieswhere interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\nobservation of other teachers\\r\n\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n*gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education at Roehampton is one of the principal providers of teacher training in the UK, with partnerships with over 350 schools. We have a rich history of over 175 years providing teacher training education through our four Colleges. \\r\n\\r\nAs a student in our School, you will enjoy high quality teaching, which will equip you for a successful career with a competitive starting salary. Your employment prospects will be excellent: 99% of our teacher training graduates are in work or further study six months after leaving us (Destinations of Leavers of Higher Education 2013/14). \\r\n\\r\nWe are based on a beautiful parkland campus in south-west London, close to Putney and Hammersmith, and just 30 minutes from the West End. Our School is ranked third in London for the quality of our research in the field of education (Research Excellence Framework 2014), reflecting the work-class expertise of our staff.\\r\n\\r\nFor more information about the university, please see here.\\r\n\\r\n(https://www.roehampton.ac.uk/why-roehampton/)",
    "TrainWithDisability": "The University of Roehampton welcomes students with disabilities and offers flexible support services tailored to your needs. Our Disability and Dyslexia Services are on the main campus, Digby Stuart, along with our Access Centre: Access@SW15.\\r\n\\r\nFor new students, we strongly recommend that you get in touch to let us know about your specific disability and support needs. Any information provided will be kept strictly confidential and will only be used to support you with your studies. \\r\n\\r\nWe recommend to inform us of your specific learning difference (SpLDs) such as Dyslexia, Dyspraxia, Dyscalculia and Attention Deficit Hyperactivity Disorder (ADHD).\\r\n\\r\nFor more information please see our disability services website here.\\r\n\\r\n(https://www.roehampton.ac.uk/disability-services/)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
