{
  "locationType": "School",
  "accrediting": "Suffolk and Norfolk Secondary SCITT",
  "provider": "Notre Dame High School Norwich",
  "subjects": [
    "Physics",
    "Science",
    "Secondary"
  ],
  "name": "Physics",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1GT/28GT",
  "providerCode": "1GT",
  "programmeCode": "28GT",
  "schools": [
    {
      "name": "Suffolk and Norfolk Secondary SCITT",
      "address": "University Campus Suffolk, West Building, Ipswich, IP4 1QJ",
      "code": "S"
    }
  ],
  "addresses": [
    {
      "address": "University Campus Suffolk, West Building, Ipswich, IP4 1QJ",
      "geocode": true,
      "formatted_address": "Long St, Ipswich IP3 8AH, UK",
      "latitude": 52.05328069999999,
      "longitude": 1.1647612,
      "post_code": "IP3 8AH",
      "city": "Suffolk",
      "route": "Long Street",
      "postal_town": "Ipswich"
    }
  ],
  "providerAddress": {
    "inst_code": "1GT",
    "addr_1": "Notre Dame High School",
    "addr_2": "Surrey Street",
    "addr_3": "Norwich",
    "addr_4": "Norfolk",
    "postcode": "NR1 3PB ",
    "url": "http://www.ndhs.org.uk/page/?title=Initial+Teacher+Training&pid=1",
    "geocode": true,
    "formatted_address": "Surrey St, Norwich NR1 3PB, UK",
    "latitude": 52.6229053,
    "longitude": 1.2967905,
    "post_code": "NR1 3PB",
    "city": "Norfolk",
    "route": "Surrey Street",
    "postal_town": "Norwich"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "9000 for 1 year full time trainees/ 5750 for 2 year part time trainee per year \\r\n",
    "AboutCourse": "In order to achieve Qualified Teacher Status, you will be assessed against all parts of the Teachers’ Standards which you gradually accumulate the evidence for this assessment during your teaching practice in school. Additionally, there are three Masters' level assignments to write during your training and they help to link theory to the practice of what you are doing in the classroom. A strength of the SCITT Tuition course is the range of placements that you undertake during your training. As a trainee you are in school from the first week of September observing experienced classroom practitioners  and are gradually introduced to your own teaching timetable with one to one guidance from school tutors and also from your SCITT Tutors. Centre based training is delivered by a range of classroom practitioners, experts in specific areas e.g. SEND, headteachers and local and national consultants. You have your first placement in one school for all of the autumn term; spring term is spent in a second school and then you return to the first placement school for the summer term until the end of June. This placement structure provides you with a breadth of experiences to help inform your choice of the type of school you wish to work in as a newly qualified teacher. We will aim to organise placements in school which are local to you and will  provide you with a high quality support and we ensure that we work closely with our partnership schools, for example, all mentors receive one-to-one mentor training from us as a provider.",
    "CourseLength": "1 Year for Full Time from September to end of June/ 2 years part time (2 days in Year 1 and 3 days in Year 2). Opportunity to train on 5 term training programme part time, completing at Easter of Year 2. ",
    "Qualifications": "A UK first degree (or equivalent). Normally 2.2 or better (or equiv. 360 CAT points). \\r\nGCSE English Language Grade 4/C or above (or equivalent) \\r\nGCSE Mathematics Grade 4/C or above (or equivalent)",
    "InterviewProcess": "After your application is shortlisted by a team of subject specialists, you will be invited to a formal interview. This consists of a subject knowledge test, reflective task and a small presentation to the interview panel.  If successful at interview, you will be invited to the final part of the process known as Task Day which will be held in Norwich and Ipswich. You will complete group activities with other trainees, deliver a very short presentation and complete a couple of written tasks and you will be observed by senior members of the SCITT Team. If you are successful at Task Day you will be invited to a school placement interview in one of our partnership schools which are local to you and this interview will be organised by as a provider. This will give you the opportunity to observe the ethos and context of your potential placement school. As a SCITT provider, it is important that we involve our partnership schools in the recruitment process. ",
    "OtherRequirements": "Passes in the professional skills tests in literacy and numeracy before starting the course. Confirmation of clear DBS check before you start the course. Meet the 'Fit to Teach' criteria. ",
    "PersonalQualities": "We find that successful trainees have a passion for their subject which they wish to pass onto secondary school students. Trainees should be motivated, well-organised and demonstrate resilience. Trainees should understand  the importance of developing strong learning relationships with teenagers and can demonstrate that they view teaching as a valuable career. Additionally trainees  should be reflective, able to take respond positively to feedback about their progress during their training year and also value being part of a team. ",
    "HowSchoolPlacementsWork": "We will consider you for a training place in one of our local partnership schools, taking into account your home address and travel arrangements, as well as ensuring you have a high-quality school placement. Most trainees train in subjects within the 11-16 age range but there is also the opportunity to train in the 14-19 age phase in specific subjects. Partnership schools take part in the recruitment process which means that all training arrangements are in place by July, ready for you to attend your placement school on the first day of term in September.  Centre based training takes place in venues in either Norwich or Ipswich (can attend the closest venue to you) and this is approximately in six week blocks throughout the year and in addition there are subject knowledge days to attend which are mainly delivered in partnership schools across the two counties. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Notre Dame High School, a National Teaching and Research School in Norfolk in partnership with the Suffolk & Norfolk Secondary SCITT Tuition PGCE programme has an excellent local reputation for providing training of the highest quality. The Secondary Tuition course is one of the courses offered by Suffolk & Norfolk SCITT which is the biggest SCITT in the country. All trainees on this course will obtain the following qualification,  QTS, PGCE with 60 Masters’ credits on successful completion of the course. Our aim is to 'train you not as a teacher for a specific school but as a future member of the teaching profession.' ",
    "TrainWithDisability": "We are committed to supporting trainees with disabilities. Please contact us to discuss any access requirements.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The Suffolk and Norfolk SCITT Tuition programme has very high attainment and employment outcomes for our trainees. On average 65% of our trainees are outstanding and 90% of trainees are employed by the end of their training year.  Trainees are supported by school mentors and  SCITT Tutors who have a range of experience in schools in as either headteachers, members of senior leadership teams, classroom practitioners so have a wealth of experience to share with trainees. The Secondary SCITT Tuition course is a highly personalised course which offers a range of opportunities to trainees. ",
        "UcasInstitutionCode": "S14"
      }
    ]
  },
  "has_inst": true
}
