{
  "locationType": "School",
  "accrediting": "University of Worcester",
  "provider": "South Worcestershire ITT Consortium",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1Y6/2PYP",
  "providerCode": "1Y6",
  "programmeCode": "2PYP",
  "schools": [
    {
      "name": "Chawson First School",
      "address": "Wych Rd, Droitwich Spa, WR9 8BW",
      "code": "A"
    },
    {
      "name": "Bengeworth CE Academy",
      "address": "Burford Rd,, Evesham, WR11 3HB",
      "code": "H"
    },
    {
      "name": "Swan Lane First School",
      "address": "Rynal Street, Evesham, Worcestershire, WR11 4QA",
      "code": "S"
    },
    {
      "name": "Westacre Middle School",
      "address": "Ombersley Way, Droitwich, WR9 0AA",
      "code": "W"
    }
  ],
  "addresses": [
    {
      "address": "Wych Rd, Droitwich Spa, WR9 8BW",
      "geocode": true,
      "formatted_address": "Wych Rd, Droitwich WR9 8BW, UK",
      "latitude": 52.260938,
      "longitude": -2.1614806,
      "post_code": "WR9 8BW",
      "city": "Worcestershire",
      "route": "Wych Road",
      "postal_town": "Droitwich"
    },
    {
      "address": "Burford Rd,, Evesham, WR11 3HB",
      "geocode": true,
      "formatted_address": "Evesham WR11 3HB, UK",
      "latitude": 52.0935536,
      "longitude": -1.9372183,
      "post_code": "WR11 3HB",
      "city": "Worcestershire",
      "route": null,
      "postal_town": "Evesham"
    },
    {
      "address": "Rynal Street, Evesham, Worcestershire, WR11 4QA",
      "geocode": true,
      "formatted_address": "Rynal St, Evesham WR11 4QA, UK",
      "latitude": 52.09535109999999,
      "longitude": -1.9442899,
      "post_code": "WR11 4QA",
      "city": "Worcestershire",
      "route": "Rynal Street",
      "postal_town": "Evesham"
    },
    {
      "address": "Ombersley Way, Droitwich, WR9 0AA",
      "geocode": true,
      "formatted_address": "Ombersley Way, Droitwich WR9 0RA, UK",
      "latitude": 52.2630949,
      "longitude": -2.1654211,
      "post_code": "WR9 0RA",
      "city": "Worcestershire",
      "route": "Ombersley Way",
      "postal_town": "Droitwich"
    }
  ],
  "providerAddress": {
    "inst_code": "1Y6",
    "addr_1": "Victoria Avenue",
    "addr_2": null,
    "addr_3": "Evesham",
    "addr_4": "Worcestershire",
    "postcode": "WR11 4QH",
    "url": "http://www.princehenrys.worcs.sch.uk",
    "geocode": true,
    "formatted_address": "Victoria Ave, Evesham WR11 4QQ, UK",
    "latitude": 52.0992015,
    "longitude": -1.9435083,
    "post_code": "WR11 4QQ",
    "city": "Worcestershire",
    "route": "Victoria Avenue",
    "postal_town": "Evesham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Why train with us?\\r\n\\r\nSchool Direct Trainee- 2014-2015 \\r\n\\r\n‘This course surpassed my expectations and I have no regrets about choosing the Schools Direct route; it has fully prepared me to begin teaching and me confident in my ability to do so. The Schools Direct route has offered extensive support both within the school and at university and has allowed me to experience every aspect of school life.’ \\r\n\\r\nWorcester has an excellent reputation locally, nationally and increasingly internationally and attributes its growing success to: Highly relevant, very professional courses Excellent, inspiring teaching A truly friendly, inclusive approach with excellent student support and outstanding record of graduate employment. Excellent partner schools. \\r\n\\r\nSchool Direct External Examiner 2014-2015 \\r\n\\r\n'The liaison between lead mentors, school-based staff and university staff (particularly the Programme Lead) is excellent, facilitating clear communication, QA processes and programme development. Staff and students were unanimous in their praise for the university-based staff, and in particular the SD Lead, in ensuring the success of this route into teaching'\\r\n\\r\nSchool Direct Course features and Benefits.\\r\n\\r\n* An inspiring school based immersion model of Initial Teacher Education underpinned by the Professional Teaching Standards Parts 1 and 2. \\r\n* You are part of the School community from Day 1, an early integration into school life. \\r\n* An innovative and creative teaching programme with a clear focus inclusion for all with the Early Years and National Curricula. \\r\n* Excellent student and academic support from the University Team including experts: in Phonics, Behaviour Management, SEND Sport and Disability. \\r\n* A personalised training programme that meets individual trainees and school needs. \\r\n* A programme underpinned by a clear focus on the theory of how children learn and the barriers that may affect them.\\r\n\\r\nThe School Direct route is underpinned by a coaching and mentoring model to ensure you receive the highest quality teacher training experience. Throughout your training you will have regular built in opportunities to observe and learn from outstanding teaching in a range of contexts. \\r\n\\r\nOur partner schools include a range of settings from rural to inner city. You will practice teaching in at least two schools and across two key stages based on your entry pathway. \\r\n\\r\nThe course is designed with periods in University developing a Masters' level understanding of the complex nature of teaching and learning, taught by expert University tutors and come together in peer group subject communities to reflect on your professional development.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Minimum degree required: Lower Second.\\r\n\\r\nA degree, usually an Honours degree in a subject applicable to your teaching subject. For maths and physics the minimum degree entry requirement is third class degree.\\r\n\\r\nGCSE's.\\r\n\\r\nGrade 4 or C  at GCSE (or equivalent) in English Language, Mathematics, Science are essential for all applicants. The SCITT will organise alternative examinations for candidates without these qualifications to demonstrate the equivalence to GCSE standard.\\r\n\\r\nProfessional skills Tests.\\r\n\\r\nNumeracy and literacy skills tests  must be completed as part of the application process, and ensure you have passed them both before the start of the course.\\r\n\\r\n  (http://sta.education.gov.uk/)\\r\n",
    "InterviewProcess": "The ITT programme is an intensive year, demanding full time commitment. Colleagues across the partnership will go the extra mile to support  trainees throughout the year so long as they demonstrate the commitment needed to succeed on the course. \\r\n\\r\nThe selection process is rigorous, robust and transparent and is designed to help us decide whether we believe you should train with us, and to help you decide if teaching is the right career for you. The interview is a 2 way process, teaching and the school has to be right for you and vice versa. \\r\n\\r\nApplication form.\\r\n\\r\nSubject and curriculum knowledge: \\r\n\\r\n*Strong subject-based academic background. \\r\n*An awareness of current educational issues. \\r\n*Familiarity with the curriculum for the relevant key stages. \\r\n*Capacity to extend subject knowledge.\\r\n\\r\nAptitude for teaching. \\r\n*A desire to teach and enthuse young people. \\r\n*An awareness of the challenges of teaching and the training year. \\r\n* Commitment. \\r\n* Good written communication skills. \\r\n*Good oral communication skills. \\r\n* Team work. \\r\n* An ability to engage young people in learning. \\r\n* Adaptability. \\r\n* Perseverance. \\r\n* Professionalism. \\r\n* Awareness of personal strengths and weaknesses \\r\n\\r\nOur Selection Process.\\r\n\\r\n* A lesson observation if appropriate. \\r\n* A tour of the school. \\r\n* Teaching task ( Where appropriate). \\r\n* Subject Knowledge audit. \\r\n*Formal panel interview. \\r\n* A 5 minute presentation.\\r\n* Group task to evaluate team work and communication skills. \\r\n* Fitness to teach questionnaire.\\r\n*Written task.\\r\n",
    "OtherRequirements": "DBS Check.\\r\n\\r\nAll trainees need to have an enhanced DBS check prior to the start of the course. \\r\n\\r\nThe enhanced DBS check will be carried out by the Accredited Provider prior to commencing your training. You will be required to bring your DBS certificate to admissions at Prince Henry's and South Worcestershire SCITT along with proof of identity so that your DBS number can be recorded.\\r\n\\r\nFitness to Teach.\\r\n\\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. This will we provided at interview if your application is successful.\\r\n",
    "PersonalQualities": "What We Are Looking For.\\r\n\\r\nInterest in and commitment to education and children.\\r\n\\r\nYou will need to be enthusiastic about working with children, and possess an ability to relate to them. On the course, you will be encouraged to develop good working relationships with teachers and their pupils. \\r\n\\r\nOral and written communication.\\r\n\\r\nCommunication skills are, of course, vital to the teacher's role and your skills will be developed through all course elements. \\r\n\\r\nInterpersonal skills.\\r\n\\r\nYou will need to work co-operatively on joint projects, work as a member of a team and accept the responsibility of leadership roles.\\r\n",
    "HowSchoolPlacementsWork": "Teaching Practice and Partner Schools.\\r\n\\r\nWe work very closely with our outstanding partner schools to carefully craft inspiring and innovative initial teacher training programmes. The School Direct route is underpinned by a coaching and mentoring model to ensure you receive the highest quality teacher training experience. Throughout your training you will have regular built in opportunities to observe and learn from outstanding teaching in a range of contexts. \\r\n\\r\nOur partner schools include a range of settings from rural to inner city. You will practice teaching in at least two schools and across two key stages based on your entry pathway. \\r\n\\r\nThe course is designed with periods in University where you will: develop a Masters' level understanding of the complex nature of teaching and learning, be taught by expert University tutors and come together in peer group subject communities to reflect on your professional development as a trainee teacher. You will be allocated a personal Pedagogy and Management (PAM) tutor who will oversee your training journey and act as one of the key links in thi.\\r\n\\r\nIn each school you will be supported by a Lead Mentor, as well as your classteacher and University supervisory Tutor. Your progress will be supported and developed by this key team as part of a three way tripartite model, underpinned by professional dialogue between Trainee, School and University.\\r\n\\r\nYou will receive an inspiring range of additional professional development across your training for example Early Years conferences, training in Child Exploitation and Online Protection (CEOPS) trips and recognised external speakers. Your progress and development will be regularly reviewed with additional support and or enrichment and extension for high performing trainees. Throughout your training your Reflective Portfolio (RP) will enable you to gather evidence of your professional development against the Teaching Standards Parts 1 and 2 \\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Special Features.\\r\n\\r\nThe South Worcestershire ITT Consortium's School Direct Programme in partnership with the Prince Henry's and South Worcestershire SCITT will meet your needs. \\r\n\\r\nWorking in partnership with the University of Worcester we have the ability to shape our course to ensure that trainee teachers receive a first class programme which will allow them to develop their subject knowledge, learn the craft of the classroom and experience a good range of classes. \\r\n\\r\nOur outcomes for trainees over the past 3 years is a 100% pass rate at good or outstanding. All the trainees have secured a teaching post either within the consortium or within Worcestershire. Prince Henry's High School is the accredited provider for the partnership, and our expertise across the partner schools is excellent and the support trainees receive is of the highest quality. \\r\n\\r\nWhy train with us?\\r\n\\r\nThe South Worcestershire ITT Consortium, (SWITT) along with its partner Accredited Provider of Prince Henry's and South Worcestershire SCITT, are already established education institutions with vast experience in delivering and supporting Initial Teaching Training (ITT) courses and placements. Across the consortium of schools we train no more than 40 trainees a year working in partnership with HEI institutions to support and train the next generation of teachers. \\r\n\\r\nOur aim is simple. We wish to continue to raise standards through effective teaching and learning, whilst simultaneously providing the highest quality of Initial Teacher Training and producing the next generation of 'outstanding practitioners'. \\r\n\\r\nWhy train with us?\\r\n\\r\n(https://vimeo.com/217014901/89bcad694c)\\r\n\\r\n",
    "TrainWithDisability": "Our equal opportunities and accessibility to training allows all trainees to apply and be trained through the SCITT.  Extensive support from both the SCITT administration team, subject lead tutors and mentors have provided trainees with extra support and guidance if needed.  We have trained trainees who have been diagnosed with dyslexia and they have been given extra support with the PGCE assignments through the University and also further considerations with planning and marking by the partner schools and mentors.  \\r\n\\r\nhave a trainee 2018-19 who has visual impairments and again extra support with templates, assignments lesson planning, marking will be given throughout the year.\\r\n\\r\nWe are constantly aware of the demands of the course on any person’s health and well- being and we provide pastoral support through our internal verifier and pastoral support colleague within the SCITT.  This provides an extra avenue for trainees to access to share concerns and issues if they are finding difficulties with the course.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Trainees identified the following features of the SCITT Partnership:\\r\n* Strong and clear leadership from the SCITT Team\\r\n* Support and advice provided by the SCITT Director\\r\n* High expectations and aspirations across the SCITT with a focus on excellence\\r\n* Commitment to trainee wellbeing\\r\n* Very good communication within the placement schools\\r\nExternal Examiner 2018.\\r\n\\r\nWhere to Find Us.\\r\n\\r\nPlease see the link to the school website and its partner schools for further details of where we are. \\r\n(http://www.princehenrys.worcs.sch.uk/)\\r\n\\r\n",
        "UcasInstitutionCode": "2ET"
      },
      {
        "Description": "Working closely with Birmingham City University to offer the School Direct Music course we are able to select and recruit trainees in line with the requirements of BCU.\\r\n\\r\nExpertise from the University and their long standing experience working with ITT allows the trainees to make significant progress throughout the year.\\r\n\\r\nTrainees spend a large proportion of time of in schools and have University sessions with the Music tutors each week.\\r\n\\r\n\\r\n",
        "UcasInstitutionCode": "B25"
      },
      {
        "Description": "Worcester has an excellent reputation locally, nationally and increasingly internationally and attributes its growing success to: Highly relevant, very professional courses Excellent, inspiring teaching A truly friendly, inclusive approach with excellent student support An outstanding record of graduate employment Excellent partner schools. \\r\n\\r\n'The liaison between lead mentors, school-based staff and university staff (particularly the Programme Lead) is excellent, facilitating clear communication, QA processes and programme development. Staff and students were unanimous in their praise for the university-based staff, and in particular the SD Lead, in ensuring the success of this route into teaching' External Examiner 2015",
        "UcasInstitutionCode": "W80"
      }
    ]
  },
  "has_inst": true
}
