{
  "locationType": "School",
  "accrediting": "London East Teacher Training Alliance",
  "provider": "London East Teacher Training Alliance",
  "subjects": [
    "Mathematics",
    "Primary"
  ],
  "name": "Primary - General (with Mathematics)",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "133/2WHC",
  "providerCode": "133",
  "programmeCode": "2WHC",
  "schools": [
    {
      "name": "Main Site",
      "address": "Bygrove Street, Poplar, London, E14 6DN",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Bygrove Street, Poplar, London, E14 6DN",
      "geocode": true,
      "formatted_address": "Bygrove St, Poplar, London E14 6DN, UK",
      "latitude": 51.5125193,
      "longitude": -0.0183834,
      "post_code": "E14 6DN",
      "city": "Greater London",
      "route": "Bygrove Street",
      "postal_town": "London"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Funding\\r\n\\r\nWe have two routes into teaching - salaried or fee-paying.\\r\nCourse fees for the fee-paying route are £9,250\\r\nThis includes QTS and a PGCE with 60 level 7 masters credits\\r\n\\r\nCurrently (September 2018), salaried trainees receive a salary at Point One on the Unqualified Teachers Scale.  Salaried trainees also receive QTS and a PGCE with 60 masters credit.  \\r\n\\r\n\\r\n",
    "AboutCourse": "Our training programme has been highly commended in our Ofsted report.   \\r\nOur partner schools are all in Tower Hamlets or Newham. Please see our prospectus on (www.letta.org.uk) for lists of current partner schools.  Training days take place at Stebon Primary, E14.\\r\n\\r\nTrainees are out of school once a week and sometimes on other occasions.  The training covers various topics eg.,\\r\n\\r\n* Mindset theory\\r\n* Learning theories\\r\n* Child development\\r\n* Planning\\r\n* Assessment\\r\n* Behaviour for Learning/Behaviour Management\\r\n* Philosophy for children (p4c)\\r\n* Shared/guided reading/phonics\\r\n* Literacy\\r\n* Maths\\r\n* Science\\r\n* Foundation subjects\\r\n* Drama\\r\n* Dance\\r\n* RE\\r\n* EAL\\r\n* SEND\\r\n* Safeguarding\\r\n* Children's wellbeing\\r\n\\r\nSessions are led by school practitioners, LETTA tutors, consultants, authors, nationally known figures,   eg.,  Prof. Barry Hymer, Pie Corbett,  Jenny Mosley, Dr. Bill Rogers, Sir John Jones.\\r\n\\r\nTrainees are in school for four days a week.   Over the course of the year, the amount of planning and teaching gradually increases so that trainees become accomplished teachers ready for their first year as a Newly Qualified Teacher.  Trainees work alongside a class teacher/mentor who consistently demonstrates good and outstanding practice.  Trainees also learn by observing mentors and school staff, and focusing upon children’s learning.  Trainees attend all school inset and meetings and are part of the school team.\\r\n\\r\nTrainees also have experiences in other schools including Phoenix Primary and Secondary School (autism focus) and for the 5-11 group, a secondary school. (KS3 focus)    The programme also includes visits to other primary schools and settings.\\r\n\\r\nThere is an opportunity for a science field trip to Oxford and we visit schools in Milton Keynes for a contrast.  LETTA has a strong emphasis on creativity. Drama, dance and cross-curricular learning is a feature of all our programmes.\\r\n\\r\nThe PGCE is led by tutors from Sheffield Hallam University who visit us to deliver the course.  There are two assignments. The first is about classroom talk  and the second a collaborative lesson study - an area of research chosen by trainees.\\r\n\\r\nLETTA monitors workload carefully.  We build in study days into the LETTA timetable, keep paperwork relevant to trainees' learning and provide personal and pastoral support when necessary.\\r\n\\r\nLETTA prides itself in giving wellbeing a priority. We encourage social events, and discussion and communication so we can support each other and celebrate successes, no matter how small.  We will get to know you as individuals.",
    "CourseLength": "OneYear",
    "Qualifications": "You need \\r\n\\r\n* Grade C / Level 4 in English, maths, science GCSEs.\\r\n* A-level Grade B in Maths for the maths specialism.\\r\n\\r\nWe accept equivalencies from AStar and Equivalency Testing.\\r\n(https://www.astarteachers.co.uk)  (http://www.equivalencytesting.com)\\r\n\\r\n* A  2:2 degree or above and a transcript detailing degree marks/modules.  We don't accept a 3rd class degree.\\r\n* We see originals of all certificates.  We advise applicants to buy copies  if missing.\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n",
    "FinancialSupport": "There are three bursaries:\\r\n\\r\n1. £3,000 for fee-paying trainees. Trainees receive £300 over 10 months starting in October.  \\r\n2. £6,000 for fee-paying trainees on the maths specialism course. Trainees receive £600 over 10 months starting in October)\\r\n\\r\n(If you have a 1st class degree on the maths specialism, you will receive £6,000)\\r\n\\r\n3. A locally funded bursary scheme is available on application to a trainee's training school.   This is for fee-paying trainees only.",
    "InterviewProcess": "Successful shortlisted applicants will be invited to an interview consisting of:\\r\n\\r\n1. A mini-teach with a small group of children - 10 mins\\r\n2. A  written task - 20 mins\\r\n3. An interview  - 30 mins (est)   \\r\n\\r\nApplicants can choose the  mini-teach year group from Reception to Year 5 and choose either English or Maths. We expect a lesson plan to be available for each interviewer. No projectors are available for this.  We need to see applicants interacting with the children.   The criteria will be sent to applicants.\\r\n\\r\nPlease note: those on the maths specialism must do a maths mini-teach.\\r\n\\r\nLETTA send out the written task topic a few days before the interview. So applicants can prepare. It requires applicants to look and respond to a video.  Notes cannot be directly used on the day of the interview. \\r\n\\r\nPlease note: those applying for a specialism, will have an additional written task.  \\r\n\\r\nThe interview panel will have between 3 and 5 interviewers from the LETTA partnership. The panel is usually drawn from partner head teachers and the head teachers of the LETTA Trust/teaching school. \\r\nThe ITT Programme Leader attends all interviews.\\r\n\\r\nLETTA will adjust the interview process for interviewees with particular needs, on request.\\r\n  \\r\nInterviews are held at either Bygrove Primary School, E14 or Stebon Primary School, E14. Both schools have good public transport links.\\r\n\\r\n",
    "OtherRequirements": "The following is needed before training.  \\r\n\\r\n* DBS / criminal record checks\\r\n* Fit for post check through a confidential questionnaire\\r\n* A NARIC statement for qualifications obtained overseas\\r\n* Photo ID\\r\n* Evidence of address \\r\n* Passes in professional skills tests.\\r\n\\r\nInformation and practice tests can be found on (http://sta.education.gov.uk/)   \\r\n\\r\n* It's desirable, not compulsory, to have  some experience of schools before applying.\\r\n\\r\nLETTA\\r\n\\r\n* can arrange  a School Experience day and volunteering if needed. See\\r\n(https://getintoteaching.education.gov.uk/school-experience)\\r\n* has a Ready to Teach initiative for TAs in LETTA schools. Contact (www.lettatsa@pop-edu.org) for more information.",
    "PersonalQualities": "\\r\nLearning to be a teacher requires hard work, commitment and resilience. Without a genuine passion and high level of motivation, then these qualities are weakened.  You need these qualities to overcome any problem that you meet.   We look for people who can manage their time well, be organised and reflect honestly on their practice. We need people who can collaborate, share and have good social skills to enable them to liaise successfully with a range of  professional adults, colleagues and parents.  \\r\nMost of all, you must enjoy being with children and appreciate the importance of your role in their lives.\\r\n",
    "HowSchoolPlacementsWork": "LETTA use their experience with school partners to match successful applicants with schools and mentors.  Trainees will be able to visit schools to ensure they are comfortable in that setting and ensure the journey to school is doable. We will consider personal circumstances eg., for parents, disabilities that require some careful thought about school suitability.\\r\n\\r\nIn addition to the main school placement, there are 3 shorter placements during the year:\\r\n\\r\n•\\tOther Key Stage/Age Phase – 4 weeks in the autumn term \\r\n•\\tSecond School – 5 weeks in the spring term\\r\n•\\tCollaborative creativity placement – 1 week in the spring term\\r\n\\r\nThe collaborative creativity placement involves 4 trainees working in groups to deliver a creative curriculum within the same class.  It's an opportunity to try out new learning and really 'go to town' and enjoy the collaborative experience in a new class. Trainees tell us that this is a highlight of the year.\\r\n\\r\nIf a trainee is on a 3-7 course, placements will cover this age range. Likewise, on the 5-11 course, placements will cover the breadth of the years represented.  \\r\n\\r\nTrainees based at special needs schools, will have a mainstream placement in the autumn term and spend the spring term in another \\r\nmainstream school, in order to meet requirements to meet the Teachers' Standards in a mainstream setting. \\r\n\\r\nTrainees who are also doing a specialism will have additional activities to do eg., visits, talking with senior leaders, attending additional courses. Most of these will be in school time. \\r\n\\r\nTrainees and mentors are visited regularly during the year by LETTA tutors.  They will observe trainees teaching alongside mentors and discuss progress with both trainees and mentors.\\r\n\\r\nThere will also be visits from LETTA lead mentors to ensure mentors are supported in their role.\\r\n\\r\nPlease see the prospectus on (www.letta.org.uk) which lists current school partners.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "\\r\nLETTA is an outstanding provider. See Ofsted report, Jan 2018\\r\n(https://files.api.beta.ofsted.gov.uk/v1/file/2749581).  We offer up to 45 places. \\r\n\\r\nAll aspects of the inspection were outstanding ie: \\r\n\\r\n* Overall effectiveness\\r\n* Trainee outcomes\\r\n* Quality of training\\r\n* Quality of leadership and management\\r\n\\r\nThe following points were highlighted by Ofsted in a rigorous inspection. \\r\n\\r\nLETTA\\r\n\\r\n* has a collaborative and personalised approach to supporting and developing trainees, building upon prior knowledge and expertise.\\r\n* provides outstanding centre-based training every week of the school year. Trainees benefit from the expertise of school-based trainers, LETTA tutors and a wide range of highly knowledgeable external facilitators. Several have international reputations. eg., Bill Rogers, Prof. John Jones, Jenny Mosley, Prof. Barry Hymer.\\r\n* provides an opportunity to visit other local schools, visit schools outside our local area and attend an outdoor science weekend in Oxford.   \\r\n* provides high-quality, bespoke training for mentors to ensure they are well prepared for their role in supporting trainees to be successful teachers. \\r\n* provides continuing support for mentors via lead mentors and LETTA tutors.\\r\n* provides placements in contrasting schools within the partnership and across the age-range of the course (3-7 or 5-11). Placements in a Special Educational Needs setting (SEN) are also possible.\\r\n* arranges a week long collaborative creativity placement where trainees work together in small teams in classes across the partnership.\\r\n* provides excellent pastoral support\\r\n* provides a PGCE with 60 masters credits for all trainees\\r\n\\r\nSee the LETTA prospectus,  newsletters and tweets on \\r\n(www.letta.org.uk)",
    "TrainWithDisability": "\\r\nOfsted recognised the importance that LETTA gives to inclusion and recognising individual needs. \\r\n\\r\n'Since the SCITT opened, 99.5%  trainees have been graded at least good by the end of the course and a high proportion of them have achieved an outstanding grade. There are no significant differences between the attainment of different groups because leaders’ promotion of equality and diversity lies at the heart of the SCITT’s work.' (Ofsted report, 2018, p.5)\\r\n\\r\nDyslexic trainees have achieved the same high standards as their peers.  This includes achieving distinctions in the PGCE module assignments.\\r\n\\r\nOur partner university, Sheffield Hallam, provides access to all  specialist equipment, counsellors and other student services that are provided for students at the university itself.\\r\nSee\\r\n(https://students.shu.ac.uk/regulations/\\r\nequality_and_diversity/index.html)\\r\n\\r\nSome schools have lifts. There is good access to all LETTA schools.  LETTA will discuss individual needs with applicants, in order to ensure the right schools are selected for training and needs are communicated.   ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "\\r\nSince the SCITT opened:\\r\n\\r\n* 100% gained employment as teachers at the end of their training.\\r\n* 99.5% gained a PGCE.\\r\n* 99% completed the course.\\r\n* 65%  of trainees gain outstanding grades.  \\r\n\\r\nLETTA\\r\n\\r\n* provides a variety of courses and specialisms in maths and SEN.\\r\n* offers support for the maths skills test.\\r\n* has started to offer pre-course subject knowledge enhancement days - initially in maths.\\r\n\\r\nEvery year, an average of 16 ex-trainees become school-based mentors.",
        "UcasInstitutionCode": "24Z"
      }
    ]
  },
  "has_inst": true
}
