{
  "locationType": "School",
  "accrediting": null,
  "provider": "Devon Primary SCITT",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "D40/X100",
  "providerCode": "D40",
  "programmeCode": "X100",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "D40",
    "addr_1": "Tollards Training Centre",
    "addr_2": "WESC Foundation",
    "addr_3": "Topsham Road",
    "addr_4": "Exeter",
    "postcode": "EX2 6HA ",
    "url": "http://www.dpscitt.ac.uk",
    "geocode": true,
    "formatted_address": "Topsham Rd, Exeter EX2 6HA, UK",
    "latitude": 50.703114,
    "longitude": -3.4943119,
    "post_code": "EX2 6HA",
    "city": "Devon",
    "route": "Topsham Road",
    "postal_town": "Exeter"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "Tuition Fees are £9,000 for the year.",
    "AboutCourse": "“Outstanding training contributes to outstanding outcomes for all trainees” (Ofsted 2016)\\r\n\\r\nDPSCITT offers a one year PGCE Programme with Qualified Teacher Status, preparing you to teach in the 5-11 age range.  Tuition Fees are £9,000.\\r\n\\r\nThis is a highly interactive, relationship based course where learning is through dialogue and reflection on experience linked to educational theory \\r\n\\r\nA Cohort of 40 Trainees forms an enthusiastic, positive learning environment - large enough to bring a broad range of experiences and small enough for everyone to feel known and valued.  You first meet on Induction day and then our 3 day Residential.\\r\n\\r\nOne of our experienced core team will be your Personal Tutor. They are available at central training days for 1:1 discussions, visit you in your school and provide 24/7 support through e-mail and phone.\\r\n\\r\nCentre-Based Training forms 25% of our programme.  This is a cohesive, holistically structured taught course, delivered centrally by outstanding consultants and serving practitioners who are passionate about their subject.  \\r\nWe provide outstanding training in the core subjects of English, Mathematics and Science, the National Curriculum Foundation subjects, Child Development, Behaviour Management, Diversity and Inclusion.  Tutors encourage creative and dynamic approaches to curriculum design.\\r\n\\r\nYou complete 4 Assignments during the year to further develop your subject knowledge for teaching by interaction with children, enabling you to relate theory and practice in Calculation, SEND, Phonics and Creative Curriculum Design.\\r\n\\r\nSchool-based training forms 75% of our programme.  You are welcomed on the first day of term into our Partnership Schools, where you train in both Key Stage 1 and Key Stage 2, working alongside successful practitioners who model excellent practice and support planning.\\r\nA dedicated School-Based tutor and experienced learning coach meets with you every week to guide your training.\\r\nGap tasks link your centre based training to working with children in school, enabling theory and research to be observed in practice across different classrooms.\\r\n\\r\nYou complete Assessed Teaching Practices each term (4 weeks in Autumn, 4 weeks in Spring and 8 weeks in the Summer term) together with an additional 2 week Integrated Project (a creative, cross-curricular sequence that you design yourself and bring all of your passions and interests into).\\r\n\\r\nThere is an opportunity to complete a 12 week placement in a Special School setting in the Spring Term, for those who may wish to teach within a Special School or become a SENCO. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Degree \\r\nCandidates will need to hold a degree of a United Kingdom Higher Education Institution or equivalent qualification. \\r\n\\r\nGCSE \\r\nAt the time of application, candidates must have GCSE Grade C or above (or equivalent) in English, Mathematics and Science. \\r\n",
    "FinancialSupport": "\\r\nDPSCITT has a small means tested bursary for Trainees on the programme that may experience financial difficulties during the year.  Contact us if you wish to know more.\\r\n",
    "InterviewProcess": "Applications are accepted through the UCAS system and we encourage applicants to apply as early as possible. \\r\nYou will be asked to supply 2 references. These should be from professional referees which includes your current employer if working, Academic referees if you graduated within the last 3 years, and a school experience reference if applicable.  Please ask your referees to include the following statement in their reference if applicable “I know of no reason why the applicant should not work with children”.\\r\n\\r\nUp to six candidates are invited to an interview day which takes place at one of our Partnership Schools. The selection panel comprises of the Programme Manager, Senior Tutor and Headteachers. \\r\n\\r\nDuring the day, candidates will: \\r\n\\r\n* Share a prepared story to a group of six children followed by an activity, linked to the story, to extend the children's learning \\r\n* Complete a written evaluation of the story session. The written evaluation should identify what went well and how the teaching session could be improved in preparation for the individual interview in the afternoon.\\r\n* Complete a Literacy and Maths paper\\r\n* Take part in a group exercise to show their ability to collaborate and give a one minute presentation based on the outcome of this exercise \\r\n* Candidates are also interviewed individually by the selection panel. \\r\n\\r\nThere are plenty of opportunities to ask questions and understand the nature of the course you are committing to, and to meet current and past Trainees.\\r\n",
    "OtherRequirements": "Candidates are required to successfully complete the following before starting the programme:\\r\n\\r\n* The Professional Skills Tests in Literacy and Numeracy.\\r\n* A range of Safeguarding Checks regarding your suitability to work with young people, including an Enhanced DBS check \\r\n* A fitness to teach medical declaration.\\r\n",
    "PersonalQualities": "Can you inspire learning in children? \\r\nDo you have a passion for learning yourself? \\r\nDo you have strong interpersonal skills and a desire to develop your personal and professional attributes in a career that makes a difference? \\r\n\\r\nYou will need to: \\r\n\\r\n* love being in the company of children and enjoy their perspectives \\r\n* have excellent interpersonal skills \\r\n* be positive, creative and professional \\r\n* articulate clear and appropriate reasons for wanting to teach primary aged pupils\\r\n* convey enthusiasm and commitment to learning and teaching \\r\n* demonstrate the skills of reflection and analysis \\r\n",
    "HowSchoolPlacementsWork": "School Placements form 75% of the programme.   We organise your placements in schools close to your home base, so you do not need to move during the training year.  You gain experience of teaching in both Key Stage 1 and Key Stage 2 and you decide which Key Stage you would like to focus on.  \\r\n\\r\nYou are welcomed from the first day of term into your main placement school and preferred Key Stage, where you spend the Autumn and Summer Terms.  Then in the Spring term you transfer to your second placement school.  \\r\n\\r\nOur structured school-based programme maximises the power of learning through working alongside successful practitioners who model excellent practice and support your personal development.  A dedicated School-Based tutor, who is an experienced learning coach, meets with you every week to guide your training.\\r\n\\r\nYou will receive: \\r\n\\r\n* The regular support of your School-based Tutor and Class Teacher\\r\n* Weekly seminar meetings to review and develop practice and planning\\r\n* Opportunities to observe and work alongside excellent practitioners\\r\n* Professional guidance from the staff in the school\\r\n* Access to the appropriate school's documentation, resources and ICT facilities \\r\n\\r\n\\r\n“Strong professional relationships lie at the heart of the high-quality training offered by the SCITT. Leaders possess a deep understanding of how teachers learn their craft. Their expert skills in training teachers have been honed through years of collaborative practice and rigorous self-evaluation.” (Ofsted 2016)\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Do you love to see children curious, engaged and growing in all aspects of their learning?\\r\nThen train to be a Teacher with a high quality provider you can trust to lay strong foundations for your teaching career.  \\r\nDPSCITT is a non-profit making partnership of 50 primary schools across Devon, committed to training the next generation of outstanding teachers.  \\r\nOur PGCE is validated by the University of Plymouth.\\r\n\\r\n* OFSTED Outstanding in all areas for the 4th consecutive inspection 2003, 2006, 2009 & 2016  \\r\n‘Inspirational, creative, innovative and transformational’ \\r\n“Outstanding personalised training, professional development and pastoral support”\\r\n“a dynamic training programme .... carefully tailored to meet the needs of each trainee .... the best possible start to their teaching career” (Ofsted 2016)\\r\n* Consistently ranked in the Top 5 of National Training Providers according to the “Good Teacher Training Guide”\\r\n* Ranked 1st nationally for Overall Quality of Training by Newly Qualified Teachers in the last Government survey \\r\n* Our Completion and Employment rates are amongst the highest in the country\\r\n* High quality training programmes to develop your career into the future, from our NQT programme to NPQ Leadership training.  \\r\n\\r\nAt the heart of our programme are core beliefs in the importance of;\\r\n\\r\n* strong, positive relationships with children, their families and adults within school teams\\r\n* high quality, cohesive and personalised training \\r\n* a creative passion for developing all aspects of children and their teachers\\r\n* long term partnerships with schools to develop expert skills in training teachers \\r\n",
    "TrainWithDisability": "As a small cohort we get to know each and every one of our 40 Trainees, their strengths and their areas for development. Your Individual Training needs are discussed with your Course Tutor at the start of the programme and we personalise the Course to your requirements. \\r\n\\r\nYou will be part of a highly supportive group of colleagues and tutors. You are welcomed into your placement schools as part of the school team and treated as members of staff in all respects. \\r\n\\r\n “Learning conversations, which adopt a coaching approach to trainees’ professional development, are at the heart of this outstanding training programme. Skilled DPSCITT and school-based staff ensure each conversation is personal to that trainee and focused on their specific learning successes and areas for development. Through the reflective and transformational nature of the learning conversations trainees develop skills of critical reflection and become adept in identifying their professional development needs”. (Ofsted 2016)\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
