{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Worcester",
  "subjects": [
    "Computer studies",
    "Secondary"
  ],
  "name": "Computer Science",
  "slug": "W80/IX99",
  "providerCode": "W80",
  "programmeCode": "IX99",
  "schools": [
    {
      "name": "Main Site",
      "address": "Henwick Grove, Worcester, WR2 6AJ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Henwick Grove, Worcester, WR2 6AJ",
      "geocode": true,
      "formatted_address": "Worcester WR2 6AJ, UK",
      "latitude": 52.1975549,
      "longitude": -2.2430422,
      "post_code": "WR2 6AJ",
      "city": "Worcestershire",
      "route": null,
      "postal_town": "Worcester"
    }
  ],
  "providerAddress": {
    "inst_code": "W80",
    "addr_1": "Henwick Grove",
    "addr_2": "Worcester",
    "addr_3": "Worcestershire",
    "addr_4": null,
    "postcode": "WR2 6AJ ",
    "url": "http://www.worcester.ac.uk",
    "geocode": true,
    "formatted_address": "Henwick Grove, Worcester WR1 3JE, UK",
    "latitude": 52.201139,
    "longitude": -2.237474,
    "post_code": "WR1 3JE",
    "city": "Worcestershire",
    "route": null,
    "postal_town": "Worcester"
  },
  "options": [
    "PGCE with QTS, full time or part time"
  ],
  "enrichment": {
    "AboutCourse": "Course introduction\\r\nThe University of Portsmouth's PGCE Initial Teacher Training Secondary in Computer Science is a one-year, full-time course for graduates who wish to train as secondary school computer science teachers. It is run by the University's School of Education and Continuing Studies and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level) or the Postgraduate Certificate in Education (with 60 credits towards a Master's degree). The most appropriate route for you can be discussed with the course leader. \\r\n\\r\nOn the PGCE course you will learn not only about issues related to Computer Science teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \\r\n\\r\nCourse aims\\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers' Standards. \\r\n\\r\nMode of study\\r\nThis is a one-year full-time course (36 weeks). \\r\n\\r\nCourse outline\\r\nThe Computer Science course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with mentors and other school staff. \\r\n\\r\nThroughout the year you will be engaged in considering a range of subjects including: \\r\n\\r\n*Subject knowledge enhancement\\r\n*ICT in the classroom\\r\n*Lesson planning\\r\n*Classroom management\\r\n*Research into the pedagogy of computer science.\\r\n*Special needs and inclusion\\r\n*Assessment\\r\n\\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school's teaching staff. You will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom. ",
    "CourseLength": "OneYear",
    "Qualifications": "A good honours degree or equivalent in a relevant subject, ideally with approximately 50% Computer Science content or other relevant experience. GCSE Mathematics and English language at grade C (Grade 4) or above, or equivalent. If in doubt about your qualifications or suitability for the course please contact the course leader for advice. ",
    "OtherRequirements": "All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. All applicants must pass the National College for Teaching and Leadership's professional skills tests in literacy and numeracy before starting the course.",
    "HowSchoolPlacementsWork": "School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education at the University of Worcester has a long-standing reputation for training excellent, highly employable teachers. You will be supported by a dynamic team of tutors who have been outstanding school teachers and are now regarded as education experts with national profiles in a wide range of secondary subjects. \\r\n\\r\nOur courses provide unique opportunities. Trainee teachers may if they wish add depth to their qualifications by involvement in additional enhancement programmes in key areas, such as Special Educational Needs and Disabilities; working with learners who have English as an Additional Language; developing expertise in Citizenship; developing skills in a second STEM subject; preparing to be Education Leaders, or developing skills in Technology Enhanced Learning. These popular enhancements to your training build your confidence as well as greatly enhancing your employability. \\r\n\\r\nYou will benefit from our excellent partnerships with secondary schools across the West Midlands, where our highly-trained mentors pay close attention to your individual development within a friendly and professional context. We also offer pre-training Subject Knowledge Enhancement courses in a range of subjects (Biology, Chemistry, Computer Science, Design and Technology (Food & Textiles), English, French, Geography, Mathematics, Physics) for those who need them and our PGCE offers Master's-level credits as well as Qualified Teacher Status. ",
    "TrainWithDisability": "The University of Worcester offers a wide range of support and advice to disabled students and also to parents, staff and those external agencies supporting disabled students.\\r\n\\r\nOur Disability and Dyslexia Service offers support, advice and guidance to students who have a disability, medical condition or Specific Learning Difficulty (SpLD). This support lasts throughout a student’s studies at the University of Worcester. We also work with and offer support and advice to University staff on how to meet the needs of disabled students.\\r\n \\r\n* Supporting disabled students with general enquiries\\r\n* Implementing special arrangements for lectures, exams and field trips. This might include notes in advance or special arrangements in exams.\\r\n* Where appropriate, we can arrange note takers, academic support tutors, library assistance, interpreters and transcribers.\\r\n* Help with applying for the Disabled Students Allowance (DSA) which is there to fund these types of support in higher education.\\r\n* Limited loans of equipment\\r\n* Confidential advice and support for students and staff\\r\n* Training and awareness raising workshops\\r\n* Assistive technology ",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
