{
  "locationType": "School",
  "accrediting": null,
  "provider": "Carmel Teacher Training Partnership (CTTP)",
  "subjects": [
    "Physical education",
    "Secondary"
  ],
  "name": "Physical Education",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "C23/C66X",
  "providerCode": "C23",
  "programmeCode": "C66X",
  "schools": [
    {
      "name": "Main site",
      "address": "The Headlands, Darlington, DL3 8RW",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "The Headlands, Darlington, DL3 8RW",
      "geocode": true,
      "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
      "latitude": 54.5236052,
      "longitude": -1.5836444,
      "post_code": "DL3 8RP",
      "city": "Darlington",
      "route": "The Headlands",
      "postal_town": "Darlington"
    }
  ],
  "providerAddress": {
    "inst_code": "C23",
    "addr_1": "The Headlands",
    "addr_2": "Darlington",
    "addr_3": null,
    "addr_4": "Co. Durham",
    "postcode": "DL3 8RW ",
    "url": "http://www.carmel.org.uk",
    "geocode": true,
    "formatted_address": "The Headlands, Darlington DL3 8RP, UK",
    "latitude": 54.52360299999999,
    "longitude": -1.5825947,
    "post_code": "DL3 8RP",
    "city": "Darlington",
    "route": "The Headlands",
    "postal_town": "Darlington"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "The PGCE programme in your chosen subject will give you the necessary knowledge and skills to meet the standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits).\\r\n\\r\nThe programme covers a wide range of topics that you will need to address as a teacher. These include planning for learning, classroom management, inclusion, assessment, subject work, wider school issues and other important topics. The topics are not just covered once in the course but are regularly revisited during the year in various contexts. This approach allows continual reinforcement and deepening of your knowledge and understanding of teaching and learning.\\r\n\\r\nThe course duration is approximately 180 days. You will spend approximately 60 days during the course of the training, mostly outside of the classroom on many aspects of teaching. Most of these 60 days of training will be at the Lancaster campus. A number of days will be subject specific, designed to develop your knowledge of how to teach your subject known as Pedagogy for Learning (PFL) days. On these days the both School Direct and university based students are taught together. The other 120 days will be in two contrasting school placements. For these placements you will be supported by both school and university colleagues to meet the standards for QTS. \\r\n\\r\nThe course is assessed in two different ways. The placement module for the QTS element is assessed by school and university colleagues on a pass/ fail basis using a widely recognised trainee teacher assessment matrix. You will also prepare an electronic portfolio to submit as evidence of meeting the QTS standards. The two modules connected to the PGCE are assessed by the submission of four written assignments on teaching and learning in your subject and wider educational issues. The four written assignments are spread across the year to try to even out workload and two of them are formative to help develop your Masters level writing towards the two summative assignments.\\r\n\\r\nThe University of Cumbria and its legacy institutions, St Martins and Charlotte Mason colleges, have a long history of training successful teachers and an excellent record in producing good and outstanding teachers.\\r\n\\r\nFor information:\\r\n(https://www.cumbria.ac.uk/study/courses/postgraduate/secondary-education-with-qts-physical-education-pgce/)\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Carmel Teacher Training Partnership (CTTP) is an outstanding Initial Teacher Training Provider based at Carmel College Darlington, an outstanding 11-18 college. Our training programmes are Primary 5-11 years and Secondary 11-16. We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary and secondary schools, widely spread across the North East of England. The CTTP School Centred Initial Teacher Training course aims to promote excellence in all aspects of education.  This is achieved through high quality central and school-based training activities, regular observations with developmental feedback, to secure progress throughout the training programme.  Central training takes place in clusters around our Lead Schools. Our overarching aim is to provide the most skilled and competent practitioners for our schools, improving the outcomes and life chances for young people. \\r\n\\r\nA very high percentage of trainees on our programme either gain employment in their placement schools, or within our Partnership of schools. Carmel Teacher Training Partnership is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees. Successful completion leads to Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards Masters accreditation, which is completed via the flying faculty of St.  Mary’s University Twickenham but delivered at Carmel College and one of our Northern Lead schools, St Cuthbert’s High, Newcastle.  \\r\n",
    "TrainWithDisability": "All Schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site. Please contact Claire Hutton on chutton@carmel.org.uk with any specific disability access requirements.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
