{
  "locationType": "School",
  "accrediting": null,
  "provider": "Billericay Educational Consortium",
  "subjects": [
    "Primary"
  ],
  "name": "General Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "B28/X100",
  "providerCode": "B28",
  "programmeCode": "X100",
  "schools": [
    {
      "name": "Main Site",
      "address": "The Bromfords School, Grange Avenue, Wickford, SS12 0LZ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "The Bromfords School, Grange Avenue, Wickford, SS12 0LZ",
      "geocode": true,
      "formatted_address": "Grange Ave, Wickford SS12 0LZ, UK",
      "latitude": 51.604702,
      "longitude": 0.508668,
      "post_code": "SS12 0LZ",
      "city": "Essex",
      "route": "Grange Avenue",
      "postal_town": "Wickford"
    }
  ],
  "providerAddress": {
    "inst_code": "B28",
    "addr_1": "c/o Bromfords School",
    "addr_2": "Grange Avenue",
    "addr_3": "Wickford",
    "addr_4": "Essex",
    "postcode": "SS12 0LZ",
    "url": "http://www.billericayscitt.com",
    "geocode": true,
    "formatted_address": "Grange Ave, Wickford SS12 0LZ, UK",
    "latitude": 51.604702,
    "longitude": 0.508668,
    "post_code": "SS12 0LZ",
    "city": "Essex",
    "route": "Grange Avenue",
    "postal_town": "Wickford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "Tuition Fees are £9,000 for the year.",
    "AboutCourse": "“Outstanding training contributes to outstanding outcomes for all trainees” (Ofsted 2016)\\r\n\\r\nDPSCITT offers a one year PGCE Programme with Qualified Teacher Status, preparing you to teach in the 5-11 age range.  Tuition Fees are £9,000.\\r\n\\r\nThis is a highly interactive, relationship based course where learning is through dialogue and reflection on experience linked to educational theory \\r\n\\r\nA Cohort of 40 Trainees forms an enthusiastic, positive learning environment - large enough to bring a broad range of experiences and small enough for everyone to feel known and valued.  You first meet on Induction day and then our 3 day Residential.\\r\n\\r\nOne of our experienced core team will be your Personal Tutor. They are available at central training days for 1:1 discussions, visit you in your school and provide 24/7 support through e-mail and phone.\\r\n\\r\nCentre-Based Training forms 25% of our programme.  This is a cohesive, holistically structured taught course, delivered centrally by outstanding consultants and serving practitioners who are passionate about their subject.  \\r\nWe provide outstanding training in the core subjects of English, Mathematics and Science, the National Curriculum Foundation subjects, Child Development, Behaviour Management, Diversity and Inclusion.  Tutors encourage creative and dynamic approaches to curriculum design.\\r\n\\r\nYou complete 4 Assignments during the year to further develop your subject knowledge for teaching by interaction with children, enabling you to relate theory and practice in Calculation, SEND, Phonics and Creative Curriculum Design.\\r\n\\r\nSchool-based training forms 75% of our programme.  You are welcomed on the first day of term into our Partnership Schools, where you train in both Key Stage 1 and Key Stage 2, working alongside successful practitioners who model excellent practice and support planning.\\r\nA dedicated School-Based tutor and experienced learning coach meets with you every week to guide your training.\\r\nGap tasks link your centre based training to working with children in school, enabling theory and research to be observed in practice across different classrooms.\\r\n\\r\nYou complete Assessed Teaching Practices each term (4 weeks in Autumn, 4 weeks in Spring and 8 weeks in the Summer term) together with an additional 2 week Integrated Project (a creative, cross-curricular sequence that you design yourself and bring all of your passions and interests into).\\r\n\\r\nThere is an opportunity to complete a 12 week placement in a Special School setting in the Spring Term, for those who may wish to teach within a Special School or become a SENCO. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Degree \\r\nCandidates will need to hold a degree of a United Kingdom Higher Education Institution or equivalent qualification. \\r\n\\r\nGCSE \\r\nAt the time of application, candidates must have GCSE Grade C or above (or equivalent) in English, Mathematics and Science. \\r\n",
    "FinancialSupport": "\\r\nDPSCITT has a small means tested bursary for Trainees on the programme that may experience financial difficulties during the year.  Contact us if you wish to know more.\\r\n",
    "InterviewProcess": "Applications are accepted through the UCAS system and we encourage applicants to apply as early as possible. \\r\nYou will be asked to supply 2 references. These should be from professional referees which includes your current employer if working, Academic referees if you graduated within the last 3 years, and a school experience reference if applicable.  Please ask your referees to include the following statement in their reference if applicable “I know of no reason why the applicant should not work with children”.\\r\n\\r\nUp to six candidates are invited to an interview day which takes place at one of our Partnership Schools. The selection panel comprises of the Programme Manager, Senior Tutor and Headteachers. \\r\n\\r\nDuring the day, candidates will: \\r\n\\r\n* Share a prepared story to a group of six children followed by an activity, linked to the story, to extend the children's learning \\r\n* Complete a written evaluation of the story session. The written evaluation should identify what went well and how the teaching session could be improved in preparation for the individual interview in the afternoon.\\r\n* Complete a Literacy and Maths paper\\r\n* Take part in a group exercise to show their ability to collaborate and give a one minute presentation based on the outcome of this exercise \\r\n* Candidates are also interviewed individually by the selection panel. \\r\n\\r\nThere are plenty of opportunities to ask questions and understand the nature of the course you are committing to, and to meet current and past Trainees.\\r\n",
    "OtherRequirements": "Candidates are required to successfully complete the following before starting the programme:\\r\n\\r\n* The Professional Skills Tests in Literacy and Numeracy.\\r\n* A range of Safeguarding Checks regarding your suitability to work with young people, including an Enhanced DBS check \\r\n* A fitness to teach medical declaration.\\r\n",
    "PersonalQualities": "Can you inspire learning in children? \\r\nDo you have a passion for learning yourself? \\r\nDo you have strong interpersonal skills and a desire to develop your personal and professional attributes in a career that makes a difference? \\r\n\\r\nYou will need to: \\r\n\\r\n* love being in the company of children and enjoy their perspectives \\r\n* have excellent interpersonal skills \\r\n* be positive, creative and professional \\r\n* articulate clear and appropriate reasons for wanting to teach primary aged pupils\\r\n* convey enthusiasm and commitment to learning and teaching \\r\n* demonstrate the skills of reflection and analysis \\r\n",
    "HowSchoolPlacementsWork": "School Placements form 75% of the programme.   We organise your placements in schools close to your home base, so you do not need to move during the training year.  You gain experience of teaching in both Key Stage 1 and Key Stage 2 and you decide which Key Stage you would like to focus on.  \\r\n\\r\nYou are welcomed from the first day of term into your main placement school and preferred Key Stage, where you spend the Autumn and Summer Terms.  Then in the Spring term you transfer to your second placement school.  \\r\n\\r\nOur structured school-based programme maximises the power of learning through working alongside successful practitioners who model excellent practice and support your personal development.  A dedicated School-Based tutor, who is an experienced learning coach, meets with you every week to guide your training.\\r\n\\r\nYou will receive: \\r\n\\r\n* The regular support of your School-based Tutor and Class Teacher\\r\n* Weekly seminar meetings to review and develop practice and planning\\r\n* Opportunities to observe and work alongside excellent practitioners\\r\n* Professional guidance from the staff in the school\\r\n* Access to the appropriate school's documentation, resources and ICT facilities \\r\n\\r\n\\r\n“Strong professional relationships lie at the heart of the high-quality training offered by the SCITT. Leaders possess a deep understanding of how teachers learn their craft. Their expert skills in training teachers have been honed through years of collaborative practice and rigorous self-evaluation.” (Ofsted 2016)\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Join our well-structured, supportive School-Centred Initial Teacher Training course. \\r\n\\r\nAt the end of the course, our trainees say that they feel confident and fully prepared to start their teaching career.\\r\n\\r\n100% of our trainees gain employment, and enjoy the benefit of our support into their first teaching post and beyond.\\r\n\\r\nOur course offers great value for money – we deliver quality workshops, carefully identified placements, individual pastoral support and academic support in writing assignments. Our focus is on you as an individual, providing you with a tailor-made training programme.\\r\n\\r\nWe offer:\\r\n\\r\n•\\ta training programme that has been rated ‘Outstanding’ by Ofsted for the past 12 years and placed in the top five of the ‘Good Teacher Training Guide’ for the past 10 years;\\r\n•\\texperienced school mentors who are passionate about developing outstanding and confident Newly Qualified Teachers;\\r\n•\\tengaging workshops delivered by outstanding and knowledgeable teachers, providing you with a wealth of ideas to inspire pupil learning;\\r\n•\\topportunities to build your confidence in diverse settings, e.g. special school, pupil referral unit and an inner city school where you will be working with pupils with English as an additional language;\\r\n•\\ta Postgraduate Certificate in Education, worth 60 Master credits. This provides an ideal opportunity to bring together the very best of school experience and academic study; \\r\n•\\topportunity for you to request a school where you would like to train.\\r\n\\r\nMake us your first choice and train with the best in Essex.\\r\n\\r\n\\r\n",
    "TrainWithDisability": "Our aim is to promote and implement an inclusive learning and teaching environment, allowing you to study independently.\\r\n\\r\nWe are here to support you and would encourage you to contact us so we can help identify an ‘appropriate adjustments’ to meet your individual needs.\\r\n\\r\nOnce you have applied for our course, we are available for you to contact to discuss your particular needs.  We have had trainees who have successfully passed our course with visual and hearing impairments, dyslexia, dyspraxia and autistic spectrum conditions.  \\r\n\\r\nWe understand your needs and will work closely with you to ascertain the impact of your condition on your studies.  It may be you need:\\r\n\\r\n•\\tdeadlines to be extended;\\r\n•\\tworkshops to be recorded;\\r\n•\\tpowerpoint presentations in advance of workshops\\r\n•\\tphotocopying on coloured paper\\r\n•\\twheelchair access\\r\n\\r\nWith your permission, we will ask your mentor to work with you providing support and guidance.  We need to ensure that all elements of this training year make ‘reasonable adjustments’ to provide every opportunity for you to succeed.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
