{
  "locationType": "School",
  "accrediting": null,
  "provider": "Cornwall School Centred Initial Teacher Training (Cornwall SCITT)",
  "subjects": [
    "English",
    "Secondary"
  ],
  "name": "English",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "C79/Q3X1",
  "providerCode": "C79",
  "programmeCode": "Q3X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Truro College, College Road, Truro, Cornwall, TR1 3XX",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Truro College, College Road, Truro, Cornwall, TR1 3XX",
      "geocode": true,
      "formatted_address": "College Road, Truro TR1 3XX, United Kingdom",
      "latitude": 50.26305139999999,
      "longitude": -5.1006011,
      "post_code": "TR1 3XX",
      "city": null,
      "route": null,
      "postal_town": "Truro"
    }
  ],
  "providerAddress": {
    "inst_code": "C79",
    "addr_1": "Truro College",
    "addr_2": "College Road",
    "addr_3": "Truro",
    "addr_4": "Cornwall",
    "postcode": "TR1 3XX ",
    "url": "http://www.cornwallscitt.org",
    "geocode": true,
    "formatted_address": "College Road, Truro TR1 3XX, United Kingdom",
    "latitude": 50.26305139999999,
    "longitude": -5.1006011,
    "post_code": "TR1 3XX",
    "city": null,
    "route": null,
    "postal_town": "Truro"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Course introduction\\r\nThe University of Portsmouth's PGCE Initial Teacher Training Secondary in English is a one-year, full-time course for graduates who wish to train as secondary school English teachers. It is run by the University's School of Education and Continuing Studies and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level) or the Postgraduate Certificate in Education (with 60 credits towards a Master's degree). \\r\n\\r\nEnglish is a core subject of the secondary curriculum at Key Stage 3 and 4. English is an engaging and constantly evolving subject in the school curriculum. On the PGCE course you will learn not only about issues related to English teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \\r\n\\r\nCourse aims\\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers' Standards. \\r\n\\r\nMode of study\\r\nThis is a one-year full-time course (36 weeks). \\r\n\\r\nCourse outline\\r\nThe English course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with mentors and other school staff. \\r\n\\r\nThroughout the year you will be engaged in considering a range of subjects including: \\r\n\\r\n*subject knowledge enhancement\\r\n*ICT in the classroom\\r\n*lesson planning\\r\n*classroom management\\r\n*special needs and inclusion\\r\n*assessment\\r\n*creative learning\\r\n\\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school's teaching staff. You will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom. ",
    "CourseLength": "OneYear",
    "Qualifications": "An honours degree in a relevant subject, with approximately 50% English content and a classification of at least 2:1.  GCSE Mathematics and English language at grade C (Grade 4) or above, or equivalent. ",
    "OtherRequirements": "All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. All applicants must pass the National College for Teaching and Leadership's professional skills tests in literacy and numeracy before starting the course.",
    "HowSchoolPlacementsWork": "School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Cornwall SCITT is an outstanding provider of teacher training for Primary and Secondary teaching routes.\\r\n\\r\nWe are deeply committed to ensuring the very best outcome for our student teachers and for the young people of Cornwall. Our training programmes reflect the unique needs of young people at all stages of their educational development, and value the importance of bespoke training to ensure that our graduates possess the knowledge and skills to successfully embark on a career in education. For this reason our Primary Course is based at Heartlands, near Redruth, and our Secondary Course is based at Truro College. \\r\n\\r\nOfsted has graded both primary and secondary courses as Outstanding in all categories in their most recent inspections. Embedded in our approach is a strong relationship with local schools; our reputation for providing outstanding training endorses our graduates to local employers. We are supported by specialists working within our partnership schools to ensure that our training reflects current best practice and continues to be innovative.\\r\n\\r\n[Visit the Cornwall SCITT Website] (https://www.cornwallscitt.org/)",
    "TrainWithDisability": "Cornwall SCITT is founded on the principles of equality and inclusion. Our management team, academic tutors, subject leaders and school-based mentors strive to ensure the best possible outcomes for all student teachers. Prior to the start of the course all student teachers undertake a fitness to teach check.\\r\n\\r\nFor those with additional learning needs, every student teacher receives bespoke support from a dedicated academic tutor who can provide support with assignment writing. Truro College offer additional support through the learning resources centre. \\r\n\\r\nWe carefully select placement schools for those with physical needs to optimise any reasonable adjustments that may be required. Mentors and subject leaders provide support to those with visual and hearing difficulties to develop impairment-friendly strategies within the classroom.\\r\n\\r\nOur personalised approach to learning allows those with mental health needs to develop their practice with support from the central management team. We offer in an empathetic dialogue to provide an appropriate balance of support and challenge throughout the programme.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
