{
  "locationType": "School",
  "accrediting": "Leeds Trinity University",
  "provider": "Diocese of Leeds BKCAT Alliance",
  "subjects": [
    "Drama and theatre studies",
    "Secondary"
  ],
  "name": "Drama",
  "slug": "1ZX/2HN8",
  "providerCode": "1ZX",
  "programmeCode": "2HN8",
  "schools": [
    {
      "name": "St Wilfrid's Main Site",
      "address": "Cutsyke Road, Featherstone, Pontefract, West Yorkshire, WF7 6BD",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Cutsyke Road, Featherstone, Pontefract, West Yorkshire, WF7 6BD",
      "geocode": true,
      "formatted_address": "Cutsyke Rd, Featherstone, Pontefract WF7 6BD, UK",
      "latitude": 53.6986342,
      "longitude": -1.3637311,
      "post_code": "WF7 6BD",
      "city": "Featherstone",
      "route": "Cutsyke Road",
      "postal_town": "Pontefract"
    }
  ],
  "providerAddress": {
    "inst_code": "1ZX",
    "addr_1": "St Wilfrid's Catholic HS & SFC",
    "addr_2": "Cutsyke Road",
    "addr_3": "Featherstone",
    "addr_4": "West Yorkshire",
    "postcode": "WF7 6BD ",
    "url": "http://www.st-wilfrids.bkcat.co.uk",
    "geocode": true,
    "formatted_address": "Cutsyke Rd, Featherstone, Pontefract WF7 6BD, UK",
    "latitude": 53.6962035,
    "longitude": -1.363285,
    "post_code": "WF7 6BD",
    "city": "Featherstone",
    "route": "Cutsyke Road",
    "postal_town": "Pontefract"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "We are looking for the next generation of outstanding teachers who are passionate about children and education but also care about our schools, the communities they serve and the distinctive ethos each of those schools have. \\r\nThey will have experience of working with young people - perhaps voluntary work such as youth groups, sports teams, church groups, community groups and ideally some of which is in school so they have a good awareness of how schools operate and teachers work. They will be able to talk about how they have engaged, communicated with and inspired young people they have worked with. They might have non education work and life experience that they can draw on to show they will be a great role model to young people and a natural communicator and professional team player in a school. They might have experience that shows they can work under pressure, learn quickly and take constructive feedback to improve one's own performance\\r\n\\r\nWe work in partnership with Leeds Trinity University who accredit and co-deliver our course. The course is 100% school based and leads to a PGCE qualification with QTS and Master's credits. \\r\nAssessment is both summative and formative during each of three progressive stages, each taking place over a twelve week period. At the end of each stage you will be required to submit a portfolio of evidence which is moderated and validated by school based and university based tutors for Quality Assurance. \\r\n\\r\n\\r\nTrainee teachers will have hub school study days. They will also have web access to Leeds Trinity University's Learning Platform for the PGCE and Master's element of the course and most schools provide web access to their own Learning Platforms and Staff Intranets and email systems to enable working for home for planning lessons and assessing children's work remotely. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You should be a graduate with a relevant degree, preferably with a 1st or 2:1 though we are willing to consider applicants who have a lower class degree but can demonstrate passion and aptitude for teaching and working well with children. You should have a degree in which the majority of the content is related to the subject you will be teaching. \\r\n\\r\nYou will need, by the start of the course, GCSE  in Maths and English and for primary also GCSE grade  in Science. ",
    "InterviewProcess": "Interviews are subject specific and will include a formal interview about subject knowledge and teaching methods, understanding of the role and responsibility of teachers as well as observed sessions where you will be working with children. \\r\n\\r\nAs we are a large alliance we often work as a team to interview groups of applicants in one school. This means applicants should read about the schools they wish to be placed in and should also consider contacting them to ask for a visit so they understand the ethos of the school, its catchment and practicalities like travelling distances and are then better able to express a preference for home school placement. We cannot guarantee to offer successful applicants their first choice of school but we try hard to match applicants to schools for mutual benefit.\\r\n",
    "HowSchoolPlacementsWork": "We work in partnership with Leeds Trinity University who accredit and co-deliver our course. The course is 100% school based and leads to a PGCE qualification with 60 Master's credits. The school based approach means you will train by working alongside and being mentored by people who can demonstrate and model exemplary practice on a daily basis with the same children you will be teaching. \\r\nThere are no blocks of time out at a University therefore you will be able to experience the full cycle of the school year from welcoming and settling new children in September to celebrating the success of school leavers in July, and the different challenge each phase of the school year presents. \\r\nYou will spend most of the training year in one school (the 'home school'). These schools are central to the selection process and our school based interview system. You can express a preference for your home school but we cannot guarantee to meet everyone's preference. \\r\nYou will complete the course in your home school having experienced a shorter placement in an alternative, contrasting setting part way through the year. Whilst we make every attempt to make sure the alternative placement school is in an accessible location it may involve a few weeks of travelling further to get that all important contrasting experience. \\r\nThroughout the course there are regular study days delivered by a blend of Leeds Trinity University staff and school based staff which take place at a local hub school. At the hub school you will work with a small group of fellow trainees from other Diocese of Leeds BKCAT Alliance Schools so not only will you be able to enjoy lively interactive sessions where others contribute to your learning you will also have that all important peer group for support and a social life when it's time to relax.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Diocese of Leeds BKCAT Alliance offers the opportunity to train to teach alongside serving outstanding teachers in a scheme overseen by St Wilfrid’s Catholic High School & Sixth Form College, a Leading Edge school.\\r\n\\r\nSt Wilfrid’s has expanded into a large School Direct partnership working with 16 schools across Primary and Secondary phases. Training with the Diocese of Leeds BKCAT Alliance can therefore be tailored to your needs and the type of school you are drawn to with experience available in a range of settings. All the schools are committed to playing a significant role in training up their own future teachers as part of this collaborative network.\\r\n\\r\nSt Wilfrid’s has a national reputation as an award winning school which makes it an ideal leader of our innovative approach to school based teacher training.\\r\n\\r\nSt Joseph’s Castleford lead the primary aspect of the Alliance. They offer opportunities to train in an environment where teaching and learning are centred on the teaching and example of Jesus Christ in secure, well-ordered schools which allow for the spiritual, emotional and intellectual growth of the pupils.\\r\n\\r\n\\r\nChild Care Facilities\\r\n\\r\nWe have no onsite child care facilities but we are happy to advise trainees about local providers close to our schools, many of which are used by our existing staff.\\r\n\\r\n\\r\n\\r\n",
    "TrainWithDisability": "Disability Access\\r\n\\r\nDisabled access to our schools is good but we ask people to discuss their specific needs with us so we can place trainees at the most suitable school to meet their needs.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Assessment\\r\n\\r\nWe work in partnership with Leeds Trinity University who accredit and co-deliver our course. The course is 100% school based and leads to a PGCE qualification with 60 Master’s credits. Master’s modules can be completed in the NQT year and act as a bridge into further professional development.\\r\n\\r\nAssessment is both summative and formative during each of three progressive stages, each taking place over a twelve week period. At the end of each stage you will be required to submit a portfolio of evidence which is moderated and validated by school based and university based tutors for Quality Assurance.",
        "UcasInstitutionCode": "L24"
      }
    ]
  },
  "has_inst": true
}
