{
  "locationType": "School",
  "accrediting": "University of Northumbria at Newcastle",
  "provider": "Whitley Bay Teaching School Alliance",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "1HM/2K8K",
  "providerCode": "1HM",
  "programmeCode": "2K8K",
  "schools": [
    {
      "name": "Main Site",
      "address": "Whitley Bay High School, Deneholm, Whitley Bay, NE25 9AS",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Whitley Bay High School, Deneholm, Whitley Bay, NE25 9AS",
      "geocode": true,
      "formatted_address": "Deneholm, Whitley Bay NE25 9AS, UK",
      "latitude": 55.0481908,
      "longitude": -1.4659412,
      "post_code": "NE25 9AS",
      "city": "Tyne and Wear",
      "route": "Deneholm",
      "postal_town": "Whitley Bay"
    }
  ],
  "providerAddress": {
    "inst_code": "1HM",
    "addr_1": "Whitley Bay High School",
    "addr_2": "Deneholm",
    "addr_3": "Whitley Bay",
    "addr_4": "Tyne & Wear",
    "postcode": "NE25 9AS",
    "url": "http://www.whitleybayhighschool.org",
    "geocode": true,
    "formatted_address": "Deneholm, Whitley Bay NE25 9AS, UK",
    "latitude": 55.0481908,
    "longitude": -1.4659412,
    "post_code": "NE25 9AS",
    "city": "Tyne and Wear",
    "route": "Deneholm",
    "postal_town": "Whitley Bay"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The majority of your training will be based in school, although some time will be spent in either Newcastle or Northumbria Universities, where part of professional studies aspect of the course will be delivered. \\r\n\\r\nOver the course of the School Direct training year, you will be placed in two schools where you will undertake the actual classroom practice.  These placements are chosen to offer you a high-quality, diverse training experience. From the beginning, you will be treated like a member of staff and will attend staff meetings and CPD training programmes in both training schools.\\r\n\\r\nIn each school, you will be allocated an experienced subject mentor who will oversee and monitor your progress and development. They will help introduce you to school life, give you support with lesson planning and preparation, and look at effective classroom practices. Furthermore, you will have weekly meetings with them to reflect on your teaching, with your mentor tailoring their support so that you have training programme that meets your needs.\\r\n\\r\nDuring two teaching placements, your progress will be monitored and supported through weekly observations by your mentor or the staff within your department. In addition, you will receive observations from Whitey Bay’s Director of Initial Teacher Training, your school’s Professional Tutor and your University Tutor.\\r\n\\r\nTo further support you in becoming an outstanding practitioner, you will participate in a training programme with your School Direct peers.  Training will be delivered by highly skilled teachers, from within our alliance of schools, and will cover areas such as: Safeguarding, Literacy, Meeting the needs of different learners, Questioning, Lesson Planning, Behaviour for Learning, Progress and Assessment for Learning, Stretching the most able and Preparing for Interview. In addition, you will receive rigorous support to develop your understanding of subject specific pedagogy.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You will be a graduate, preferably with a 1st or a 2:1. We are willing to consider applicants who have a 2:2 who can demonstrate a real aptitude for teaching and learning.\\r\n\\r\nFor Secondary, you must have a degree in which the majority of the content (60%) is in the subject you wish to teach. It must be from a United Kingdom Higher Education Institution or equivalent qualification.\\r\n\\r\nYou need at least a grade C in both GCSE English and Maths (and Science for Primary applicants) and a good A level grade in the subject you wish to teach (Secondary).\\r\n",
    "InterviewProcess": "Whitley Bay High is the lead school in our alliance and we will co-ordinate the recruitment process. \\r\n\\r\nIf you are applying to the Secondary programme, you will be asked to prepare a ten-minute presentation to the Director of ITT and a Deputy Headteacher on a topic relating to your subject, explaining how you would teach the lesson and make it engaging and challenging.  You will also meet with a subject specialist to discuss developments within your subject and your understanding of your subject within a school context.\\r\n\\r\nIf you are applying to the Primary programme, interviews will take place in one of the Primary schools within the alliance. The process will involve spending time at the school, interacting with the children and being involved in a number of activities followed by an interview. The interview panel will consist of representative/s from the Primary schools and the Director of ITT. \\r\n\\r\nOur interviews are a rigorous and thorough process, designed to get the best match of applicant to the places available.\\r\n\\r\nAll offers to train within WBTSA are conditional. Conditions may include: a DBS; Fitness to Teach; completion of professional skills tests in literacy and numeracy; as well as original documentary evidence of degree and GCSE qualifications. You may be required to complete a subject enhancement course (SKE) before your training begins. We also strongly recommend you spend time in school to gain insight into current educational organisations.\\r\n",
    "OtherRequirements": "It is desirable that you are able to tell us about recent experience in a relevant school setting.  Your references should be able to tell us about your skills, experience and the contribution you have made within a range of contexts for example: academic, business, educational.\\r\n\\r\nYou will be expected to have passed the literacy and numeracy skills tests visit http://sta.education.gov.uk/ for more information. There may be delays in booking a date for the tests due to the sheer volume of requests so book your tests as early as possible.\\r\n",
    "PersonalQualities": "We are looking for dynamic, committed and ambitious trainees with a passion for teaching and learning.  You must have a desire to inspire young people and an ability to share and communicate your enthusiasm for your subject.  We would expect you to be well-organised, hard-working, empathetic, approachable and resilient. You need to be willing to evaluate your practice and be able to respond to feedback given.  \\r\n\\r\nIt is desirable that you will have experience of working with children in either a paid or voluntary capacity.  It would be advantageous if you have had some school experience.\\r\n",
    "HowSchoolPlacementsWork": "If you train with us, you will have two teaching placements in our Partnership of schools, which are conveniently located across the North Tyneside, Newcastle and Northumberland area. Given our locality, we are proud to offer a great diversity of age-ranges in our placement schools: we have First, Primary, Middle, Secondary and High Schools all within our alliance.  \\r\n\\r\nYour two placement schools are selected in order to provide you a unique opportunity to experience a diverse and varied range of teaching and learning opportunities and be immersed in schools with very different ethea.  Your previous experiences are also taken into account when allocating placement schools.  Regardless of where you are placed, highly experienced and inspirational practitioners will design a bespoke training programme, which will allow you to evolve into an outstanding and reflective teacher.\\r\n\\r\nIn additional to the alliance led training, Primary trainees have three teaching placements (lasting a total of 20 weeks) across two schools.  You will also have 10 weeks of training at the University over the course of the year.\\r\n\\r\nIn additional to the alliance led training , Secondary trainees will spend a term in one school and one and a half terms in the other.  Secondary trainees will be trained for Key Stage 3 and 4 and you will also be offered Sixth Form experiences in order to develop your teaching skillset and employability.  During this time, you will also attend University for approximately a day a week.\\r\n\\r\nApplicants must be aware that they may be placed in any of our excellent partner schools throughout the training year. We aim to provide a varied teaching experience in a range of different school contexts. All of our schools can be accessed via public transport. \\r\n\\r\nPlease visit https://www.whitleybayhighschool.org/teaching-school/school-direct-primary-secondary for the list of schools within our alliance. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Whitley Bay High School is the lead school in a Cohort 1 Teaching School Alliance (TSA). We were awarded the status in July 2011 in recognition of the outstanding teaching, learning and training in the school. \\r\n \\r\nYou can complete your Primary or Secondary Initial Teacher Training through the WBTSA. Our Alliance is comprised of an inspirational partnership of schools that educate young people from Year 1 to Year 13. \\r\n\\r\nOur School Direct  programme means you will be in the classroom from day 1, learning first-hand the knowledge and skills needed to become an outstanding teacher. We work in conjunction with both Newcastle and Northumbria Universities and on successful completion of the training year you will be awarded either a Professional Graduate Certificate (Level 6) in Education or a PGCE (Level 7) with Qualified Teacher Status (QTS).\\r\n\\r\nOur alliance that has a national reputation for the quality of its: Teaching and Learning; innovative and rigorous training; and the exceptional levels of support offered for emerging teachers, as captured in the comments below, taken from our latest cohort of newly qualified trainees:\\r\n\\r\n ‘The most supportive, insightful group of professionals behind you’\\r\n‘Great range of creative and interesting training in a variety of schools’\\r\n‘Quality of training is phenomenal’\\r\n‘Outstanding - the programme is superb as it is delivered by very experienced and approachable staff who genuinely care about you’ \\r\n‘This alliance is at the forefront of teaching and learning’\\r\n ‘Employers are keen when they know you’ve trained with Whitley’\\r\n",
    "TrainWithDisability": "All schools within the Whitley Bay Teaching School Alliance are fully accessible. Provision for additional support where needed is provided on site. \\r\nApplicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools\\r\n\\r\nPlease contact Sharon Armstrong on sharon.armstrong@whitleybayhighschool.org with any specific disability access requirements.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "For those applying for Art, Business Studies, History, Geography or Computer Science, Whitley Bay High School and its partner schools work closely with Northumbria University to provide inspirational training and exceptional support for teachers beginning their careers through the School Direct route into teaching.\\r\nUpon successful completion of the programme you will be awarded either a Professional Graduate Certificate (Level 6) or a Post Graduate Certificate in Education (Level 7), with Qualified Teaching Status (QTS).  \\r\n",
        "UcasInstitutionCode": "N77"
      },
      {
        "Description": "For those applying for Primary, Biology, Chemistry, Design Technology, English, Health and Social Care, MFL, Maths and Physics, Whitley Bay High School and its partner schools work closely with Newcastle University to provide inspirational training and exceptional support for teachers beginning their careers through the School Direct route into teaching.\\r\nUpon successful completion of the programme you will be awarded either a Professional Graduate Certificate (Level 6) or a Post Graduate Certificate in Education (Level 7), with Qualified Teaching Status (QTS). \\r\n\\r\n",
        "UcasInstitutionCode": "N21"
      }
    ]
  },
  "has_inst": true
}
