{
  "locationType": "School",
  "accrediting": "Landau Forte College Derby SCITT",
  "provider": "Landau Forte College Derby SCITT",
  "subjects": [
    "Biology",
    "Science",
    "Secondary"
  ],
  "name": "Biology",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "186/26LS",
  "providerCode": "186",
  "programmeCode": "26LS",
  "schools": [
    {
      "name": "Main Site",
      "address": "Landau Forte College, Fox Street, Derby, DE1 2LF",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Landau Forte College, Fox Street, Derby, DE1 2LF",
      "geocode": true,
      "formatted_address": "Fox St, Derby DE1 2LF, UK",
      "latitude": 52.92717099999999,
      "longitude": -1.473244,
      "post_code": "DE1 2LF",
      "city": "Derby",
      "route": "Fox Street",
      "postal_town": "Derby"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "You will be based in a school from the start and feel part of the team, learning from outstanding professionals who will provide all the hands on training and support you need on a daily basis. You have a subject mentor and follow a programme that is personalised, based on any previous experience you may have. An experienced Subject Knowledge Tutor and mentor will support the development of your subject delivery.\\r\nThroughout the course you will have weekly Professional Studies sessions which provide a framework for you to develop as a teacher and support the practical side of your training with up to date academic research based input. This will include sessions delivered by the University of Derby lecturers who will facilitate the PGCE content of the programme and support you with evidence based research assignments.\\r\nThe majority of your training will take place in one school, with a shorter second placement in a contrasting school.  \\r\nAn important part of the programme is regular feedback. You will have formal observations by your mentor on a weekly basis, and support in reflecting learning from the experience.  Your mentor will also guide you in the evidence you should present in order to meet the assessment criteria for Teachers' Standards.  Each term you will review your progress with your mentor and your programme will be adapted accordingly.\\r\nIn order to meet the requirements for a PGCE with Master’s Level credits, you will be required to complete assignments, relating to theory and practice, demonstrating that you meet Level 7 standards of academic work.\\r\nYour final assessment will take place in the summer term and will involve observations, meetings and discussions with your tutors, mentors and you; reviewing your portfolio of evidence.  You may also meet with an external moderator as part of the quality assurance processes.\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You need to have a pass in English and Mathematics at GCSE grade C/ grade 4 or above, or have a certification in a standard equivalent to Grade C/ grade 4 at GCSE.\\r\nApplicants need a UK degree or equivalent qualification, which will be in, or closely related to, your proposed teaching subject.  As a guideline, at least 50% of your first degree should be directly relevant to the subject you want to teach. You might want to develop your subject knowledge before starting the course and there are a number of subject knowledge enhancement courses designed to support this.\\r\n",
    "InterviewProcess": "We will screen your application for evidence of the characteristics list under ‘What we are looking for’.  Once you have been shortlisted, you will be invited to attend an assessment process which will last approximately 2 hours.  We ask candidates to lead a short 15 minute lesson in your subject area to a small group of students.  An interview with a small panel will include some general teaching and subject specific questions which allows you to demonstrate your passion and enthusiasm for learning. \\r\n",
    "OtherRequirements": "We are committed to safeguarding and promoting the welfare of children and young people and expect all staff and volunteers to share this commitment. All trainees will have a Disclosure and Barring Service (DBS) criminal records check including a check of the children’s barred list.",
    "PersonalQualities": "A genuine interest in young people and a passion for their development and well-being are key. We expect you to be resilient, work hard and be committed, but the work will be rewarding.  Teaching is a job where you can really make a difference to young people's lives. Teaching is about working with others - pupils, colleagues, parents and carers.  By working in our schools we encourage you to work collaboratively, both with other trainees and with our teachers.",
    "HowSchoolPlacementsWork": "Our partner schools are located in Derby, Derbyshire and Tamworth. Most of your training will take place in one school, with a shorter second placement in a contrasting school. We try to place candidates in a location that is suitable for them to get to. Throughout your placement, you will feel like a member of staff: taking part in all aspects of life as a teacher.  You will have a close team of people around you to support, guide and mentor you to achieve success as a trainee and feel ready to take up the challenge of being a Newly Qualified Teacher.  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "At Landau Forte College Derby SCITT, we can recommend you for Qualified Teacher Status and, by working in partnership with the University of Derby, you will be awarded PGCE with 60 Master’s level credits.\\r\nAs the lead school, Landau Forte College Derby, is rated ‘Outstanding’ by Ofsted (May 2012). We have a growing partnership of secondary schools across the local region, where you may be placed to teach students in the age range of 11-16 years.\\r\n\\r\nWe have a great record of achievement for those graduating into the profession and going on to achieve successful careers in education, with  the majority employed within the local area. We are proud of our history of employing many of our trainees within the partnership and of the career progression they demonstrate once qualified.\\r\n\\r\nIf you do decide to begin your journey as a teacher with us, we will offer you opportunities which span your career and as a Newly Qualified Teacher, you will be able to join a range of professional development courses that we offer.\\r\n\\r\nTeaching is a very rewarding profession where you can make a real difference to the life of a young person and have a real impact on their future. Teaching is more than a job; it’s an exciting career where no two days are the same!\\r\n",
    "TrainWithDisability": "Landau Forte College Derby has full disabled access. \\r\nApplicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the appropriate schools. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Throughout your training, you will feel like a member of staff; taking part in all aspects of life as a teacher.  ",
        "UcasInstitutionCode": "25E"
      }
    ]
  },
  "has_inst": true
}
