{
  "locationType": "School",
  "accrediting": "UCL, University College London (University of London",
  "provider": "Catholic Teaching Alliance (South East London)",
  "subjects": [
    "Music",
    "Secondary"
  ],
  "name": "Music",
  "financial_support": "Bursary or Student finance if you’re eligible",
  "slug": "134/2YCR",
  "providerCode": "134",
  "programmeCode": "2YCR",
  "schools": [
    {
      "name": "Bonus Pastor Catholic College",
      "address": "Winlaton Road, Bromley, BR1 5PZ",
      "code": "B"
    },
    {
      "name": "St Catherine's Catholic School for Girls",
      "address": "Watling Street, Bexleyheath, Kent, DA6 7QJ",
      "code": "C"
    },
    {
      "name": "Virgo Fidelis Convent Senior School",
      "address": "Upper Norwood, London, SE19 1RS",
      "code": "V"
    }
  ],
  "addresses": [
    {
      "address": "Winlaton Road, Bromley, BR1 5PZ",
      "geocode": true,
      "formatted_address": "Winlaton Rd, Bromley BR1 5PZ, UK",
      "latitude": 51.4273373,
      "longitude": -0.0019047,
      "post_code": "BR1 5PZ",
      "city": "Greater London",
      "route": "Winlaton Road",
      "postal_town": "Bromley"
    },
    {
      "address": "Watling Street, Bexleyheath, Kent, DA6 7QJ",
      "geocode": true,
      "formatted_address": "Watling St, Bexleyheath DA6 7QL, UK",
      "latitude": 51.45485,
      "longitude": 0.154789,
      "post_code": "DA6 7QL",
      "city": "Greater London",
      "route": "Watling Street",
      "postal_town": "Bexleyheath"
    },
    {
      "address": "Upper Norwood, London, SE19 1RS",
      "geocode": true,
      "formatted_address": "Central Hill, London SE19 1RS, UK",
      "latitude": 51.4215139,
      "longitude": -0.0945017,
      "post_code": "SE19 1RS",
      "city": "Greater London",
      "route": "Central Hill",
      "postal_town": "London"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Why should I join the CTA?\\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Teaching Alliance is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\\r\n\\r\nWe at the CTA are passionate about developing a generation of outstanding teachers and want to provide as much support as we can to ensure committed, enthusiastic and capable people make it on to our teacher training scheme. We offer excellent teacher training in partnership with UCL, with all courses resulting in a PGCE qualification. \\r\n\\r\nWe run an extensive CPD programme including two Early Career Conferences in the autumn and summer terms and School Study Visits in the spring term, providing networking opportunities and the chance to observe teaching in other schools within the Catholic Teaching Alliance,  in line with both your university studies and personal areas of development. Opportunities for school-based research and reflection, along with the sharing of outstanding expertise within a business-like model form the heart of our work.\\r\n\\r\nAn induction programme will be provided in school to supplement your university provision. The weekly sessions will cover a range of topics relevant to your training, including safeguarding; lesson planning, marking, and pastoral aspects such as the role of a form tutor. You will be fully involved in the life of the school attending parents' evenings and participating in school trips,\\r\n\\r\nAbout the University Course\\r\nUCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education.\\r\n\\r\nThe PGCE is a 60-credit, Masters-level course and students must pass the two M-level modules and demonstrate that they have met the Teachers’ Standards.\\r\n\\r\n[School Direct Music at UCL](http://www.ucl.ac.uk/ioe/courses/teacher-training/music-school-direct-pgce) \\r\n\\r\nYou will attend university training days at UCL Institute of Education alongside students recruited via other routes and other School Direct partnerships. On the Tuition Fee routes you will carry out academic assignments leading to the award of masters level credits.\\r\n\\r\nAll UCL School Direct students have full access to UCL student support services and facilities.",
    "CourseLength": "OneYear",
    "Qualifications": "A minimum of a 2:2 UK Bachelor’s degree (or an overseas equivalent) in Music. Other degree subjects will be considered if a high level of musicianship can be displayed.\\r\n\\r\nA levels\\r\nNo specific subjects required.\\r\n\\r\nA GCSE, or comparable qualification, at grade C (or grade 5 for GCSEs sat in 2017 onwards) is required in both English Language and Mathematics.\\r\n\\r\nApplicants who do not hold a GCSE in English, Mathematics or Science may demonstrate an equivalent standard by completing either the Mathematics Foundation, Mathematics Higher or English test from [Equivalency Testing](www.equivalencytesting.com) and achieving at least a grade 5.\\r\n\\r\n[UCL Music](http://www.ucl.ac.uk/ioe/courses/teacher-training/music-school-direct-pgce)",
    "FeeInternational": 17110.0,
    "InterviewProcess": "At the CTA we are looking for candidate who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools. \\r\n\\r\nWhen applying please select your preferred school.  All applications submitted on UCAS are vetted upon receipt. Once your application has passed this process you will be invited to an interview at the location to which you have applied.\\r\n\\r\nThe interview day will include a tour of the school and a panel interview. Some time will also be spent in a class with the Head of Department where a school can arrange this. If you are successful at this point a recommendation will be make to UCL.\\r\n\\r\nUCL carries out a second-stage review of all applicants who are referred after school interviews. If you are applying for a secondary specialism on the Tuition Fee route you will be invited to attend a UCL interview day with other applicants for that specialism.\\r\n\\r\nThe university interview day will consist of a number of tasks. If your application is referred for this stage further information will be provided by the university.\\r\n\\r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. \\r\n",
    "OtherRequirements": "Reference\\r\nCandidates completing their degree, or who have recently left university, should provide an academic reference from a tutor at their university. Candidates who have been working for a number of years should provide a reference from their current or most recent employer. \\r\n\\r\nUCL recommend that you aim to gain some experience in a classroom prior to interview. However, we understand that this isn't always possible, as such, some applicants who have experience of working with children and young people, at sports clubs, youth groups and voluntary work are asked to make reference to these activities in their application. \\r\n",
    "PersonalQualities": "We are looking for individuals who have the capacity to develop into outstanding teachers. This requires a combination of personal and academic skills. \\r\n\\r\nYou should demonstrate awareness of what good teaching entails and show a desire to teach. \\r\n\\r\nThere are three main attributes required for teaching: \\r\n1) Subject Knowledge - you need to show that you have a specialist understanding. \\r\n2) An ability to communicate with an audience. Your class will be your audience and the relationship and command of this group is crucial. \\r\n3) Good Interpersonal Skills - you need to demonstrate that you can work well with others. \\r\n\\r\n\\r\n \\r\n",
    "HowSchoolPlacementsWork": "School Direct trainees start at their chosen school during the first week of the autumn term. Term dates will be confirmed upon acceptance of an offer. \\r\n\\r\nUniversity sessions start the following week and will be offered in a number of blocks at the start of each term in addition to one day a week . As with all PGCE courses you will be expected to attend all university sessions.  The course runs from September to June and trainees will spend 120 days in school over the course of the year and 43 days at university.\\r\n\\r\nUCL offer an AB placement structure. The academic year will be split equally between two schools and you will spend 12 weeks in one school and 13 weeks in another. You will be allocated a Subject Mentor and Professional Co-ordinating mentor in each school and both placements will be hosted in Catholic Schools. \\r\n\\r\nAround half of the 38 schools within the Catholic Teaching Alliance offer training placements. Those who are able to support the main placement are listed for each respective course. \\r\n\\r\nAt the start of the training year we will contact all registered trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\\r\n\\r\nWe are able to offer contrasting placements in single-sex or mixed schools and in schools with sixth forms where your main placement school is 11-16.  Where you have completed a placement in a single-sex school your second placement will be in a mixed school or a school with students of the opposite sex.\\r\n\\r\nYour tutor from the Institute of Education will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your Institute tutor will carry out your final assessment in school against the national Teachers’ Standards."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Catholic Teaching Alliance (CTA) is a strong and growing alliance of 38 schools. It is a cross-phase partnership from primary, through to secondary and sixth form colleges. Our partner schools are based throughout South-East London and Kent covering Southwark, Lewisham, Bromley, Bexleyheath and Chatham. This diversity in type of school and location gives a richness to our shared work. Our shared vision is Growing Teachers, Growing Learners, Growing Schools. \\r\n\\r\nOur schools have a long history of Initial Teacher Education and have offered School Direct places since the initiative began. We have selected several universities that match our ethos. By carefully selecting the right universities to work with we are able to offer you an excellent start to your career in education. \\r\n\\r\nWe offer both Primary Salaried and Tuition Fee School Direct places and are able to provide training in a range of secondary subjects. Some subjects are available with a choice of provider. \\r\n\\r\nWe run an extensive CPD programme for trainees and most secure an NQT position within the group of schools. We also provide flexibility as your career progresses, with opportunities to move between schools.\\r\n\\r\nWe would encourage applicants to contact us to arrange a school tour prior to application and we are happy to answer any questions that you may have. Please contact the CTA Co-ordinator, [Clare Barclay](c.barclay@catholicteachingalliance.org.uk) for more information or visit our website [here](https://catholicteachingalliance.org.uk/) to find out more about our schools and the career opportunities that we are able to offer. \\r\n",
    "TrainWithDisability": "All School Direct trainees must meet the Secretary of State's requirements for physical and mental health,  but few health problems past or present preclude applicants from teaching. \\r\n\\r\nThe activities that a teacher must be able to perform are set out in the [Education (Health Standards) (England) Regulations 2003](http://www.legislation.gov.uk/uksi/2003/3139/pdfs/uksi_20033139_en.pdf). \\r\n\\r\nWe welcome applications from people with additional needs and disabilities.  Successful applicants will be asked to complete a fitness questionnaire prior to commencing the programme. \\r\n\\r\nWithin our group of 38 schools, we are able to provide support for a range of disabilities and other needs and are usually able to arrange appropriate school placements and additional support as required. We have trained applicants with dyslexia, physical, hearing and visual impairments, as well as students with mental health issues. If you have any questions about health, disability, or the support provided or wish to discuss your own requirements further, please contact the CTA Co-ordinator, Clare Barclay, c.barclay@catholicteachingalliance.org.uk. \\r\n\\r\nFor further information on the support provided by our university partners please see the links below.\\r\n\\r\nGoldsmiths University\\r\n[Disability Service](https://www.gold.ac.uk/students/disability-support/support-when-applying/)\\r\n\\r\nKing's College London\\r\n[Disability Access:](http://www.kcl.ac.uk/campuslife/services/disability/index.aspx)\\r\n\\r\nSt Mary's University\\r\n[Student Wellbeing Service](https://www.stmarys.ac.uk/student-support/wellbeing/about.aspx)\\r\n\\r\nUniversity College London\\r\nSchool Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information [here](https://www.ucl.ac.uk/students/disability-support)\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Goldsmiths, University of London have been training teachers since 1904 and are renowned as a leader in the field of educational research and teacher training. Goldsmiths work in close collaboration with a range of partner schools across London, in both teacher training and research. Goldsmiths programmes have a strong emphasis on active learning, creativity, inclusion and languages and graduates benefit from excellent employment opportunities. They have internationally recognised professors in their Educational Studies Department, including Michael Rosen. Goldsmiths campus is set in vibrant New Cross, with excellent London Overground, National Rail and bus links into central London.  [Goldsmiths School Direct](https://www.gold.ac.uk/educational-studies/schooldirect/)",
        "UcasInstitutionCode": "G56"
      },
      {
        "Description": "Experience: King’s has been training teachers for over 120 years and has developed a reputation for excellence in its training methods. The PGCE academics are qualified teachers themselves and are highly experienced in teacher training.\\r\n\\r\nReputation: King’s has developed a reputation for excellence in both training methods and the standards of new teachers we train. At the most recent Ofsted inspection King’s was graded 'Outstanding'.\\r\n\\r\nLocation: Based in the heart of London, King’s is surrounded by landmarks and cultural institutions that we incorporate into our training. Transport links are extensive as the campus is only minutes from Waterloo station.\\r\n\\r\n[KCL](https://www.kcl.ac.uk/sspp/departments/education/study/schooldirect/Index.aspx)",
        "UcasInstitutionCode": "K60"
      },
      {
        "Description": "Established in 1850 as a Catholic teacher training college, St Mary’s has a long-standing reputation for academic excellence and the granting of university title is an exciting milestone in its history. With an original intake of just six students, St Mary’s has now grown to around 6,000 undergraduate and postgraduate students across the four academic Schools. St Mary’s prepares its students for flourishing lives, successful careers and social commitment through excellent, research-enriched teaching in a strong community of mutual respect based on our Catholic ethos and identity.\\r\n\\r\n[School Direct at St Mary’s University](http://www.stmarys.ac.uk/education-theology-and-leadership/school-direct-information-for-trainees.htm)\\r\n",
        "UcasInstitutionCode": "S64"
      },
      {
        "Description": "UCL Institute of Education is the world’s leading centre for research and teaching in education and related social sciences. You can view UCL’s online teacher training prospectus is here:-\\r\n[UCL](https://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes)",
        "UcasInstitutionCode": "U80"
      },
      {
        "Description": "",
        "UcasInstitutionCode": "C10"
      }
    ]
  },
  "has_inst": true
}
