{
  "locationType": "School",
  "accrediting": "University of Chichester",
  "provider": "University of Chichester Academy Trust School Direct Partnership",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "2DH/2YPW",
  "providerCode": "2DH",
  "programmeCode": "2YPW",
  "schools": [
    {
      "name": "Main Site",
      "address": "Mill Chase Road, Bordon, GU35 0ER",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Mill Chase Road, Bordon, GU35 0ER",
      "geocode": true,
      "formatted_address": "Mill Chase Rd, Bordon GU35 0HG, UK",
      "latitude": 51.1133037,
      "longitude": -0.84932,
      "post_code": "GU35 0HG",
      "city": "Hampshire",
      "route": "Mill Chase Road",
      "postal_town": "Bordon"
    }
  ],
  "providerAddress": {
    "inst_code": "2DH",
    "addr_1": "Upper Bognor Road",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Bognor Regis",
    "postcode": "PO21 1HR",
    "url": "http://unicat.org.uk",
    "geocode": true,
    "formatted_address": "Upper Bognor Rd, Bognor Regis PO21 1JJ, UK",
    "latitude": 50.7881893,
    "longitude": -0.6658381999999999,
    "post_code": "PO21 1JJ",
    "city": "West Sussex",
    "route": "Upper Bognor Road",
    "postal_town": "Bognor Regis"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The Trust’s School Direct programme, aims to develop professional, reflective and effective teachers by encouraging such qualities as creativity, commitment, enthusiasm and intellectual liveliness. \\r\nThe programme leads to the award of a Postgraduate Certificate in Education (PGCE Masters level) with QTS and spreads across the entire academic year.\\r\n\\r\nYou will receive a regular training programme delivered within the Trust academies by practising teachers with proven, current knowledge and expertise in each subject. You will also attend training at The University of Chichester (the current programme includes 25 days) and there may also be opportunities to visit partner schools outside of the Trust.  Your training time is divided between professional studies and subject study. You will study the relevant national frameworks for your age phase and subject area and develop your understanding of subject specific pedagogy. The programme is designed to equip you to promote the creation of a culture for learning through your role as a teacher, meeting the needs of all children. Furthermore, you develop your understanding of the place of the teacher in a whole school context and in relation to your further career development.\\r\n\\r\nAssessment is a shared responsibility.  University tutors and school mentors collaborate to ensure that your school based experience and written assignments are assessed at agreed points in the Programme.  \\r\nSchool based experience is assessed against the Teachers’ Standards using information from a range of sources.\\r\n\\r\nYou will complete three assignments (one each term) the successful completion of which leads to a PGCE with 60 Masters Level credits. Preparation for these assignments is supported by university tutors.\\r\n\\r\nIn addition to resources within our academies all trainees have full access to the University of Chichester Learning Resource Centres including electronic access to a range of books and journals.\\r\n\\r\nWhere are we?\\r\n\\r\nTrust academies: \\r\n[Arundel Court Primary School Portsmouth](http://arundelcourt.com/)\\r\n[Berewood Primary School Waterlooville](http://www.berewoodprimary.co.uk/)\\r\n[Bordon Junior School   Bordon](http://www.bordonjuniorschool.com/)\\r\n[Court Lane Infant School     Cosham](http://www.courtlane-inf.portsmouth.sch.uk/)\\r\n[Court Lane Junior School    Cosham](http://www.cljs.co.uk/)\\r\n[Fernhurst Primary School    Fernhurst](http://www.fernhurst.w-sussex.sch.uk/)\\r\n[Frogmore Junior School                  Frogmore](http://www.frogmore-jun.hants.sch.uk/)\\r\n[Kingsham Primary School       Chichester](http://www.kingsham.w-sussex.sch.uk/)\\r\n[Langstone Infant School Portsmouth](http://www.langstoneinfant.co.uk/)\\r\n[Langstone Junior School    Portsmouth](http://www.langstone-junior.portsmouth.sch.uk/)\\r\n[The Flying Bull Academy  Portsmouth](http://www.fbacademy.co.uk/)\\r\n\\r\n\\r\nThe University of Chichester has two campuses. The majority of School Direct university based training is on the Bognor Regis Campus. [How to find us](https://www.chi.ac.uk/about-us/how-find-us)\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Basic eligibility requirements apply:  \\r\n[Entry requirements](https://getintoteaching.education.gov.uk/eligibility-for-teacher-training)\\r\n\\r\nYour degree would normally be a 2:2 or above. \\r\n\\r\nPrimary - The subject content of the degree should normally be in a National Curriculum subject. \\r\n \\r\nProfessional Skills Tests\\r\nApplicants are required to have passed the Department for Education's Professional Skills Tests in Literacy and Numeracy before a firm offer of a place can be made. We advise applicants to book their Skills Tests before attending for interview. \\r\n\\r\n",
    "InterviewProcess": "Shortlisted applicants will be invited to an interview day at one of the Trust’s academies. This day will include:\\r\n\\r\n-\\tan introduction to the Trust’s programme and an opportunity to ask questions\\r\n-\\ta formal interview with colleagues from the University and Trust academies\\r\n-\\tdiscussion around subject knowledge\\r\n-\\ta teaching activity (applicants are notified of the requirements in advance)\\r\n-\\ta check of original certificates \\r\n-\\tcompletion of a written task\\r\n\\r\nReferences: It is your responsibility to ensure that your referees are aware of their role, as well as making sure they follow UCAS’ instructions for providing on-line references.\\r\n\\r\nThe activities during the day are designed to provide you with opportunities to demonstrate the personal qualities noted later along with:\\r\n- Enthusiasm for your subject\\r\n- A commitment to developing creative pedagogical approaches\\r\n-  An awareness of the role of the teacher \\r\n- An ability to communicate effectively with a range of audiences\\r\n- An ability to work collaboratively \\r\n- A knowledge of current educational issues\\r\n\\r\n\\r\n",
    "OtherRequirements": "Additional Requirements\\r\n-      The ability to read effectively and to communicate clearly and accurately in Standard English\\r\n-\\tAll applicants must demonstrate the intellectual and academic capabilities needed to meet the Teachers’ Standards and to study at Masters level.\\r\n-\\tAll applicants must demonstrate the appropriate qualities, attitudes and values expected of a teacher\\r\n\\r\n\\r\nSuitability checks\\r\nAll entrants will be subject to a Disclosure Barring Service (DBS) check and any other appropriate background check.\\r\nAll entrants must have the health and physical capacity to teach and will be required to complete an Occupational Health questionnaire.\\r\n",
    "PersonalQualities": "We are keen to recruit trainees who share the Trust’s values:\\r\n‘Together we will cultivate an ethos that raises aspirations and makes a real difference to the life chances of young people’\\r\n\\r\nWe are looking for individuals who demonstrate:\\r\n- A love of learning \\r\n- A genuine commitment and desire to have a positive impact upon the lives of children and young people\\r\n- An openness to develop as a professional and willingness to act upon advice\\r\n- Resilience\\r\n\\r\n",
    "HowSchoolPlacementsWork": "For the recommendation of QTS, all trainees are formally assessed in 2 consecutive Key Stages:\\r\n\\r\nPrimary (5-11) - Key Stage 1 and Key Stage 2\\r\n\\r\nDuring the School Direct year, you will spend the majority of your time in one of the Trust’s academies where you are part of the school community and are introduced to the practice of teaching in a structured way, with appropriate support from an experienced mentor and other colleagues who will support your professional development.\\r\nIn addition, you will spend at least half a term in another of the Trust’s academies; this is usually in the second half of the spring term.\\r\n\\r\nYou will also have the opportunity to spend time in other academies across the Trust each of which offers a distinct learning environment. \\r\nA number of factors are taken into account when organising your placement schools including location and your specific development needs.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The University of Chichester Academy Trust School Direct Partnership provides an exciting opportunity for you to develop as a teacher within a Trust whose mission is ‘to create a vibrant, inclusive and aspirational family of academies, transforming life chances for pupils through excellent teaching and learning’. \\r\n\\r\nThe Trust has schools in West Sussex, Portsmouth and Hampshire of different sizes and types and you will get the opportunity to visit many of them during your programme of training.\\r\n\\r\nThe Trust’s sponsor and School Direct partner, The University of Chichester, has a rich history of training and educating teachers. The Trust’s close link with the University brings opportunities for trainees to learn within schools alongside practicing teachers and also to make full use of the University facilities and resources. \\r\n\\r\nOur School Direct training programme is delivered by both high quality teachers in our schools and experienced lecturers in the University who all teach and undertake educational research thus it provides a strong blend of practical application supported by academic rigour.\\r\nThe academic award of Postgraduate Certificate in Education (PGCE Masters level) recognises and celebrates your development as a reflective practitioner at the forefront of your discipline, and provides you with pathways to both employment and further study.\\r\n\\r\nAcademies within the Trust Partnership have a longstanding commitment to supporting trainees. School-based mentors, who have all been trained by the University, will support you to achieve your potential.\\r\n\\r\nAll of the trainees from last year’s School Direct programme are now teachers in Trust Academies.\\r\n\\r\n",
    "TrainWithDisability": "The Disability and Dyslexia service at The University of Chichester offers advice and support throughout a trainee’s programme. Further information is available on the university’s website.\\r\n\\r\n[DDS](http://www.chi.ac.uk/study-us/student-services/disability-dyslexia-and-medical-condition)\\r\n\\r\nThis team would discuss with you any adjustments you may need whilst in school or attending university based sessions and agree any action required. This information would form part of the decision making with regard to the selection of placement schools.\\r\n\\r\nThe Trust schools are all inclusive environments and encourage participation from all students who they believe could benefit from their programme and can be successful as practicing teachers. Accessibility and specialist facilities in schools vary and we would seek to find an appropriate placement to meet a student’s individual needs.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "C58"
      }
    ]
  },
  "has_inst": true
}
