{
  "locationType": "School",
  "accrediting": "Birmingham City University",
  "provider": "Greenholm Primary School",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "19R/2VLP",
  "providerCode": "19R",
  "programmeCode": "2VLP",
  "schools": [
    {
      "name": "Main Site",
      "address": "Greenholm Road, Birmingham, B44 8HS",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Greenholm Road, Birmingham, B44 8HS",
      "geocode": true,
      "formatted_address": "Greenholm Rd, Birmingham B44 8HS, UK",
      "latitude": 52.535664,
      "longitude": -1.8931348,
      "post_code": "B44 8HS",
      "city": "West Midlands",
      "route": "Greenholm Road",
      "postal_town": "Birmingham"
    }
  ],
  "providerAddress": {
    "inst_code": "19R",
    "addr_1": "Greenholm Primary School",
    "addr_2": "Greenholm Road",
    "addr_3": "Great Barr",
    "addr_4": "Birmingham",
    "postcode": "B44 8HS ",
    "url": null,
    "geocode": true,
    "formatted_address": "Greenholm Rd, Birmingham B44 8HS, UK",
    "latitude": 52.5364428,
    "longitude": -1.8926708,
    "post_code": "B44 8HS",
    "city": "West Midlands",
    "route": "Greenholm Road",
    "postal_town": "Birmingham"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "InterviewProcess": "Candidates will be interviewed by a panel including headteachers from within the partnership and representatives from BCU . There is one interview to attend and during the interview candidates will take part in a range of tasks including a presentation, writing task, curriculum task, classroom observation and possibly an interview by the school council.\\r\nAll candidates are expected to pass the literacy and numeracy skills tests prior to starting their training.\\r\n\\r\nAll candidates must have at least 5 years of salaried experience in primary schools within a teaching capacity to be considered for the salaried post."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Greenholm  has an excellent reputation for training teachers and retaining them once qualified. We are a highly respected school which  has an established history of training and producing excellent primary school teachers. Our unique program is personalised to the needs of all our trainees. All trainees receive professional development  which is appropriate to their needs and prepares them to work independently as successful  NQTs by the end of their training.\\r\n100% of our trainee teachers leave us with a good or outstanding level in classroom practice with all employed in schools as qualified teachers. Added  to this, teachers trained with Greenholm have an excellent start in their NQT year with 100% remaining in the teaching profession for at least 5 years and with many progressing to senior management and leadership positions. \\r\nWe work  in close and effective  collaboration with  BCU and Services for Education with whom we have  long, successful and established relationships ensuring the training that all students receive is of a very high quality and supports them in becoming excellent teachers.  \\r\nFeedback from our trainees state that 100%  will highly recommend Greenholm to other trainees and the training received at Greenholm is outstanding.\\r\nWe guarantee an exceptional teacher training experience in our friendly and supportive school. You learn on the job in at least two different  schools, learning from experienced, dedicated and inspiring colleagues. You'll be putting your new skills into practise from day one while you gain qualified teacher status. \\r\n\\r\n",
    "TrainWithDisability": "Our mentors are highly qualified in supporting trainees with a range of needs. We have a  unique, personalised training program, which is developed in line with the needs of the trainee. Trainees with dyslexia and mental health  have recently  qualified through our program at a good and outstanding level and have successfully been employed  in both main stream and special schools. Greenholm and its partners has wheel chair access to most of its sites. Within the partnership there are schools which have a range of disability units\\r\nThe close relationship we have with both BCU and Services for Education ensures we have access to a range of resources which can support the needs of all our trainees ensuring they succeed and become highly qualified NQTs. \\r\nTrainees are supported throughout the program with their assignments and observations ensuring they get the best opportunity to succeed in becoming qualified teachers.\\r\n\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "BCU works in close collaboration with Greenholm ensuring they provide an academic training program which enhances the outstanding,  in- house, practical training at Greenholm. 100% of  trainee teachers working within this partnership leave with a good or outstanding level in classroom practice with 100% employed as NQTs by the end of the training. 100% of our teachers have remained in the teaching profession for at least 5 years after qualification with many in senior and leadership positions.\\r\nBCU is ranked 1st in the West Midlands for teacher training provision and 17th nationally.  ",
        "UcasInstitutionCode": "B25"
      },
      {
        "Description": "Services for Education works in close collaboration with Greenholm ensuring they provide an academic training program which enhances the outstanding  in- house, practical training at Greenholm. 100% of  trainee teachers working within this partnership leave with a good or outstanding level in classroom practice with 100% employed as NQTs by the end of the training. 100% of our  teachers have remained in the teaching profession for at least 5 years after qualification with many in senior and leadership positions.",
        "UcasInstitutionCode": "1WE"
      }
    ]
  },
  "has_inst": true
}
