{
  "locationType": "School",
  "accrediting": "Buile Hill VA College SCITT",
  "provider": "Buile Hill Visual Arts College SCITT",
  "subjects": [
    "Chemistry",
    "Secondary"
  ],
  "name": "Chemistry",
  "slug": "1MS/3828",
  "providerCode": "1MS",
  "programmeCode": "3828",
  "schools": [
    {
      "name": "Buile Hill Visual Arts College",
      "address": "Eccles Old Road, M6 8RD",
      "code": "1"
    }
  ],
  "addresses": [
    {
      "address": "Eccles Old Road, M6 8RD",
      "geocode": true,
      "formatted_address": "Eccles Old Rd, Salford M6 8RD, UK",
      "latitude": 53.4922711,
      "longitude": -2.3039878,
      "post_code": "M6 8RD",
      "city": "Greater Manchester",
      "route": "Eccles Old Road",
      "postal_town": "Salford"
    }
  ],
  "providerAddress": {
    "inst_code": "1MS",
    "addr_1": "Eccles Old Road",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Salford",
    "postcode": "M6 8RD  ",
    "url": "http://builehillvisualartscollege.co.uk/",
    "geocode": true,
    "formatted_address": "Eccles Old Rd, Salford M6 8QQ, UK",
    "latitude": 53.492499,
    "longitude": -2.3074741,
    "post_code": "M6 8QQ",
    "city": "Greater Manchester",
    "route": "Eccles Old Road",
    "postal_town": "Salford"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "The course fees are £9,000 this fee includes the QTS and the PGCE qualification.",
    "AboutCourse": "Buile Hill Visual Arts College SCITT are Ofsted graded OUTSTANDING. \\r\n\\r\nThe course includes approximately 170 days training, including teaching days in two contrasting schools, as well as a week spent in a primary, in a special school and in a post-16 setting. \\r\n\\r\nThroughout this course you will be assessed based on classroom experience, and achievements measured against the Teaching Standards. There are four assessment periods. \\r\n\\r\nThere is also two Assignments which you will complete during the course for Manchester Metropolitan University who award the PGCE element of our course.  You will be required to attend 4 days throughout the course.\\r\n\\r\nUpon successful completion of the programme you will be awarded QTS (Qualified Teacher Status) by Buile Hill Visual Arts College SCITT. \\r\n\\r\nWe are proud to have an 100% success rate, with a high percentage of trainees successfully completing the course achieving grades of 'Good' or 'Outstanding'. \\r\n\\r\nMany of our trainees have gone on to gain teaching positions within the Alliance once they are qualified. \\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You should hold a minimum 2:2 honours degree but we will consider applicants who hold an honours degree with relevant experience. \\r\n\\r\nAll applicants must have GCSE Maths and English at Grade C or above (new grading 4 or above).  We do not accept Key Skills. \\r\nWe do accept applications from people who may be studying towards their GCSE's but it would be made part of the offer that you had completed these and achieved a Grade C (4) or above by the start of the course. \\r\n",
    "FinancialSupport": "There are a number of bursaries and scholarships available dependent of the subject you wish to train to teach and your degree classification.",
    "InterviewProcess": "Buile Hill Visual Arts College SCITT conducts interviews for all of the courses,  some of the interviews may be held at a School within our Partnership, but you will be informed of this at the time of invitation to interview. \\r\n\\r\nIf an applicant is invited for an interview, the day will include teaching a 30 minute lesson (on a given topic) which will be observed. \\r\n\\r\nThere will also be a short literacy test and a formal interview. \\r\nAll applicants go through this process. The panel will consist of the SCITT Director and various subject specialists/mentors and/or Professional mentors.\\r\n\\r\n",
    "OtherRequirements": "Other requirements before the start of the course are:\\r\n* DBS Check - Buile Hill Visual Arts College Scitt will complete and pay for this.  If you have anything that you think may appear on your DBS you need to declare this at interview. \\r\n\\r\n* Complete a Fitness to Teach form (you must declare any conditions to enable the us to support you). \\r\n\\r\n* Pass numeracy and literacy tests within 3 months of your offer of a place.  \\r\n\\r\n*  Subject Knowledge Enhancement Course.  You will be given further information about this if you are required to undertake one. ",
    "PersonalQualities": "We are looking for hard working, dedicated trainee teachers who are willing to get involved in all aspects of training and schools. \\r\nWe will be looking not only at your academic qualifications and your references.\\r\n\\r\nAlthough not compulsory,  we would recommend that you gain some school experience as it is extremely beneficial to applicants to get an insight into how a school is run. \\r\n",
    "HowSchoolPlacementsWork": "During your training you will complete three placements, Placement A1 & A2 will be at the same school, with a contrasting Placement B in between.\\r\n\\r\nYou will spend Monday - Thursday in your Placement School and Friday is our Centre based training day.\\r\n\\r\nWe work with a number of Schools within our Partnership to be able to offer you contrasting placements. We also have contacts with local Special Schools, primary schools and 6th Form College where you will complete a weeks placement with each of them. \\r\n\\r\nYou will also visit a PRU within the Salford area. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Buile Hill Visual Arts College SCITT are Ofsted graded OUTSTANDING. \\r\nDetails of our report can be found here \\r\nhttps://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/70280 \\r\n\\r\nOutstanding pupil progress is held at the core of the Buile Hill Visual Arts College SCITT. Our trainees are skilled at observing learning, have an acute understanding of what makes people learn best, and teach intuitively, enabling all pupils to progress 'beyond expectations'. Our aim is that the trainees, as well as their pupils, will go 'beyond expectations' in terms of the progress that they make. Outstanding teaching leads to outstanding progress. \\r\n\\r\nBuile Hill Visual Arts College SCITT aims towards the following outcomes: \\r\nTo provide outstanding training opportunities for trainees in a range of secondary subjects. \\r\nTo mentor and coach trainees effectively, guiding their development towards becoming outstanding teachers, experts in their specialist subject. \\r\n\\r\nTo develop the future generation of outstanding teachers that will continue on to provide an exceptional level of education to learners, both in and out of Salford. \\r\n\\r\nTo ensure all trainees make outstanding progress towards meeting all of the Teachers' Standards and achieving QTS. \\r\n\\r\nThroughout the year there are four review points as well as two assignments  based on a range of themes around teaching and learning to complete.\\r\n\\r\nWe also offer a Post Graduate Certificate in Education (SCITT) awarded by Manchester Metropolitan University. ",
    "TrainWithDisability": "Buile Hill Visual Arts College has full disabled access. Applicants who would benefit from disabled access should let us know on their application so that we can consider suitable placements.\\r\n\\r\nAs well as supporting our trainees with any disabilities and other needs, Manchester Metropolitan University offers a variety of services which our trainees have access to.  These include counselling, health & wellbeing.   There is also a Disability Service available if required.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The course includes approximately 170 days training, including teaching  in two contrasting schools,  a week spent in a primary, a special school and a post-16 setting. \\r\n\\r\nProfessional Issues sessions held weekly cover a range of issues.  These  are delivered by a range of subject specialists across a range of educational settings.\\r\n\\r\nTrainees receive mentoring session once a week, as well as a formal  observation supplemented by developmental observations. The outcomes from observations and discussions inform the weekly target setting. \\r\n\\r\nTargets and progress towards  QTS are reviewed weekly, evidenced through your files, the assessment log and the standards tracking document. ",
        "UcasInstitutionCode": "1WT"
      }
    ]
  },
  "has_inst": true
}
