{
  "locationType": "School",
  "accrediting": "Forest Independent Primary Collegiate SCITT",
  "provider": "Hazelwood School - Chigwell Campus",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "15T/23M9",
  "providerCode": "15T",
  "programmeCode": "23M9",
  "schools": [
    {
      "name": "Main Site",
      "address": "Limes Avenue, Chigwell, Essex, IG7 5LP",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Limes Avenue, Chigwell, Essex, IG7 5LP",
      "geocode": true,
      "formatted_address": "Limes Ave, Chigwell IG7 5NX, UK",
      "latitude": 51.6080329,
      "longitude": 0.08621859999999999,
      "post_code": "IG7 5NX",
      "city": "Essex",
      "route": "Limes Avenue",
      "postal_town": "Chigwell"
    }
  ],
  "providerAddress": {
    "inst_code": "15T",
    "addr_1": "Forest Independent Primary Collegia",
    "addr_2": "Limes Avenue",
    "addr_3": "Chigwell",
    "addr_4": "Essex",
    "postcode": "IG7 5LP ",
    "url": "http://www.fipc.ac.uk",
    "geocode": true,
    "formatted_address": "Farm Junior School Site, Limes, Limes Ave, Chigwell IG7 5ND, United Kingdom",
    "latitude": 51.6079369,
    "longitude": 0.0867882,
    "post_code": "IG7 5ND",
    "city": null,
    "route": "Limes Avenue",
    "postal_town": "Chigwell"
  },
  "options": [
    "QTS, full time with salary"
  ],
  "enrichment": {
    "Qualifications": "GCSE grade C or above in English, mathematics and science.\\r\nA degree award of 2.2 or above."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We believe that teaching is an exciting, challenging and rewarding profession. We pride ourselves on having a proven track record over the past 15 years in training excellent practitioners and supporting them in gaining positions within our partnership schools. \\r\nForest Independent Primary Collegiate, the accredited provider, has written this highly comprehensive and bespoke programme. It reflects the exceptional standards in Enfield schools and our understanding of what makes an excellent teacher. We are committed to offering high quality training for local candidates with the aim of securing the beginning of a successful career in teaching. We also aim to support trainees' careers after completing the programme through excellent CPD opportunities on offer within our school partnership. This includes subject knowledge and leadership training, and opportunities to take part in research and to work collaboratively with colleagues in other schools. \\r\nWe scrutinize the School Direct applications and place trainees in the partnership schools. These are excellent mainstream schools that are committed to supporting the process of the training.\\r\n",
    "TrainWithDisability": "We welcome applications from candidates including those with special educational needs and disabilities.  \\r\nWe aim to meet the challenge of all declared disabilities and other needs placing candidates in our diverse range of school.  \\r\n\\r\nWe are committed to supporting the full inclusion of individuals ensuring their needs are met.  \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Forest Independent Primary Collegiate is the accrediting provider for the School Direct programme. ",
        "UcasInstitutionCode": "F82"
      }
    ]
  },
  "has_inst": true
}
