{
  "locationType": "School",
  "accrediting": "Edge Hill University",
  "provider": "North Sefton Coastal Teaching School Alliance",
  "subjects": [
    "Biology",
    "Science",
    "Secondary"
  ],
  "name": "Biology",
  "slug": "28K/2RPQ",
  "providerCode": "28K",
  "programmeCode": "2RPQ",
  "schools": [
    {
      "name": "Main Site",
      "address": "Stapleton Rd, Formby, Liverpool, L37 2YN",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Stapleton Rd, Formby, Liverpool, L37 2YN",
      "geocode": true,
      "formatted_address": "Stapleton Rd, Formby, Liverpool L37 2YN, UK",
      "latitude": 53.5457359,
      "longitude": -3.0789374,
      "post_code": "L37 2YN",
      "city": "Formby",
      "route": "Stapleton Road",
      "postal_town": "Liverpool"
    }
  ],
  "providerAddress": {
    "inst_code": "28K",
    "addr_1": "Stapleton Rd",
    "addr_2": null,
    "addr_3": "Formby",
    "addr_4": "Liverpool",
    "postcode": "L37 2YN ",
    "url": "http://coastaltsa.com/",
    "geocode": true,
    "formatted_address": "Stapleton Rd, Formby, Liverpool L37, UK",
    "latitude": 53.5461824,
    "longitude": -3.0781305,
    "post_code": "L37",
    "city": "Formby",
    "route": "Stapleton Road",
    "postal_town": "Liverpool"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Subject to eligibility, UK and EU students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK and EU students may also be eligible to apply for additional funding to help with living costs.\\r\n\\r\nFinancial support arrangements for eligible UK and EU students joining this programme in academic year 2019/20 are still to be announced by the Government. \\r\n\\r\nFor more details visit edgehill.ac.uk/study/fees-and-funding\\r\n\\r\nFinancial support information for international students can be found at edgehill.ac.uk/international/fees.",
    "AboutCourse": "Train to enthuse and inspire children aged 5-11 with creative teaching by joining our innovative, school-led programme and learn from specialist tutors and expert practitioners at the cutting edge of developments in education.\\r\n\\r\nBenefit from high quality training in our vibrant and diverse cluster of schools many of which are rated as outstanding, whilst enjoying the 'best of both worlds' as our version of School Direct training also brings the benefits of a conventional PGCE. Our partnership is linked with Edge Hill University, which over-sees and contributes to the delivery of the programme.\\r\n\\r\nSuccessful completion of the programme leads to recommendation for Qualified Teacher Status.\\r\n\\r\nOur PGCE with QTS programme is a school-based partnership, combining on-campus study with training in placement schools and settings.\\r\n\\r\nThe PGCE will train you to teach across the 11-18 age range and achieve the Teachers’ Standards. You will receive a high quality training experience and learn the latest approaches and strategies necessary to fully prepare you for your first year as a Newly Qualified Teacher (NQT).\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Before the programme commences, you must have:\\r\n\\r\nA first or second class Honours degree from a UK university (or equivalent qualification);\\r\n\\r\nGCSE at Grade C or Grade 4 (or equivalent qualification) in English Language and Mathematics.\\r\n\\r\nYou are required to undertake Professional Skills Tests in Literacy and Numeracy prior to entry to this programme. Successful completion of the Professional Skills Tests will form part of the conditions of any offer of a place. Further details can be found at edgehill.ac.uk/skillstests\\r\n",
    "FeeInternational": 13000.0,
    "InterviewProcess": "Applicants are interviewed in one of the schools in our cluster by a small panel of two to three professionals representing the Coastal Alliance and Edge Hill University. Interviews occur over approximately 2-3 hours on a single day and comprise:\\r\n\\r\n1. A 5 minute presentation to the panel.\\r\nYou will need to deliver a five minute presentation based on a topic you will be supplied with in advance.\\r\n\\r\n2. An interview\\r\nThis is your opportunity to demonstrate your understanding of the nature and needs of learners and your commitment to meeting these needs as a secondary teacher. \\r\n\\r\n3. A writing task\\r\nYou will be asked to provide a short written response to an extract about current educational issues.\\r\n\\r\n4. A teaching task\\r\nYou will be asked to prepare and lead a 25 minute session to a group of approximately 12 students. The details of this session will be sent to you prior to the interview date. ",
    "OtherRequirements": "If you accept a formal offer from the Coastal Alliance you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. \\r\n\\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\\r\n",
    "PersonalQualities": "A demonstrable interest in teaching within the curriculum area. You could show this in a number of ways - time spent in schools (ideally at least 10 days in a High School), knowledge of the chosen curriculum area, relevant practical experience.\\r\n\\r\nThe ability to inspire, motivate and support pupils.\\r\n\\r\nEvidence of the ability to listen and communicate effectively both orally and in writing to a variety of audiences.\\r\n\\r\nThe ability to remain calm and reflective when working in a challenging environment.",
    "HowSchoolPlacementsWork": "We allocate school placements in close consultation with our School Direct candidates. Students who train with us through this route are the only ones guaranteed places in our cluster of schools.\\r\n\\r\nAs a trainee teacher on our programme you will spend time in school being trained by school expert practitioners working across our partnership. This will facilitate much stronger links between theory and practice.\\r\n\\r\nOur trainees are highly valued and well supported at all stages of their training by expert practitioners and outstanding mentors. They make excellent progress in our schools.\\r\n\\r\nProfessional Development Sessions are held across all of our partners according to the best expertise available for each topic. Placements will also be distributed across these schools according to the training needs of successful applicants.\\r\n\\r\nTrainees will have school mentors who are outstanding teachers within their subjects. Each partner school has a School Lead who oversees the training within their school.\\r\n\\r\nYou will complete placements in at least two of our partner schools. The first placement will begin with focused lesson observations across the whole school before joining subject departments and beginning to teach and team teach aspects of lessons. After a few weeks you will be planning and delivering whole lessons.\\r\n\\r\nA second placement in a different school will give you a contrasting experience and broaden your professional development.\\r\n\\r\nThere may also be opportunities to spend some time in other partner schools and settings as training needs arise. There will be additional opportunities to experience primary education, special needs and sixth form education on the programme."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are a vibrant and diverse alliance of schools in North Sefton. When you choose to train with us you will have access to three currently outstanding schools, schools with Sixth Forms and schools without, Faith and non-Faith schools, co-educational and single sex schools. The Coastal Alliance will ensure you the widest breadth of experience possible.\\r\n\\r\nOur alliance of schools are well established and highly respected in providing teacher training and provide a diverse range of experience for trainee teachers to prepare for their future careers.\\r\n\\r\nIn 2018, we achieved a 100% successful completion rate for our trainees with 80% being graded as outstanding! 60% of our trainees gained employment within our cluster of schools and 100% went into full-time employment in the teaching profession.\\r\n",
    "TrainWithDisability": "As a training provider, we recognise our duties under the Equality Act 2010 and consequently welcome applications from all groups within society. As a provider of Initial Teacher Training, and therefore a provider of future teachers, we recognise our responsibility to ensure positive attitudes to diversity and difference for the advantage of the young people and colleagues of partner schools. \\r\n\\r\nWe understand the value of a diverse culture and are open in our recruitment process and policy; no candidate shall receive positive or prejudicial treatment due to race, ethnic origin, disability, religion/ belief, gender, sexuality or age.\\r\n\\r\nDecision making will be based solely on our responsibility to the national criteria and our recruitment guideliens; applicants will be chosen on their merits and abilities.\\r\n\\r\nDisability and Access\\r\nAll reasonably practicable steps will be taken to ensure that problems relating to access or equipment do not debar disabled applicants from employment. Candidates who indicate a disability on their application form and are invited to a recruitment and selection day will be contacted in advance to discuss whether any particular access or other requirements are required, such as large print documents or wheelchair access. ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Edge Hill University is one of the country’s leading providers of teacher training and holds the TEF Gold award.",
        "UcasInstitutionCode": "E42"
      }
    ]
  },
  "has_inst": true
}
