{
  "locationType": "School",
  "accrediting": "Essex and Thames Primary SCITT",
  "provider": "John F Kennedy Special School",
  "subjects": [
    "Middle years",
    "Special educational needs"
  ],
  "name": "Special Educational Needs (Middle Years)",
  "financial_support": "Student finance if you’re eligible",
  "slug": "2GJ/36DM",
  "providerCode": "2GJ",
  "programmeCode": "36DM",
  "schools": [
    {
      "name": "Essex and Thames Primary SCITT",
      "address": "Runwell Primary School, CANEWDON GARDENS, Wickford, Essex, SS11 7BJ",
      "code": "A"
    }
  ],
  "addresses": [
    {
      "address": "Runwell Primary School, CANEWDON GARDENS, Wickford, Essex, SS11 7BJ",
      "geocode": true,
      "formatted_address": "Canewdon Gardens, Wickford SS11 7BJ, UK",
      "latitude": 51.6227743,
      "longitude": 0.5249087,
      "post_code": "SS11 7BJ",
      "city": "Essex",
      "route": "Canewdon Gardens",
      "postal_town": "Wickford"
    }
  ],
  "providerAddress": {
    "inst_code": "2GJ",
    "addr_1": "Essex & Thames Primary SCITT",
    "addr_2": "CANEWDON GARDENS",
    "addr_3": "WICKFORD",
    "addr_4": "Essex",
    "postcode": "SS11 7BJ",
    "url": "http://essexandthamesprimaryscitt.co.uk",
    "geocode": true,
    "formatted_address": "Runwell Community Primary School, Canewdon Gardens, Wickford SS11 7BJ, United Kingdom",
    "latitude": 51.6230527,
    "longitude": 0.52348,
    "post_code": "SS11 7BJ",
    "city": null,
    "route": "Canewdon Gardens",
    "postal_town": "Wickford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "FeeDetails": "Course fees are set at £9,000 per year or £3,000 per term for those on a accelerated programme.  Part time fees will be charged at £6,750 in year 1 and £4,500 in year 2.\\r\n\\r\nAt Essex and Thames Primary SCITT we understand that you are concerned about how your fees are spent. It’s a big investment and you have every right to know what you’re investing in. Providing you with the very highest quality teacher training is what we are totally committed to doing.\\r\n\\r\nHome and EU/EEA students may be eligible for a tuition fee loan to cover the cost of our school direct tuition fees. The loan comes from Student Finance England and once agreed, means that you won’t have to pay the tuition fees up front in order to train with us. You will only start to repay the loan once you are in full time employment and earning over approximately £21,000 per year.\\r\n\\r\nYou may also be eligible for a student maintenance loan to help towards accommodation and other living costs – amounts are dependent on household income and if you’re living with your parents or away from home. If you are an EU/EEA national, to be considered for a Maintenance Loan, you are also required to have been living in the UK for more than 5 years before the first day of the first academic year of your course.  For more details, please use the online Student Finance Calculator https://www.gov.uk/student-finance\\r\n",
    "AboutCourse": "One of the features of our training that sets us aside from other providers is its bespoke nature.  Our training is designed by a highly qualified team of senior teachers and leading academics and is primarily based in school.  The training is regularly adjusted to meet your emerging needs and to respond to the ever changing education landscape ensuring that you are learning at the cutting edge of research and best practice. \\r\n\\r\nEvidence shows that the best learning comes from training alongside the highest quality teachers, and at Essex and Thames Primary SCITT, you benefit from a significant amount of real school experience as you work alongside the best teachers in our area. We offer two training centres in Essex (Wickford and Southend) and give you access to all Canterbury Christ Church University facilities.\\r\n\\r\nDuring the year you will spend around 70 days in centre-based training, learning and practising your craft before teaching in the classroom. This includes sessions in all national curriculum subjects and associated areas, plus dedicated sessions for professional studies, SEND and inclusion, children’s mental health, behaviour and voice. Your teaching will be assessed by school mentors and your tutors.\\r\n\\r\nIf you already know you wish to specialise in Special Educational Needs and Disability, we offer placements in both areas enabling you to gain invaluable experience.  There are opportunities to enrole on a free two year top up programme in leadership and mathematics and all trainees are offered the opportunity to gain a sports coaching qualification during the year.\\r\n\\r\n‘The partnership ensures that trainees are well prepared for teaching … Headteachers confirm that NQTs are well prepared for the role of teacher.’  Ofsted 2016\\r\n \\r\nSuccessful trainees are awarded QTS and you have the opportunity to also study for a PGCE by submitting one written assignment, one presentation and a research project.    \\r\n\\r\nOur most recent Ofsted inspections were uniformly successful and three years after the course, we are proud to say, that a staggering 94% of our graduates are still teaching. We are a top rated provider recognised nationally for our work in voice, phonics, behaviour management and Special Educational Needs and Disability (SEND).  100% of our trainees are recruited into teaching posts.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "To apply to us you must have:\\r\n\\r\nAn honours degree (minimum 2:2) from a university in Great Britain or Overseas, or an ordinary degree with 300 credits, of which 60 must be at level 6, or a qualification recognised as equivalent to a degree.\\r\nGCSEs at level C (or equivalent) in Mathematics, Science and English.\\r\nThe ability to communicate clearly in written and spoken English.\\r\nDon’t worry if you don’t have any school experience, many of our schools are happy to provide the opportunity for applicants to gain experience with them.\\r\n",
    "FinancialSupport": "At Essex and Thames Primary SCITT, because of our large number of primary school and teaching school partners, we are pleased to report that an increasing number of bursaries are being offered by schools to graduates who train with us. Schools understand that we attract high quality trainees and that we train them rigorously, so the bursaries they offer reflect their confidence in being able to recruit successfully from our newly qualified teacher pool. \\r\n\\r\nBursary amounts have ranged from £1000 to £6000+ in recent years, and are completely school led (not SCITT led). We recommend that you apply early to be considered for one of these bursaries.\\r\n\\r\nMore information on finance can be found on our website:\\r\n\\r\nhttp://www.essexandthamesprimaryscitt.co.uk/pgce-funding/\\r\n\\r\nOnce the DfE has published new finance figures for 2019/20, we will update our finance guide which can be obtained by contacting our office:\\r\n\\r\nhttp://www.essexandthamesprimaryscitt.co.uk/contact-essex-and-thames-primary-scitt/\\r\n\\r\nWith 20 years experience in teacher training, our knowledgeable office and finance staff are always at hand with advice and practical support for students with financial concens or issues with student finance. We are experienced at applying for additional sources of support for those in real need and encourage our students to come and talk to us with financial worries. \\r\n",
    "InterviewProcess": "Candidates must meet the essential entry requirements (or have the required qualifications by the start of the course).  Applications must be clearly written and provide evidence of a strong desire to be a primary teacher and successful applicants will be called to an interview day.  The interview involves a number of elements that give applicants a chance to demonstrate all the necessary qualities and skills needed to be a successful teacher. \\r\n\\r\nAt interview you will be asked to:\\r\nParticipate in an interview with a senior member of the SCITT staff and a headteacher from one of our schools;\\r\nWork with a whole class;\\r\nWork with groups of children;\\r\nTake part in a group discussion;\\r\nReflect on your experiences in the classroom and teaching that you have observed. \\r\n\\r\nIt is important that you come to interviews prepared for the tasks set so that we are able to assess your suitability to train.\\r\n\\r\nSuccessful applicants will be notified within 2 working days and offered a place. \\r\n",
    "OtherRequirements": "Candidates are required to pass the Skills Tests in English and Mathematics following an offer of a place.  Support to do this is available to those candidates who have accepted offers with us.\\r\n\\r\nOnce you have accepted your offer we will make an application for an enhanced DBS check. All offers will be subject to this being completed successfully.\\r\n\\r\nAll candidates are required to make a fitness to teach declaration to Occupational Health.\\r\n",
    "PersonalQualities": "We would like to hear from you if you are:\\r\n\\r\nKeen to become an outstanding teacher;\\r\nCreative and imaginative;\\r\nKeen to open the minds of young people to achieve their fullest potential;\\r\nAble to work collaboratively;\\r\nPrepared to innovate and take risks: \\r\nPrepared to learn from research;\\r\nPrepared to work hard to develop your skills  and your understanding of how children learn;\\r\nCommitted to providing a positive nurturing learning environment.\\r\n\\r\nMost of all, we are looking to recruit trainees with a real passion for entering the teaching profession. \\r\n",
    "HowSchoolPlacementsWork": "We have 135 schools in Essex and London working with us, and we are growing all the time. You can see our current list of trust schools on our website https://goo.gl/VYhMu3\\r\n\\r\nYou will spend 120+ days in school-based training placements which are in at least 2 different schools and are in alternate key stages so that all our trainees have thorough practical experience in two Key Stages.  The breadth of the partnership ensures that we are able to offer a diverse range of training opportunities, and after 20 years, our schools have developed a range of deep partnerships with leading edge practitioners and experts, and are committed to regularly sharing these opportunities with trainees.\\r\n\\r\nOn this programme, you will teach from age 7-14  Working alongside experienced teachers, you will be supported to take on a slowly increasing teaching role and be offered experience in a range of socio-economic settings.\\r\n\\r\nTrainees are usually placed as locally as possible, but must be prepared to travel up to 1 hour to ensure the richest range of school experiences.\\r\n\\r\n“The partnership ensures that trainees are well prepared for teaching … Headteachers confirm that NQTs are well prepared for the role of teacher.”\\r\nOfsted 2016\\r\n\\r\nHigh quality mentoring and pastoral support are provided in all areas, with trainees being allocated a personal tutor and a school mentor who will meet with them regularly to guide and support them through the training.  Our school-based support extends into the NQT year with social events, a comprehensive NQT training programme and access to 1:1 support from SCITT staff as required.\\r\n\\r\nMost of our schools are located near public transport and within easy reach for non drivers.  Our training base at Wickford is a ten-minute walk from the railway station and our Southend base is on an easily accessible bus route\\r\n\\r\nWe are thrilled and proud to say, that a staggering 100% of our trainees are recruited into teaching posts at the end of their training, primarily in our partnership schools.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are a partner school in one of the country's leading school-centred initial teacher training programmes.  Our excellent teacher training is supported by the large partnership of good and outstanding primary schools, comprising 130 members.  Experienced teachers and Personal Tutors mentor you, offering you bespoke support and guidance throughout the year.  Due to the outstanding reputation we hold for the provision of rigorous and effective training, our trainees are among the first to gain employment each year.  \\r\n\\r\nVisit [our website] (www.essexandthamesprimaryscitt.co.uk) to hear what our trainees and schools say about us.\\r\n\\r\n‘Training is carefully tailored to meet the needs of all trainees.’ Ofsted.\\r\n\\r\nWe pride ourselves on the excellent support we offer, providing you with a personal tutor during your training year, and continuing our support into your first year of teaching with our NQT support team. \\r\n\\r\nNot only will you gain Qualified Teacher Status (QTS) by training with us, but during the year you will also receive professional training in educational theory leading to a PGCE award with masters level credits.  As a result, you will  begin your teaching career with excellent practical teaching skills and with an deep understanding of the underpinning educational theory. This enables you to work effectively across the whole of the primary phase of education. \\r\n\\r\nOur course has one of the highest long-term retention rates in the country.  We are very proud that all our graduates obtain teaching jobs and that a large number go on to become very successful school leaders.\\r\n",
    "TrainWithDisability": "We encourage applications for places from disabled trainees, many of  whom go on to make outstanding teachers.  Our training facilities and all our partnership schools have suitable disabled access facilities. Each year we recruit trainees with a wide range of additional needs. We regularly work in partnership with other agencies to ensure we provide you with the best possible support\\r\n\\r\nIf you wish to discuss any aspect of access in more detail please email admin@thamesprimaryscitt.co.uk\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Essex and Thames Primary SCITT is one of the UK’s most established providers, having sustained an excellent reputation for 20 years.  Working in partnership with Canterbury Christ Church University the courses offer excellent value for money and an opportunity to train with some of the very best in the sector.\\r\n",
        "UcasInstitutionCode": "T25"
      }
    ]
  },
  "has_inst": true
}
