{
  "locationType": "School",
  "accrediting": "Nottinghamshire TORCH SCITT",
  "provider": "Nottinghamshire Torch SCITT",
  "subjects": [
    "Biology",
    "Science",
    "Secondary"
  ],
  "name": "Biology",
  "slug": "1EB/32TR",
  "providerCode": "1EB",
  "programmeCode": "32TR",
  "schools": [
    {
      "name": "Main Site",
      "address": "Toot Hill School, The Banks, Bingham, Nottingham, NG13 8BL",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Toot Hill School, The Banks, Bingham, Nottingham, NG13 8BL",
      "geocode": true,
      "formatted_address": "The Banks, Bingham, Nottingham NG13 8BL, UK",
      "latitude": 52.9484862,
      "longitude": -0.9530017,
      "post_code": "NG13 8BL",
      "city": "Bingham",
      "route": "The Banks",
      "postal_town": "Nottingham"
    }
  ],
  "providerAddress": {
    "inst_code": "1EB",
    "addr_1": "Toot Hill",
    "addr_2": "The Banks",
    "addr_3": "Bingham",
    "addr_4": "Nottingham",
    "postcode": "NG13 8BL",
    "url": "http://www.toothill.notts.sch.uk",
    "geocode": true,
    "formatted_address": "The Banks, Bingham, Nottingham NG13 8BL, UK",
    "latitude": 52.9484862,
    "longitude": -0.9530017,
    "post_code": "NG13 8BL",
    "city": "Bingham",
    "route": "The Banks",
    "postal_town": "Nottingham"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "At Nottinghamshire Torch SCITT we pride ourselves on ensuring all our trainee teachers have an exceptional training experience.\\r\n\\r\nThe majority of your time will be spent in your placement schools to gain qualified teacher status developing your practice working alongside school-based mentors.\\r\n\\r\n- The course starts with an intensive 3 week induction programme to the teaching and learning process, including discussion and development of basic elements of teaching, introduction to planning and curriculum, behaviour management and safeguarding, etc.  You will experience a range of school settings, meet over 30 different educational experts and feel fully confident before you start. This will enable deeper, more detailed coverage of the professional standards to be done later during the training year. The aim is to give you a thorough grounding prior to starting school placements. \\r\n- Fridays will be spent on core and subject specific training as well as 10 days across the year at the University of Nottingham where you will gain your PGCE and Masters credits.\\r\n- We have a dedicated team of Subject Specific Mentors across our alliance who will ensure you are supported in your school and will quality assure the training you are undertaking.\\r\n- Timetables will be developed to progress practice, by having an escalation of the number of lessons taught, and/or developing stages in practice, from supporting the classroom teacher, to team teaching with the class teacher, to taking elements of a lesson, to taking full lessons.\\r\n- You will have two main placement schools but through training and extended placements visit over 10 within our partnership.\\r\n- We offer you an international experience which is a unique feature of the programme enabling you to more deeply appreciate the need to secure high standards and outcomes for students, to enable them to compete in a global world.  We believe this experience can assist you in deepening your pedagogical thinking and help you to develop into reflective practitioners.\\r\n- You will experience a range of special educational needs (both during mainstream placements and via a special school visit), strategies for supporting students with such needs plus real experiences of differentiation and personalised learning which will give you an excellent grounding for teaching SEN/D students within mainstream education.\\r\n- Throughout the course you will receive exceptional levels of support and care from the SCITT core team, mentors and subject specialists to ensure you succeed.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "All applicants are required on entry to their teacher training course to hold a UK degree or equivalent qualification. We would normally expect to see that at least 50% of your first degree is directly relevant to the subject you intend to teach.\\r\n\\r\nIf your degree is different we do consider additional qualifications e.g. A level grades or vocational courses, careers training etc. Subject knowledge enhancement courses may be offered as part of a conditional offer if you require one.\\r\n\\r\nWe require you to have English Language and Mathematics GCSE grade C (4) or above, or an equivalent qualification.",
    "FinancialSupport": "Bursaries for ITT routes are available for many subjects. For the recruitment year (2018-19) they ranged from £0-£26,000. Please see further updates from DfE Get into Teaching website.\\r\n\\r\nNTS also offer some salaried routes for trainees as well as supporting secondary applicants in gaining subject specific scholarships (giving a 2K uplift on normal bursary values) as well as wider benefits.\\r\n\\r\nNTS supports trainees to access Subject Knowledge Enhancement courses (only if given as part of a conditional offer).  SKE courses are available, in selected subjects, for either a 8, 12 or 16 week period. The SKE's are funded by the DofE for the pre-course year and if you are eligible, you will receive £200 per week for the SKE bursary). ",
    "InterviewProcess": "We will screen your application and decide whether to offer you an interview.  Your UCAS  application form is looked at very carefully, in particular, we are interested in your wider potential which we can see through your personal statement, qualifications and your experience (even if it isn't in teaching).\\r\n\\r\nUse the personal statement to convince us that you genuinely want to teach and will make a good teacher. Make sure that you have given us a clear indication of the subject content of your degree.  On the basis of our consideration of your application form and the references, you may be invited to an interview.  There are likely to be other applicants being interviewed alongside you in an initial group task.\\r\nDuring the interview process, you will be asked to teach a 20min activity to a small group of children, complete a subject - related written task and to give a short presentation on \"Why I want to become a teacher\". The formal interview will follow.  During this time, we observe for your wider potential to teach. You have the opportunity to ask any questions that you may have and most people find it an enjoyable not threatening experience.\\r\nYou will be interviewed by the staff from the Nottinghamshire Torch SCITT.\\r\nWe will inform you of our decision as soon as possible after your interview. If you are offered a conditional offer, you will receive a pack of information describing the steps you should take next.",
    "OtherRequirements": "* Fitness To Teach - A declaration of health questionnaire will be completed by successful applicants and sent to Occupational Health Services.\\r\n\\r\n* Disclosure and Barring Service (DBS) - For all initial teacher training courses, applicants must complete forms requesting an Enhanced Disclosure from the DBS. In addition you will be required to disclose previous offences.\\r\n\\r\n* Literacy and Numeracy Skills Test - All applicants with a conditional offer must have passed these prior to commencing the course.\\r\n",
    "PersonalQualities": "* A Desire to Teach and Work with Young People - ideally evidenced through some prior school experience\\r\n* Effective Communication Skills - confidence and the ability to relate to children and young adults\\r\n* Creativity - the ability to think differently to devise interesting and engaging lessons\\r\n* Professionalism\\r\n* High levels of energy and physical/mental resiliance\\r\n* A Commitment to Work Hard on the Course\\r\n* A Determination to Succeed\\r\n* A Readiness to Listen And Share\\r\n* A Flexible Approach to Learning and Teaching\\r\n\\r\n",
    "HowSchoolPlacementsWork": "The Nottinghamshire Torch SCITT Partnership Schools (over 30) are fully invested in the programme. Heads of School all want NTS trainees to succeed as they require a highly skilled workforce. All of our partnership schools are highly experienced in delivering ITT in school provision.\\r\nThe Nova Education Trust and SCITT partnership have an extensive range of schools within both the Primary and Secondary sector across Nottinghamshire, Nottingham City, Derby and Leicestershire.\\r\n\\r\nWe aim to recruit a strong cohort of trainees with approximately 4-10 maximum in each subject area. We then, through agreement with trainees, arrange the best suited placement schools. We look to minimise travel distance for trainees, maximise the quality of mentorship and school support. Most school partners will host 4-10 trainees at any one time (across the range of subjects). This allows for trainees to not feel isolated and to be able to support each other on placement. We also provide all trainees with contrasting school experiences as this is important in developing a range of professional skills.\\r\n\\r\nOn the secondary programme, you will be teaching the 11-16 range and most partnership schools are post 16 providers too so we encourage all our trainees to experience both vocational and examination for 16-19.\\r\n\\r\nSecondary School partners are <a href= http://www.toothillschool.co.uk >The Toot Hill School</a> in Bingham, <a href= http://www.medenschool.co.uk >The Meden School</a> in Market Warsop,<a href= http://www.nusa.org.uk >The Nottingham University Samworth Academy</a>, in Bilborough, <a href= http://www.nottinghamfreeschool.co.uk >The Nottingham Free School</a> in Nottingham, <a href= http://www.newarkacademy.co.uk >The Newark Academy</a> in Newark, <a href= http://www.suthersschool.co.uk >The Suthers School</a>,in Bingham, <a href= http://www.djanogly.notts.sch.uk >The Djanogly Academy</a> in Nottingham,<a href= http://www.garibaldi.org.uk >The Garibaldi College</a> in Mansfield, <a href= http://nuast.org.uk/ >The Nottingham University Academy of Science and Technology</a> in Nottingham will be offering secondary SCITT and School Direct places for 2019.\\r\n\\r\nPrimary Partner Schools are <a href= http://www.birklandsschool.co.uk >The Birklands School</a> in Warsop, <a href= http://www.carnarvonschool.co.uk >The Carnarvon School</a> in Bingham, <a href= http://www.churchvaleschool.co.uk >The Church Vale School</a> in Church Warsop, <a href= http://www.firbeckschool.co.uk >The Firbeck School</a> in Wollaton, <a href= http://www.gunthorpeschool.co.uk >The Gunthorpe School</a> in Gunthorpe,  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are delighted you are looking at training with the Nottinghamshire Torch SCITT. The Nottinghamshire Torch SCITT (NTS) is part of the Nova Education Trust. The lead school is Toot Hill School; rated Outstanding by Ofsted.\\r\n \\r\nTraining with the Nottinghamshire Torch SCITT will provide:\\r\n\\r\n1.      First class school based training leading to Qualified Teacher Status with PGCE and Masters credits (through our partnership with the University of Nottingham)\\r\n2.      A wide range of schools offering a varied cross phase experience\\r\n3.      A funded international teaching experience (Finland) \\r\n4.      Leadership development future fast track employment opportunities\\r\n5.      Excellent support networks in schools and beyond\\r\n6.      Opportunities for paid employment whilst training \\r\n7.      Living and working in beautiful Nottinghamshire\\r\n\\r\nOur 30+ partner schools have a long, successful history of working with Initial Teacher Training students. More information on partner schools can be found on our website www.teachnottingham.co.uk \\r\n\\r\nWe have worked together closely to develop a high quality programme based on experience, excellent Quality Assurance and a commitment to a high level of support for trainees. We do not just train people to teach...we create the next generation of outstanding school practitioners and leaders. We offer over 40 days of core school based training utilising expertise from highly qualified teaching professionals within a broad range of schools.\\r\n",
    "TrainWithDisability": "NTS are a highly inclusive training provider that is in the position to support trainees with additional physical and mental needs. Most of our school partners have wheelchair access and provision plans are put into place to support trainees with physical disabilities (e.g. visual/auditory impairment). We are experienced in supporting trainees with Dyslexia and provide support plans and adapted materials to ensure no one is at a disadvantage. \\r\n\\r\nWe provide regular training to support all trainees to develop wider skills that support mental and physical wellbeing. This includes links with wider partners such as counsellors, lifestyle and wellbeing coaches. Over the training year, trainees are coached to develop good work-life balance management and to develop good working habits that supports mental health and wellbeing. With trainees who have a history of mental health issues we continue to provide personalised support and if required will commission additional support. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "With high completion rates (100% over 3 years) all trainees secure employment offers within the first few months of gaining QTS. Many former trainees have fast tracked into school leadership roles and continue to benefit from the high quality continuous support and networks established.\\r\n\\r\nEmployment is not just about getting a job; you will be able to make very informed choices (supported by experts) about what type of school that suits your educational philosophy and vision. That is why such a large proportion of our former trainees continue to be highly successful teachers with high levels of teacher retention.\\r\n",
        "UcasInstitutionCode": "254"
      }
    ]
  },
  "has_inst": true
}
