{
  "locationType": "University",
  "accrediting": null,
  "provider": "Roehampton University",
  "subjects": [
    "Computer studies",
    "Secondary"
  ],
  "name": "Computing",
  "slug": "R48/G5X1",
  "providerCode": "R48",
  "programmeCode": "G5X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "geocode": true,
      "formatted_address": "Roehampton Ln, London SW15 5PU, UK",
      "latitude": 51.4579866,
      "longitude": -0.2432869,
      "post_code": "SW15 5PU",
      "city": "Greater London",
      "route": "Roehampton Lane",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "R48",
    "addr_1": "Roehampton Lane",
    "addr_2": "London",
    "addr_3": null,
    "addr_4": null,
    "postcode": "SW15 5PU",
    "url": "http://www.roehampton.ac.uk",
    "geocode": true,
    "formatted_address": "Roehampton Ln, London SW15 5LS, UK",
    "latitude": 51.4554361,
    "longitude": -0.2431242,
    "post_code": "SW15 5LS",
    "city": "Greater London",
    "route": "Roehampton Lane",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The Southampton University Led Secondary M level PGCE course provides an excellent route into teaching. The course has consistently been rated highly by former trainees, and has been successful in a series of recent Ofsted inspections. Our PGCE Secondary programme is designed and taught jointly by the Southampton Education School (SEdS) in partnership with over 125 schools across the region in seven different subject areas, and has a very good track record of moving successful trainees into employment, locally and beyond. Two thirds of the PGCE is spent in two school placements, starting in October, under the guidance of curriculum mentors who are all experienced classroom teachers. One third is spent in university, under the guidance of curriculum tutors, who all have extensive school teaching experience.\\r\nOverview of the PGCE Secondary Computer Science and Information Technology course \\r\nOur PGCE Secondary CS&IT course will equip you with the necessary skills and knowledge to teach Computing (CS, IT, Digital Literacy) across the secondary age range, including some opportunities to explore 16-19 teaching.  The course is designed to create Computing teachers that have a clear and well-founded philosophy towards the subject and can teach Computing at all levels.  \\r\nWe aim for reflective and dynamic practitioners willing to use a variety of teaching strategies to inspire all learners.  After completing the course, you will have a clear understanding of the problems pupils encounter in Computing, you will be prepared to find ways to overcome these challenges, and you will be able to help learners make progress.  \\r\nIn a combined effort from the university and our partnership schools, we develop your subject knowledge in Computing and your understanding of how to teach Computing through a range of approaches.  These include workshops, seminars, lectures and demonstrations, micro-teaching activities, and independent and group research.  \\r\nWe utilise the wide range of teaching resources currently available to create fully reflective practitioners who have the potential to truly impact pupil learning.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Prospective candidates will have good knowledge of the subject, from a first degree award. The normal expectation is that students will have at least 50% of their first degree in their chosen subject. Minimum degree required: 2:2.\\r\nCurrently, you must have GCSE passes at grade C/grade 4 or above in English Language and Mathematics. This is a government requirement, and ‘equivalent qualifications' are as designated by the PGCE admissions team (IELTS qualifications are not considered equivalent). If your qualifications are not considered to be appropriate, we can offer GCSE equivalent tests in English and Maths.\\r\n",
    "FeeInternational": 18104.0,
    "InterviewProcess": "At interview, candidates will meet the tutor team and learn about key elements of the programme, including how trainees are supported and developed, how placements work and how trainees are assessed. Each candidate will give a short presentation related to their curriculum subject and will complete a written task followed by an individual interview with subject tutors.",
    "OtherRequirements": "You will be required to obtain:\\r\n* complete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations \\r\n* to provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. Visit www.disclosure.gov.uk for more information. \\r\n* pass 2 QTS Skills Tests in Literacy and Numeracy before you are eligible to be accepted on to any ITE programme. \\r\n\\r\nThese must be completed before commencement of the programme to which you have applied.\\r\n",
    "HowSchoolPlacementsWork": "Each trainee undertakes two block placements in schools within our Partnership. We aim to provide schools that offer contrasting placement experiences in order to develop a breadth and range of skills. During the placement blocks, one day per week is dedicated to training with the university in either curriculum or professional development. A regular programme of school based professional training is also delivered whilst trainees are on placement. Whilst on placement, each trainee is allocated a mentor from their subject area and a professional mentor to oversee the professional training. Trainees will also receive visits from their university tutor to support them in their teaching and professional development."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education at Roehampton is one of the principal providers of teacher training in the UK, with partnerships with over 350 schools. We have a rich history of over 175 years providing teacher training education through our four Colleges. \\r\n\\r\nAs a student in our School, you will enjoy high quality teaching, which will equip you for a successful career with a competitive starting salary. Your employment prospects will be excellent: 99% of our teacher training graduates are in work or further study six months after leaving us (Destinations of Leavers of Higher Education 2013/14). \\r\n\\r\nWe are based on a beautiful parkland campus in south-west London, close to Putney and Hammersmith, and just 30 minutes from the West End. Our School is ranked third in London for the quality of our research in the field of education (Research Excellence Framework 2014), reflecting the work-class expertise of our staff.\\r\n\\r\nFor more information about the university, please see here.\\r\n\\r\n(https://www.roehampton.ac.uk/why-roehampton/)",
    "TrainWithDisability": "The University of Roehampton welcomes students with disabilities and offers flexible support services tailored to your needs. Our Disability and Dyslexia Services are on the main campus, Digby Stuart, along with our Access Centre: Access@SW15.\\r\n\\r\nFor new students, we strongly recommend that you get in touch to let us know about your specific disability and support needs. Any information provided will be kept strictly confidential and will only be used to support you with your studies. \\r\n\\r\nWe recommend to inform us of your specific learning difference (SpLDs) such as Dyslexia, Dyspraxia, Dyscalculia and Attention Deficit Hyperactivity Disorder (ADHD).\\r\n\\r\nFor more information please see our disability services website here.\\r\n\\r\n(https://www.roehampton.ac.uk/disability-services/)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
