{
  "locationType": "University",
  "accrediting": null,
  "provider": "Edge Hill University",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "E42/V1X1",
  "providerCode": "E42",
  "programmeCode": "V1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "E42",
    "addr_1": "Edge Hill University",
    "addr_2": "St Helens Road",
    "addr_3": "Ormskirk",
    "addr_4": "Lancashire",
    "postcode": "L39 4QP ",
    "url": "http://www.edgehill.ac.uk/postgraduate/pgce",
    "geocode": true,
    "formatted_address": "Edge HIll University, Ormskirk, UK",
    "latitude": 53.5576393,
    "longitude": -2.8692166,
    "post_code": null,
    "city": "Lancashire",
    "route": null,
    "postal_town": "Ormskirk"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary English course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nYour tutors are active researchers in matters relating to history education. They are regarded as experts in the field, both nationally and internationally, and have been consulted by a number of national and international organisations, such as the Historical Association, QCA and QCDA, the TDA, Ofqual, the Department for Education and Council of Europe on matters relating to the history curriculum.\\r\n\\r\nYour assignments are designed to help you plan your teaching effectively and imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils. Tutors weave together personal experience, practice and research into challenging but highly practical and relevant sessions.\\r\n\\r\nYou will learn in first-class facilities through a series of practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n*gaining experience of the range of responsibilities of classroom teachers."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Edge Hill University is based on an attractive, award-winning 160-acre campus in Lancashire, close to Liverpool and Manchester. The institution has been providing higher education since 1885, with a mission to create opportunity from knowledge.\\r\n\\r\nThe institution’s significant success in achieving its mission is recognised by a range of awards and high rankings for teaching, student experience, accommodation and more. Edge Hill is ranked as Gold in the Teaching Excellence Framework (TEF), the government’s evaluation of excellence in teaching quality, learning environment and student outcomes. The University is also one of the select few to have held the coveted UK University of the Year title, awarded by Times Higher Education (2014/15).\\r\n\\r\nEdge Hill University has been at the forefront of initial teacher training for 130 years. Our PGCEs enable graduates to train to teach in early years, primary, secondary or further education.\\r\n\\r\nYou can study a broad-based early years or primary PGCE, specialise in primary mathematics or primary physical education, choose from a variety of dedicated routes in secondary subject areas, or prepare for a career in further education or the lifelong learning sector.\\r\n\\r\nIf you’re looking to join a PGCE in secondary education but lack the required subject knowledge, we may have a suitable subject knowledge enhancement course for you.\\r\n\\r\nWhichever age range or specialism you choose, your programme will combine expert tuition with significant time in schools and other settings, enabling you to gain extensive practical experience and become increasingly confident in the classroom.",
    "TrainWithDisability": "The Inclusion Team provide information, guidance and support to applicants and students who have disclosed any of the following: Autism Spectrum Conditions (ASC), Mental Health, Sensory Impairment, Mobility difficulties or a medical condition e.g. Epilepsy, Diabetes, Heart Condition, Asthma and we work closely with academic and support staff across the University.\\r\n\\r\nLearning Services provides support to students with a specific learning difficulty – SpLD, such as Dyslexia.\\r\n\\r\nWe encourage disabled applicants to make contact with us early in the application process to enable us to plan for support you may need right from start of your university course. We provide a friendly and professional service and applicants and students can discuss individual requirements in complete confidence. Our highly experienced team are here to advise you about:\\r\n\\r\n Impact of disability/health condition and potential impact on study\\r\n\\r\nSupport available including 1-1 sessions, group support and study skills sessions\\r\n\\r\nThe benefits of a Student Support Plan\\r\n\\r\nDisabled Students Allowance (DSA) and eligibility\\r\n\\r\nReasonable adjustments to support your study\\r\n\\r\nExam modifications and alternative assessments\\r\n\\r\nRights and Responsibilities\\r\n\\r\nSupport whilst on placement (e.g. access and transport)\\r\n\\r\nDisclosure and Confidentiality\\r\n\\r\nRights and Responsibilities\\r\n\\r\nPEEPs and Emergency Action Plans\\r\n\\r\nOne of our priorities is to ensure safe environment for all students. If you have Epilepsy, Diabetes, Asthma or another serious health condition which may require First Aid, we strongly recommend that you complete one of our Emergency Action Plans. We can discuss this with you when you come to see us.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
