{
  "locationType": "School",
  "accrediting": "Sheffield Hallam University",
  "provider": "Aspirer School Direct",
  "subjects": [
    "Physical education",
    "Primary"
  ],
  "name": "Primary (5-11) Physical Education Specialist",
  "slug": "1XQ/37CP",
  "providerCode": "1XQ",
  "programmeCode": "37CP",
  "schools": [
    {
      "name": "Main Site",
      "address": "Belgrave Road, Macclesfield, Cheshire, SK11 7TF",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Belgrave Road, Macclesfield, Cheshire, SK11 7TF",
      "geocode": true,
      "formatted_address": "Belgrave Rd, Macclesfield SK11 7TW, UK",
      "latitude": 53.2446911,
      "longitude": -2.1318939,
      "post_code": "SK11 7TW",
      "city": "Cheshire East",
      "route": "Belgrave Road",
      "postal_town": "Macclesfield"
    }
  ],
  "providerAddress": {
    "inst_code": "1XQ",
    "addr_1": "Aspirer School Direct",
    "addr_2": "Belgrave Road",
    "addr_3": "Macclesfield",
    "addr_4": "Cheshire",
    "postcode": "SK11 7TF",
    "url": "http://www.aspirerteachingalliance.co.uk",
    "geocode": true,
    "formatted_address": "Belgrave Rd, Macclesfield SK11 7TF, UK",
    "latitude": 53.2442747,
    "longitude": -2.1324902,
    "post_code": "SK11 7TF",
    "city": "Cheshire East",
    "route": "Belgrave Road",
    "postal_town": "Macclesfield"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "This course prepares you to be a Primary Teacher, teaching ages 5 - 11 but with a Specialism in Physical Education.\\r\nYou will spend the vast majority of the year learning how to teach in a real classroom and be mentored by your Learning Coach, who will be an experienced, expert and outstanding teacher.\\r\nYou will learn how to teach all of the primary school subjects as well as aspects such as behaviour management, safeguarding, special needs and disability, teaching children with English as an additional language, assessment, lesson planning, observing learning and using ICT.  \\r\nYou will gain extra expertise in the teaching of PE and in leading PE in a primary school. This is gained throughout the year and is \"kick started\" in a pre course, three week mini course in the best practice in teaching and leading PE. \\r\nWe are one of the first five National Research Schools so you will have access to the latest high quality research and to national experts in a number of fields such as teaching reading and mathematics.\\r\nSheffield Hallam, recently recognised by OFSTED as an outstanding provider, lead the teaching for the 60 Masters credits that you will gain.  These are gained through assignments on: Talk and learning, Lesson study (in which you will have the opportunity to do some small scale research of your own) and following the progress of a group of children in your class over a year. These are completed mainly through an on line platform. You spend around 15 days at Sheffield Hallam in the year (travel from your \"home\" school is paid).\\r\nYou will be assessed on your growing ability to teach over the year by your Learning Coach/ Mentor and on these assignments. \\r\nBy the end of the course, we aim that you will be an outstanding primary class teacher with a specialism in teaching and leading PE.\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You will need:\\r\n\\r\n* A degree (2:1 preferred but at least 2.2) or equivalent\\r\n* GCSE at C grade or above in English Language, Mathematics (or standard equivalent) and a Science\\r\n\\r\nApplicants must pass the Professional Skills Tests in English and Mathematics (It's a good idea to have a look at these soon after applying to give you an idea of the expected standard).\\r\n \\r\nWe can facilitate schools in which to gain volunteer experience for Aspirer applicants. ",
    "InterviewProcess": "Once you have applied, you may be offered an interview. At the interview, you will be asked to:\\r\n\\r\n* Facilitate a classroom activity for between 20 - 30 minutes.  You can choose the activity and the year group.\\r\n* Complete an academic writing task and a maths task\\r\n* Interview with the panel (Usually the Programme Leader and a Headteacher or Principal from one of the Alliance Schools)",
    "PersonalQualities": "You must have:\\r\n\\r\n* Commitment to a career in teaching\\r\n* Effective communication skills including use of written and spoken English\\r\n* Excellent interpersonal skills and the ability to work well in a team\\r\n* Leadership potential\\r\n* Ability to relate to and engage with children\\r\n* A range of positive personal characteristics including flexibility, communication, independence, initiative and resilience\\r\n* Ability to explain concepts clearly\\r\n* The ability to develop strong subject knowledge\\r\n* A sense of humour\\r\n",
    "HowSchoolPlacementsWork": "We work with over fifteen schools in the Cheshire East, Cheshire West and Chester and Manchester areas. \\r\nYou will learn to teach children from ages 5 to 11. \\r\nYou will be placed in a \"home\" school for the majority of the year (around 32 weeks in total) and do a shorter placement (around 10 weeks) in an \"away\" school so that you complete placements in Key Stages One and Two.\\r\nWe strive to place you in a home school which is easily accessible for you  and which suits your needs after discussion with you.  \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Aspirer and Sheffield Hallam University work in partnership together with 15+ primary schools within Cheshire East, Cheshire West and Manchester. Trainees will be placed in schools in the Macclesfield, Wilmslow, Crewe, Northwich and Sandbach areas and in Fallowfield, Manchester.  The schools within our alliance are varied in terms of their contexts. We work with schools in rural, urban and more deprived areas,  However, all schools in our partnership are committed to ensuring the very best outcomes for all children regardless of their starting points and are excited about training the next generation of teachers who will continue to do this. \\r\nAs one of the first National Research Schools, our programme is rooted in the latest understanding and research into effective teaching and learning. \\r\nWe strongly believe that we are best placed to share with trainees up to date, current practice around teaching and learning, classroom management and anything else that trainees need to know in order to become an outstanding and inspirational classroom practitioner, whatever school setting they choose to apply to in the future. \\r\nMore information about the course and the schools within our alliance can be found on our website:(http://www.aspirerteachingalliance.co.uk/schooldirect). ",
    "TrainWithDisability": "Both Aspirer and Sheffield Hallam are proud of the support - from application to course completion -  that we give to students with access difficulties.  \\r\nWe consider every applicant as a unique individual with the potential to become an outstanding teacher and that we do all that we can to help trainees to overcome any barriers to success.\\r\nIn the recent past, students with difficulties such as physical needs, dyslexia and hearing impairment have successfully gained their PGCE and QTS with Aspirer. ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We work in close partnership with Sheffield Hallam University (SHU) - recently judged as an Outstanding provider of Initial Teacher Education by OFSTED.\\r\nAcademic and professional training is shared between SHU and Aspirer with some sessions being led by Outstanding teachers and leaders from the Alliance schools held at our training room in Macclesfield and others at Sheffield Hallam.  ",
        "UcasInstitutionCode": "S21"
      }
    ]
  },
  "has_inst": true
}
