{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Exeter",
  "subjects": [
    "German",
    "Languages",
    "Secondary"
  ],
  "name": "Modern Languages (German)",
  "slug": "E84/R2X1",
  "providerCode": "E84",
  "programmeCode": "R2X1",
  "schools": [
    {
      "name": "University of Exeter (Exeter Campuses)",
      "address": "PGCE Admissions Office, Northcote House, The Queen's Drive, Exeter, DEVON, EX4 4QJ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "PGCE Admissions Office, Northcote House, The Queen's Drive, Exeter, DEVON, EX4 4QJ",
      "geocode": true,
      "formatted_address": "Northcote House, Exeter EX4 4QB, UK",
      "latitude": 50.7355102,
      "longitude": -3.5353456,
      "post_code": "EX4 4QB",
      "city": "Devon",
      "route": null,
      "postal_town": "Exeter"
    }
  ],
  "providerAddress": {
    "inst_code": "E84",
    "addr_1": "Northcote House",
    "addr_2": "The Queen's Drive",
    "addr_3": "Exeter",
    "addr_4": "Devon",
    "postcode": "EX4 4QJ ",
    "url": "http://www.exeter.ac.uk",
    "geocode": true,
    "formatted_address": "The Queen's Dr, Exeter EX4 4QJ, UK",
    "latitude": 50.7353218,
    "longitude": -3.5350734,
    "post_code": "EX4 4QJ",
    "city": "Devon",
    "route": "The Queen's Drive",
    "postal_town": "Exeter"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "This Post Graduate Certificate Education (PGCE) Secondary Modern Foreign Language course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\\r\n\\r\nThe programme has consistently been judged as excellent in both internal and external reviews, and is widely acknowledged as one of the best modern foreign language courses in the country.\\r\n\\r\nYour tutors are a diverse and incredibly experienced community of academics with wide practical experience in schools and international reputations as experts in the field of Modern Foreign Language teaching and learning.\\r\n\\r\nThe PGCE will provide you with a theoretical framework for language teaching closely integrated with practical advice on the preparation and delivery of effective and engaging language lessons. Your assignments are designed to help you to plan your teaching effectively and imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils.\\r\n\\r\nYou will be taught through a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. Sessions may include:\\r\n\\r\n* participating in workshop style sessions with your peers\\r\n* attending presentations by subject experts\\r\n* working on tasks in groups\\r\n* having individual tutorials\\r\n* visits to schools or other education settings\\r\n* visits to theatres, museums, galleries or sites of educational interest\\r\n* writing assignments on aspects of subject teaching and Professional Studies\\r\n\\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\\r\n\\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.",
    "CourseLength": "OneYear",
    "Qualifications": "We would normally expect you to have a 1st, 2:1 or 2:2 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject that you intend to teach.  You will also need to have achieved  Grade 4 (or C) or above in GCSE Mathematics and English Language or equivalent qualifications. \\r\n\\r\nYou will also be required to pass the QTS skills tests in numeracy and literacy.",
    "FeeInternational": 16045.0,
    "HowSchoolPlacementsWork": "Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\\r\n\\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\\r\n\\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\\r\n\\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\\r\n\\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\\r\n\\r\n* observation of other teachers\\r\n* planning and teaching parts of lessons/small groups\\r\n* planning and teaching lessons and sequences of lessons\\r\n* reflecting on and evaluating your teaching\\r\n* receiving feedback on your teaching\\r\n* gaining experience of the range of responsibilities of classroom teachers"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are leaders in Initial Teacher Education, consistently graded as outstanding in all areas by [Ofsted](https://files.api.beta.ofsted.gov.uk/v1/file/2739445) and ranked 3rd amongst university providers of teacher training in the most recent Good Teacher Training Guide (2017).\\r\n\\r\nOur latest Department for Education statistics (from the 2016 –17 cohort) show that 91% of our PGCE trainees who achieved Qualified Teacher Status secured a teaching post within six months of completion. Of the trainees who completed the course in 2017-18, over 70% were rated as outstanding. \\r\n\\r\nWe have strong partnerships with over 250 schools in the south west where you will spend two-thirds of your training year, putting into practice what you have learnt on the taught course. Our PGCE is uniquely characterised by innovative research-led teaching informed by professional practice and academic excellence. All our tutors have real-world experience as teachers, senior managers or OFSTED inspectors. They lead and innovate, developing the latest ideas in teacher education, leading research, writing textbooks, leading subject networks and advising government.\\r\n\\r\nWe provide unrivalled opportunities for trainees to achieve through our highly original PGCE teaching model ‘The Exeter Model’, praised by OFSTED and cited as an example of best practice. By learning on campus for most of the first term, you access the tools to rapidly build professional knowledge to underpin your work in school placements.\\r\n\\r\nOur unique approach gives you opportunities to become part of a community of trainees and teachers who are passionate about education and will support you during your course and beyond.\\r\n",
    "TrainWithDisability": "The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy.\\r\n\\r\nFor further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\\r\n\\r\nPGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\\r\n\\r\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
