{
  "locationType": "School",
  "accrediting": "Bradford College",
  "provider": "Abbey MAT Primary Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "2DQ/3272",
  "providerCode": "2DQ",
  "programmeCode": "3272",
  "schools": [
    {
      "name": "St.Chad's CE Primary",
      "address": "Northolme Avenue, West Yorkshire, LS16 5QR",
      "code": "M"
    }
  ],
  "addresses": [
    {
      "address": "Northolme Avenue, West Yorkshire, LS16 5QR",
      "geocode": true,
      "formatted_address": "Northolme Ave, Leeds LS16 5QR, UK",
      "latitude": 53.8322061,
      "longitude": -1.5970424,
      "post_code": "LS16 5QR",
      "city": "West Yorkshire",
      "route": "Northolme Avenue",
      "postal_town": "Leeds"
    }
  ],
  "providerAddress": {
    "inst_code": "2DQ",
    "addr_1": "Northolme Avenue",
    "addr_2": "West Park",
    "addr_3": null,
    "addr_4": "Leeds",
    "postcode": "LS16 5QR",
    "url": null,
    "geocode": true,
    "formatted_address": "Northolme Ave, Leeds LS16 5JB, UK",
    "latitude": 53.8322061,
    "longitude": -1.5970424,
    "post_code": "LS16 5JB",
    "city": "West Yorkshire",
    "route": "Northolme Avenue",
    "postal_town": "Leeds"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The Abbey MAT Primary Alliance programme is a collaborative programme offering 150 days experience in schools, 10 core days receiving school based training across our alliance schools, and a further 15 core days at Bradford College.  A strength of the course is the way in which theory and practice are related as a result of extensive time spent working with children in two placement schools.\\r\n\\r\nUpon graduating from the programme, you will gain a Postgraduate Certificate in Education (with QTS) and a number of Masters level credits to ensure you will have the best possible start to your teaching career. \\r\n\\r\nOur teaching placements are based in schools across our alliance, in a range of differing contexts and are enhanced by additional enrichment placements and training.\\r\n\\r\nTrainees will have the support of highly trained school- based professional mentors and a designated link-tutor from Bradford College, who will design a highly bespoke programme, tailored to meet trainees’ needs.\\r\n\\r\nThree assessed modules are covered, each worth 20 Credit points at masters level.  These are:\\r\n\\r\nModule 1: Theories That Underpin Teaching and Learning\\r\nModule 2: Teaching, Learning and Assessment\\r\nModule 3: Educational Philosophy and Vision.\\r\n\\r\nThe majority of sessions are taught in groups, although individual tutorial sessions and whole cohort learning approaches are also utilised to develop knowledge and understanding of the full range of the curriculum. A number of sessions will consider activities that may be carried out in the classroom, on a particular theme, with discussions of related curricular and pedagogical issues.\\r\n\\r\nThe course is designed to make strong links between study and reflection in College and work in school.\\r\n\\r\nThis course is intensive and demanding, taking into account the high level of independent study expected of our postgraduate students undertaking both a professional qualification and work at Masters level.\\r\n\\r\nYour work in College is continuously assessed. At present, formal assessment includes three assignments, one of which is in the form of a presentation and related work. Your work in school is assessed by Bradford College tutors and trained mentors. This assessment is modelled against the national standards for Qualified Teacher Status, as stated by the NCTL (National College for Teaching and Leadership).\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "You will normally need:\\r\n* GCSE qualifications at grade 4 or above, or grade C if awarded under the previous GCSE grading scheme in English, Maths and Science.\\r\n* An Honours degree classified as 2:2 or above \\r\n* Skills tests in Numeracy and Literacy.\\r\n* Enhanced disclosure from the Disclosure and Barring Service.\\r\n",
    "InterviewProcess": "We love welcoming visitors to our alliance schools and we aim to make our interview process a positive experience for all. We realise that making the right choice of training route and provider is as important to candidates as it is for us to select the very best potential.\\r\n\\r\nInterviews take place each month once the application cycle is open. \\r\nThe first stage of the interview process typically includes:\\r\n*  An applicants’ briefing and tour of the school\\r\n*  A class-based assessment; during this counterpart, you will be asked to prepare a 20 minute activity to undertake with a group of children from a year group of your choice.\\r\n* A group task; during this activity you will take part in a group discussion.\\r\n* A written task; during this activity you will be expected to write a short piece of text to display your written communication skills. \\r\n* A maths task; during this activity you will be expected to undertake a KS2 maths paper to demonstrate your ability to reason and problem solve.\\r\n\\r\nIf you are selected to progress to the second interview stage, this consists of an interview with a panel of alliance representatives; during this activity you will be interviewed as to your suitability for the position on the School Direct Programme and will be given the opportunity to ask any further questions you may have about the course.\\r\n\\r\n",
    "OtherRequirements": "In addition to the entry requirement above, we also advise that you spend some time gaining experience in a primary school in Key Stage 1 and 2 to give you a greater insight into your career choice and help you decide whether teaching is right for you. You must have a minimum of 20 days school based experience to be considered for the programme.  Other areas of relevant experience may also support your application.",
    "HowSchoolPlacementsWork": "The school within which you are based will depend on availability of places; we will wherever possible take into account the distance from your address to the school you are allocated.  \\r\nYou will be asked to select the age range you would prefer to teach (5-7 or 7-11).\\r\nThe course  consists of three main placements, in two contrasting settings and primary age phases, but there are also a number of additional experiences offered, including opportunities to experience  specialist SEND settings and secondary provision."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "St.Chad’s CE Primary is the Lead School of five schools working in partnership with Bradford College to provide high quality training for School Direct applicants from September 2016. The group of schools, known as the Abbey MAT Primary Alliance, is made up of Hawksworth CE Primary School, Manston St James CE Primary, St.Chad’s CE Primary, , St.Peter’s CE Junior,Infant & Early Years School and Holy Trinity Rothwell CE Primary.\\r\nThe Abbey MAT Primary Alliance has the great strength of diversity in its makeup. The five primary schools are different in size, cultural background and socio-economic profile providing our trainee students with a varied and valuable training experience. By training in schools with such contrasting intakes of children your professional development will be accelerated, improving and widening your professional options as a teacher. \\r\nThe collective resources of the Abbey MAT Primary Alliance are used to benefit the trainees. Schools with an area of outstanding practice lead enhancement training days; during the day all the trainees in the alliance meet together at one of the schools for school based training involving children and the school staff.\\r\nAll of the schools have experienced and committed school mentors to support the professional training of School Direct trainees who are seen as part of the school team. The ethos of the alliance is one of mutual support and development with a very positive approach to teacher training; we believe we can work in partnership to educate, nurture and empower.\\r\n\\r\n",
    "TrainWithDisability": "We work in close partnership with Bradford College to ensure that we accommodate the needs of all learners. Please contact us if you would like to discuss how we can support you.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Bradford College has a proven track record of recruiting and training high quality candidates for their teacher training courses and of securing successful employment at the end of training. Experienced link tutors effectively support trainees throughout their year and work closely in partnership with the alliance to the benefit of trainees.",
        "UcasInstitutionCode": "B60"
      }
    ]
  },
  "has_inst": true
}
