{
  "locationType": "University",
  "accrediting": null,
  "provider": "The University of Reading",
  "subjects": [
    "Mathematics",
    "Secondary"
  ],
  "name": "Mathematics",
  "slug": "R12/G1X1",
  "providerCode": "R12",
  "programmeCode": "G1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "R12",
    "addr_1": "Admissions Office",
    "addr_2": "Miller Building",
    "addr_3": "Whiteknights",
    "addr_4": "Reading",
    "postcode": "RG6 6AB ",
    "url": "http://www.reading.ac.uk",
    "geocode": true,
    "formatted_address": "Miller Building, Earley, Reading RG6, UK",
    "latitude": 51.4393572,
    "longitude": -0.9469907999999999,
    "post_code": "RG6",
    "city": "Earley",
    "route": null,
    "postal_town": "Reading"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The PGCE Secondary course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable trainees to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. All trainees undertaking the University-led PGCE route into teaching will work towards securing 60 Master’s level credits. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. Trainees on the PGCE Secondary programme will be well supported in becoming critically reflective teachers capable of inspiring their pupils to learn, achieve and flourish.\\r\n\\r\nAt the University of Hertfordshire, trainees will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for trainees to learn about pedagogical approaches relevant to their subject specialism and the professional responsibilities of all teachers.\\r\n\\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT).",
    "CourseLength": "OneYear",
    "Qualifications": "Honours degree (2.2 or higher), awarded by a UK university or an overseas award recognised as equivalent by NARIC.\\r\n\\r\nUsually we would expect the degree to have a minimum 50% content of the subject in which the applicant is applying. However, applicants whose degree does not meet this requirement should contact us to discuss further.\\r\n\\r\nEnglish Language and mathematics GCSE  grade 4 or above (grade C under the old grading structure).\\r\n\\r\nStudents from non-majority English speaking countries require proof of English language proficiency, equivalent to an overall IELTS Academic score of 6.5 with a minimum of 6.0 in each band. ",
    "InterviewProcess": "Suitability to train to teach is assessed at interview. \\r\n\\r\nWe are looking to select trainees who:\\r\n\\r\n* have the passion, commitment and enthusiasm to teach in secondary schools\\r\n* are resilient and able to work under pressure\\r\n* have good subject knowledge to train to teach in the area they are interested in\\r\n\\r\nThe day will begin with a talk about the PGCE programme and is followed by you completing a short written task. You will then lead a short lesson in your subject discipline, details will be sent with the letter inviting you to interview. Finally there is an individual interview.\\r\n\\r\n",
    "OtherRequirements": "You will be required to pass the [Professional Skills tests](http://sta.education.gov.uk/) in literacy and numeracy before starting the course.\\r\n\\r\nYou will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\\r\n\\r\nWe recommend that you undertake observation time in a state secondary school prior to interview but this is not essential. [Activities to support observation in school - either before or after interview - that you may find useful](https://www.herts.ac.uk/__data/assets/pdf_file/0006/164436/Secondary-School-experience-tasks.pdf)\\r\n\\r\n",
    "PersonalQualities": "Through the application and interview process, you will need to demonstrate your passion for teaching and potential to lead learning. Excellent interpersonal and communication skills are vital in classrooms of today alongside the ability to be organised, adaptable and resilient. As a successful candidate you will be able to provide evidence of empathy, respect and an inclusive attitude. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Institute of Education is an established provider of high-quality training and research in education. In the latest national assessment, 80% of our research outputs were rated world leading or internationally excellent, positively impacting educational policy and practice. The University has also been ranked in the top 150 in the world for Education. * \\r\n\\r\nWe offer a BA in education Studies, MA in education studies and a range of teacher training courses in primary, secondary and early years.  At the Institute of Education we have the research, the expertise and the passion to help others grow into engaged and active citizens; individuals with resilience and the confidence to tackle challenges.  \\r\n\\r\nThe Institute of Education is a community and the impact of our research and the breadth of our experience feeds directly into everything we do and the world around us. Our networks and the impact of our work are both local and global. Locally, we have well-established partnerships with over 300 schools, who we work closely with to train the next generation of outstanding teachers. Globally, our research, consultancy and other projects extend to countries as varied as China, Jamaica, the USA and Singapore. For more on our programmes visit: (https://www.reading.ac.uk/education/) \\r\n\\r\n*QS World Rankings by subject 2018\\r\n \\r\n",
    "TrainWithDisability": "The University of Reading welcomes disabled students and has a dedicated Disability Advisory Service. The service offers advice and guidance to students with any disability, mental health condition, or specific learning difficulty (SpLD).\\r\n\\r\nIf you are unsure whether you wish to disclose your disability on your application, you can discuss the implications of a disclosure in complete confidence, with one of our disability advisers.\\r\n\\r\nWe offer support, advice and guidance with:\\r\n\\r\n- physical disabilities e.g. mobility\\r\n- sensory disabilities e.g. visual impairments\\r\n- mental health difficulties e.g. anxiety\\r\n- medical conditions e.g. Irritable Bowel Syndrome, diabetes, autism/Asperger Syndrome\\r\n- SpLDs e.g. dyslexia, dyspraxia \\r\n\\r\nThe Disability Advisory Service may be able to assist in study related support in the following ways:\\r\n- assessing the impact of your disability  on your studies and recommend any reasonable adjustments required\\r\n- provide information on funding for study support, including the Disabled Students Allowance.\\r\n- Liaise with your Department including Senior Tutors and Disability Representative on reasonable adjustments, including extensions to deadlines and alternative modes of assessment where appropriate.\\r\n- Flag students (with permission) in order that tutors are made aware of individual requirements.\\r\n- The Disability Advisory Service can provide assistance on arranging non- medical helpers e.g. one to one support arrangements such as mentors and specialist study skills.\\r\n- Liaising with the exams office re special exam arrangements\\r\n- Referral and signposting to other services\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
