{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of Southampton",
  "subjects": [
    "Mathematics",
    "Physics",
    "Science",
    "Secondary"
  ],
  "name": "Physics with Mathematics",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "S27/F3GX",
  "providerCode": "S27",
  "programmeCode": "F3GX",
  "schools": [
    {
      "name": "Main Site",
      "address": "",
      "code": ""
    }
  ],
  "addresses": [
    null
  ],
  "providerAddress": {
    "inst_code": "S27",
    "addr_1": "Highfield",
    "addr_2": null,
    "addr_3": "Southampton",
    "addr_4": null,
    "postcode": "SO17 1BJ",
    "url": "http://www.southampton.ac.uk/education/postgraduate/itt.page",
    "geocode": true,
    "formatted_address": "Highfield, Southampton SO17 3RU, UK",
    "latitude": 50.93261099999999,
    "longitude": -1.390369,
    "post_code": "SO17 3RU",
    "city": "Highfield",
    "route": null,
    "postal_town": "Southampton"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Tuition fees for the 2019/20 academic year are yet to be confirmed.\\r\n\\r\nAs an indication of what you might pay, the fee for students who started in September 2018 was:\\r\n•\\t£9,250\\r\n\\r\nPGCE students can apply for loans from Student Finance England and may be entitled to a tax-free bursary -https://getintoteaching.education.gov.uk/funding-and-salary/overview\\r\n\\r\nFind out more about scholarships and funding on our website - https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts\\r\n\\r\n",
    "AboutCourse": "The PGCE Secondary Science programme aims to:\\r\n•\\tdevelop your understanding of the role of Science teachers both within the department and in their wider professional responsibilities;\\r\n\\r\n•\\tintroduce you to current theories and practice in Science teaching;\\r\n\\r\n•\\thelp develop your academic and critical thinking skills to support effective Science teaching and learning for all your students;\\r\n\\r\n•\\thelp you set high expectations for yourself and your students; and\\r\n\\r\n•\\thelp you to understand what contribution Science education can make to the wider education of young people.\\r\n\\r\nThe Science course supports the core PGCE Teacher Development Course, through:\\r\n•\\tSpecialist sessions to develop your curriculum subject knowledge;\\r\n\\r\n•\\tExploring effective teaching and learning in Science classrooms;\\r\n\\r\n•\\tConsideration of the role of practical work and your responsibility for safe classroom practice;\\r\n\\r\n•\\tDeveloping reflective practice to support your planning, delivery and evaluation of lessons; and\\r\n\\r\n•\\tDeveloping an understanding of recent curriculum change.\\r\n\\r\nA field course in October supports team building for collaborative work, helps develop subject knowledge across the sciences and a practical understanding of learning outside the classroom.\\r\n\\r\nMixed teams and whole science sessions will include focus on:\\r\n•\\tThe science curriculum\\r\n\\r\n•\\tLesson planning\\r\n\\r\n•\\tBehaviour for learning and classroom management\\r\n\\r\n•\\tAssessment\\r\n\\r\n•\\tLiteracy and numeracy in science\\r\n\\r\n•\\tDifferentiation and inclusion\\r\n\\r\n•\\tEarth science\\r\n\\r\n•\\tICT in science, including data logging\\r\n\\r\n•\\tTeaching controversial issues in Science\\r\n\\r\n•\\tThe Nature of Science\\r\n\\r\n•\\tScience outside the classroom\\r\n\\r\n•\\tSafety issues and risk assessment\\r\n\\r\n•\\tClassroom practice related to learning theories\\r\n\\r\n•\\tDemonstrations and practicals\\r\n\\r\nContinuous assessment is used throughout the course and there are no examinations.\\r\n\\r\nApplications are welcome from students with good/very good qualifications in their science qualifications at GCSE and AS/A level Physics (or equivalent) and Physics or Engineering (or equivalent) at honours degree level. \\r\n\\r\nThose candidates with a Physics degree might wish to consider whether our Physics or Physics with Mathematics specialism might be most appropriate. Although Physics with Mathematics students will spend some time working with our Maths colleagues and will engage in some Mathematics teaching during placements, we expect applicants to be able to make clear links to Biology and Chemistry and be reasonably flexible by teaching across all the main sciences to GCSE level.  \\r\n\\r\nApplicants without Biology or Chemistry at AS/A level would be expected to undertake some background reading before the start of the course. ",
    "CourseLength": "OneYear",
    "Qualifications": "•\\t2:1 degree for English, Geography, History or Social Science\\r\n•\\t2:2 degree for Mathematics, MFL, Sciences or RE\\r\n(We may, under exceptional circumstances, accept a Third if there are \\r\nother very strong recommending features in your application.)\\r\n\\r\n•\\tGCSE Grade 4 (old grade C) or above in English Language and Maths (equivalency test available if needed)\\r\n\\r\n•\\tA-levels (or equivalent) in relevant subjects\\r\n\\r\n•\\tAlthough not essential, you may find it useful to have recent experience working with children and/or observing teaching in a school setting.\\r\n\\r\n•\\tA pass in the Professional Skills Tests in literacy and numeracy\\r\n",
    "FeeInternational": 15405.0,
    "InterviewProcess": "If invited for interview, you will meet members of the course team who will give an overview of the course and answer any questions you may have. \\r\n\\r\nYou will participate in a group task with candidates from a range of subjects and give a brief presentation as part of a small group. \\r\n\\r\nSubject tutors will introduce a written subject task that you will complete during the day and you will have an individual interview with a subject tutor. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.",
    "OtherRequirements": "Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\\r\n\\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\\r\n\\r\nEnglish Language Requirements - you must have a GCSE Grade 4 (old grade C) in English Language. \\r\n\\r\n\\r\nWe offer an equivalency test in English and/or Mathematics for any successful applicant who does not hold this qualification or an equivalent one.  \\r\n",
    "PersonalQualities": "We are interested in candidates showing enthusiasm for their science and mathematics in a variety of ways, for example, by their reading, leisure pursuits, attendance at local/national Science events. \\r\n\\r\nWe also expect a reasonable level of awareness of major recent and current issues in education and developments in science. \\r\n\\r\nThe Secondary PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills also include the ability to form relationships,  good communication skills, a commitment to learning and teaching and reflective qualities. \\r\n",
    "HowSchoolPlacementsWork": "You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with learners from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\\r\n\\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\\r\nPhase A.  In planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \\r\n\\r\nPhase A\\r\nAfter induction you will spend about 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you. \\r\n\\r\nPhase B\\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Our Initial Teacher Education department is a dynamic and thriving community of professional educators and researchers. In AY2017-2018 Southampton Education School was ranked 2nd in the Guardian University League Table.\\r\n\\r\nWhy come to Southampton?\\r\n\\r\n* Our Tutors. In every forum the dedication and commitment of our Tutors is praised. Trainee Teachers rate them extremely highly, External Examiners praise the time and effort that Tutors devote to Trainees and Ofsted recognises the ‘high quality mentoring and support’ offered. \\r\n* Our quality of teaching and our diverse partnerships and placements. Our Tutors are all Teachers. We thrive through continuous professional development – and very much enjoy implementing new research or theories in partnership with Trainee Teachers and the Schools that we work with. Our Partner Schools are key to our success, and the Mentors that we work are experienced, dedicated and enthusiastic. \\r\n* Our commitment to Health and Wellbeing. The health and wellbeing of our Trainee Teachers, and the students that they teach, is central to producing outstanding teachers and happy students who can make progress and succeed.\\r\n* Our scope to personalise and individualise your learning on your Programme. Every Trainee Teacher is unique, and we want each and every trainee to be the very best teacher that they can be. We achieve this by personalising our programmes to suit you.\\r\n* Our commitment to ‘Student Voice’. We actively encourage trainees to work with us to make our courses even better. \\r\n* Employability. Almost 100% of our Trainee Teachers get jobs. \\r\n",
    "TrainWithDisability": "At Southampton we welcome applications from candidates with disabilities and other needs. SEND is a very important element of our training throughout the PGCE, and trainees who have personal experiences of SEND are of real benefit to our programmes, as they bring a wealth of experience.\\r\n\\r\nHow are Trainee Teachers with disabilities and other needs supported?\\r\n\\r\n* Trainees with dyslexia meet together at the start of the course for an informal session, led by a tutor with significant SEND experience. This group is then enabled to support one another throughout the course, with individual, personalised, input from the tutor as required.\\r\n* Trainees with Physical Disabilities are always accommodated as appropriate and a wide variety of modifications are available.  For example, a student with a hearing impairment may be supported by our enabling services, as well as by their Personal Academic Tutor with services such as remote transcription available - we work with individuals to ensure that their needs are met both when in University and when teaching in schools.\\r\n* We recognise that teaching can be stressful. The University offers a variety of services for Trainees who may be suffering from anxiety or depression, for example trainees can access talking therapies via the University Enabling Services. Trainees are also encouraged to make full use of their Personal Academic Tutor.\\r\n* The course team are able to personalise many aspects of the programme, to accommodate need on an individual basis, to enable successful completion of the course.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
