{
  "locationType": "School",
  "accrediting": null,
  "provider": "South West Teacher Training",
  "subjects": [
    "French",
    "Languages",
    "Languages (european)",
    "Secondary"
  ],
  "name": "Modern Languages (French)",
  "slug": "S66/R1X1",
  "providerCode": "S66",
  "programmeCode": "R1X1",
  "schools": [
    {
      "name": "Main Site",
      "address": "South West Teacher Training, WETC, Hatherleigh Road, EXETER, EX2 9JU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "South West Teacher Training, WETC, Hatherleigh Road, EXETER, EX2 9JU",
      "geocode": true,
      "formatted_address": "West Exe School, Hatherleigh Rd, Exeter EX2 9JU, UK",
      "latitude": 50.7066379,
      "longitude": -3.5399153,
      "post_code": "EX2 9JU",
      "city": "Devon",
      "route": "Hatherleigh Road",
      "postal_town": "Exeter"
    }
  ],
  "providerAddress": {
    "inst_code": "S66",
    "addr_1": "West Exe School",
    "addr_2": "Hatherleigh Road",
    "addr_3": "Exeter",
    "addr_4": "Devon",
    "postcode": "EX2 9JU ",
    "url": "http://www.swtt.net",
    "geocode": true,
    "formatted_address": "Hatherleigh Road, Exeter EX2 9JU, United Kingdom",
    "latitude": 50.7066379,
    "longitude": -3.5399153,
    "post_code": "EX2 9JU",
    "city": null,
    "route": null,
    "postal_town": "Exeter"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The PGCE Secondary course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable trainees to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. All trainees undertaking the University-led PGCE route into teaching will work towards securing 60 Master’s level credits. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. Trainees on the PGCE Secondary programme will be well supported in becoming critically reflective teachers capable of inspiring their pupils to learn, achieve and flourish.\\r\n\\r\nAt the University of Hertfordshire, trainees will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for trainees to learn about pedagogical approaches relevant to their subject specialism and the professional responsibilities of all teachers.\\r\n\\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT).",
    "CourseLength": "OneYear",
    "Qualifications": "Honours degree (2.2 or higher), awarded by a UK university or an overseas award recognised as equivalent by NARIC.\\r\n\\r\nUsually we would expect the degree to have a minimum 50% content of the subject in which the applicant is applying. However, applicants whose degree does not meet this requirement should contact us to discuss further.\\r\n\\r\nEnglish Language and mathematics GCSE  grade 4 or above (grade C under the old grading structure).\\r\n\\r\nStudents from non-majority English speaking countries require proof of English language proficiency, equivalent to an overall IELTS Academic score of 6.5 with a minimum of 6.0 in each band. ",
    "InterviewProcess": "Suitability to train to teach is assessed at interview. \\r\n\\r\nWe are looking to select trainees who:\\r\n\\r\n* have the passion, commitment and enthusiasm to teach in secondary schools\\r\n* are resilient and able to work under pressure\\r\n* have good subject knowledge to train to teach in the area they are interested in\\r\n\\r\nThe day will begin with a talk about the PGCE programme and is followed by you completing a short written task. You will then lead a short lesson in your subject discipline, details will be sent with the letter inviting you to interview. Finally there is an individual interview.\\r\n\\r\n",
    "OtherRequirements": "You will be required to pass the [Professional Skills tests](http://sta.education.gov.uk/) in literacy and numeracy before starting the course.\\r\n\\r\nYou will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\\r\n\\r\nWe recommend that you undertake observation time in a state secondary school prior to interview but this is not essential. [Activities to support observation in school - either before or after interview - that you may find useful](https://www.herts.ac.uk/__data/assets/pdf_file/0006/164436/Secondary-School-experience-tasks.pdf)\\r\n\\r\n",
    "PersonalQualities": "Through the application and interview process, you will need to demonstrate your passion for teaching and potential to lead learning. Excellent interpersonal and communication skills are vital in classrooms of today alongside the ability to be organised, adaptable and resilient. As a successful candidate you will be able to provide evidence of empathy, respect and an inclusive attitude. "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "South West Teacher Training is based at West Exe School, part of the highly successful Ted Wragg Multi-Academy Trust. We are situated in Exeter, placing our trainees in a partnership of schools across Exeter, Plymouth and in rural and coastal schools throughout Devon, Somerset and Cornwall. We match individual trainees to schools that suit their skills and location.\\r\n\\r\nWe work with Bath Spa University who provide our PGCE, an Ofsted rated Outstanding provider. They offer a balanced programme of academic excellence alongside school-based training. Bath Spa tutors visit our Exeter site, providing one-to-one tutorials. \\r\n\\r\nWe work with Exeter Consortium Teaching Schools Alliance and the Ted Wragg Multi-Academy Trust, who themselves work with Exeter University and Exeter College. We offer a programme of study that links our Secondary and Primary teacher training models, giving our Secondary trainees an enviable insight into the workings of Primary education, an aspect that future employers find attractive and distinctive to our route. The programme is taught by leading practitioners from within our partnership, who provide thoughtful training sessions rooted in educational theory and current classroom practice. \\r\n\\r\nSubject Mentors offer one-to-one support throughout the school-based training and this is mirrored by a team of Subject Course Tutors. Our trainees begin teaching in staged steps from their first weeks, integrating academic study with classroom practice. Our trainees say they value our truly school-centred route as it places them in a school setting swiftly, yet allows them to build their teaching skills gradually. Visit www.swtt.net to learn more.\\r\n",
    "TrainWithDisability": "At South West Teacher Training we have a long history of accommodating trainees with a wide range of disabilities and other needs. Our training programme emphasises the need for trainees to manage their own pace of learning. Trainee well-being is at the heart of our vision for creating resilient teachers capable of managing their workload.\\r\n\\r\nTo that end, in the past we have successfully trained teachers who have learned strategies to manage their dyslexia, colour-blindness as well as mobility issues whilst meeting the demands of classroom practice. Trainees are asked to discuss their needs during a health check before starting the course and this information is swiftly communicated to the course team.\\r\n\\r\nOur partnership work with Bath Spa University is designed to support trainees with a range of needs and we have a differentiated programme of support tutorials, offering our trainees the help and guidance they need as individuals.\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
