{
  "locationType": "School",
  "accrediting": "University of Leicester",
  "provider": "North Charnwood Learning Partnership",
  "subjects": [
    "Secondary",
    "Social sciences"
  ],
  "name": "Social Sciences",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "1KB/26TZ",
  "providerCode": "1KB",
  "programmeCode": "26TZ",
  "schools": [
    {
      "name": "Main Site",
      "address": "Bridge Street, Loughborough, LE11 1NH",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Bridge Street, Loughborough, LE11 1NH",
      "geocode": true,
      "formatted_address": "Bridge St, Loughborough LE11 1NH, UK",
      "latitude": 52.7746789,
      "longitude": -1.207377,
      "post_code": "LE11 1NH",
      "city": "Leicestershire",
      "route": "Bridge Street",
      "postal_town": "Loughborough"
    }
  ],
  "providerAddress": {
    "inst_code": "1KB",
    "addr_1": "Bridge Street",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Loughborough",
    "postcode": "LE11 1NH",
    "url": null,
    "geocode": true,
    "formatted_address": "Bridge St, Loughborough LE11 1NQ, UK",
    "latitude": 52.7746856,
    "longitude": -1.2083131,
    "post_code": "LE11 1NQ",
    "city": "Leicestershire",
    "route": "Bridge Street",
    "postal_town": "Loughborough"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Based in and around the University town of Loughborough, North Charnwood Learning Partnership (NCLP) School Direct is a highly successful teacher training programme.  We are rightly proud of the excellent quality of the training which we provide in collaboration with The University of Leicester.  Our previous trainees, who have successfully gained a place onto our NCLP School Direct programme, have a 100% pass rate at a high standard.  In addition, 100% of our trainees who apply for a teaching post have been successful.\\r\n\\r\nNCLP trainees will spend the majority of the programme on placement within two of our Secondary schools teaching students across the 11-18 age range. The programme also incorporates a one week attachment in a Primary school to give an invaluable insight into pupils’ prior school experience. \\r\n\\r\nThe initial weeks of the programme will be spent in The University of Leicester’s School of Education receiving a grounding in the teaching skills that will be used and developed on the school placements.  Following this, trainees begin the first of their two substantial school placements at NCLP schools.\\r\n\\r\nThroughout the programme trainees will meet on a weekly basis with all other NCLP trainees on our excellent professional development sessions to develop key skills and share experiences.\\r\n\\r\nThese are run by outstanding practitioners on subjects such as special needs, the more able and behaviour management techniques.  Our previous trainees speak very highly of these sessions as a particular strength of the NCLP programme.\\r\n\\r\nContinuous assessment is used throughout the training programme and there are no examination papers set by the University. \\r\n\\r\nSuccessful completion of the course leads to either the Post Graduate Certificate in Education and 90 credits at Masters level awarded by the University of Leicester and Qualified Teacher Status awarded by NCTL or the Professional Graduate Certificate in Education awarded by the University of Leicester and Qualified Teacher Status awarded by NCTL. These awards are for trainees who:\\r\n•\\tfollow the course satisfactorily by attendance, participation and completion of set work \\r\n•\\treach pass standard both in written assignments and in practical teaching \\r\n•\\tdemonstrate that they have met all three Assessment Areas and Teachers' Standards laid down by NCTL.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "Minimum degree required: Upper Second \\r\n\\r\n As a guideline, Psychology or Sociology should have comprised at least 50% of the degree course and/or have been successfully studied at GCE Advanced level or in a further degree. In exceptional circumstances we accept applicants whose degree does not meet these general guidelines. We look at each individual case on its merits; you may therefore wish to make out a case for the relevance of your degree on your application form, and should be able to do so if required at interview. \\r\n\\r\n\\r\n",
    "InterviewProcess": "NCLP School Direct is an exceptionally supportive training programme of the highest quality and this begins with the interview day.  The overwhelming majority of candidates speak of the day as a challenging but enjoyable experience.  The interview process is designed to enable potential trainees to be able to present themselves at their best whilst also being able to see the lead school during a typical day and get a feel for the ethos that underpins our work - “Achievement in a Caring Environment”.  The NCLP interview day includes:\\r\n•\\tAn opportunity to observe and discuss a lesson in your subject \\r\n•\\tAn interview with a pupil panel, selected from the school council\\r\n•\\tA pre-prepared presentation activity \\r\n•\\tA formal interview\\r\n\\r\nSuccessful candidates then attend a second interview day with The University of Leicester.  At the University you will participate in a small group discussion and presentation activity with candidates from a range of subjects. The day will also involve:\\r\n•\\tAn individual interview with the University Subject Tutor(s) and visiting teacher(s). You will be encouraged to demonstrate commitment to your subject, to reflect on relevant previous experience, and expand upon the skills, knowledge, experiences and aptitude that you can bring to your training. \\r\n•\\tA short subject specific written task which is designed to explore aspects of your subject knowledge and the quality of your expression.\\r\n* Successful applicants will need to pass the QTS skills tests in Numeracy and Literacy prior to commencing the course.\\r\n",
    "OtherRequirements": "We are initially looking for evidence across a range of areas, such as: \\r\n•\\tExperience (paid or voluntary) in maintained schools or educational-related settings,   or in wider working with children or young people \\r\n•\\tA personal statement which shows an ability to reflect on this experience \\r\n•\\tAn awareness of contemporary issues both generally in education and subject specific\\r\n•\\tTwo references that substantiate performance to date and indicate potential (if you are an undergraduate please be advised that one of your referees should be able to comment on your predicted degree class)\\r\n",
    "PersonalQualities": "Ability to form relationships: \\r\n\\r\nDeveloping positive relationships with both young people and adults lies at the heart of effective teaching. \\r\nGood communication skills:\\r\nBe able to present appropriately in small and large group situations with both adults and young people, both orally and in written communication.\\r\nCommitment to learning and teaching:\\r\nBe a positive role model who makes young people's learning the first concern.  Be able to understand the position of trust which this role places them in. \\r\n\\r\nReflective qualities:\\r\n\\r\nBe able to analyse and reflect upon experiences. \\r\n\\r\nAwareness of contemporary issues in education:\\r\n\\r\nA commitment to on-going professional development.  \\r\n\\r\n",
    "HowSchoolPlacementsWork": "NCLP trainees will spend the majority of the programme on placement within two of our Secondary schools, teaching students from across the 11-18 age range and from diverse contexts.  This diversity may be with regards to the ethnicity of the school population or because of the socio-economic background of the students who attend the schools.  These placements will be in two of our eight partnership schools within the Loughborough and North Charnwood area:\\r\n•\\tThe Phase A placement in the Autumn Term is a 9 week teaching practice at the first NCLP school. \\r\n•\\tThere will be followed by a reflective period at the University between the two school placements to further develop teaching skills. \\r\n•\\tThe Phase B placement in the Spring and Summer Terms is a 12 week teaching practice at a second NCLP school. \\r\n\\r\nOverseeing and supporting you throughout your Phase A and B placements will be your school subject mentors.  Good or outstanding practitioners themselves, your mentors will provide you with support and close monitoring and guidance.\\r\n\\r\nA senior member of staff, the Initial Teacher Training Co-ordinator, holds overall responsibility in school for the training of trainee teachers and again these are excellent practitioners with a wealth of experience to oversee your school experience.\\r\n\\r\nIn addition to this support, the NCLP team is always available to provide guidance and help throughout the programme.\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Based in and around the University town of Loughborough, we are delighted that you are considering training to teach Secondary students with the highly successful North Charnwood Learning Partnership (NCLP) School Direct Programme.  We work in close partnership with our 7 schools and also the University of Leicester and Loughborough University to ensure the highest quality training for our trainees.\\r\n\\r\nWe have a strong track record of training and developing excellent teachers across Key Stages 3-5 and are proud that the trainees who are successful in gaining a place to train with us have a 100% pass rate at a high standard.  In addition, 100% of our trainees who apply for a teaching post have been successful.\\r\n \\r\nOur trainees complete two teaching placements covering all secondary ages from years 7-13.  Trainees especially value our high-quality professional development programme, run by outstanding teachers, held weekly within the NCLP schools throughout each school placement.  \\r\n\\r\nWhat our trainees say about us: \"The most important part of your training year is the support you get and Claire and Charlotte at NCLP will pass it on in spades.  Ask for advice and the support you need will be there\".\\r\n\\r\nWhat the University of Leicester says about us: We \"have always been impressed by the commitment, professionalism and support the team at NCLP have shown for their student teachers from the minute they receive an application to the first post within the profession\".\\r\n\\r\nWe look forward to hearing from you.",
    "TrainWithDisability": "NCLP School Direct, the University of Leicester and Loughborough University are all committed to Equal Opportunities for all students and potential students, and support is available for candidates for whom tasks might present a challenge. Potential applicants for whom this may be a consideration are advised to contact NCLP or the University Secondary PGCE team in advance.\\r\n\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We work in close collaboration with the University of Leicester for many of our subjects and trainees gain 90 Masters credits when they complete the School Direct programme.  The University highlights the following strengths of their training: “Statistics in recent years show that 96% of our trainees have secured teaching posts immediately on qualifying. Over 60% of those are working in schools and colleges in Leicester and Leicestershire and 83% work in the Midlands. Many of our former trainees now have posts of responsibility in schools and now work as subject leaders, senior managers and head teachers.”",
        "UcasInstitutionCode": "L34"
      },
      {
        "Description": "We work in close collaboration with Loughborough University for our PE programme and students gain 90 Masters credits when they complete their School Direct programme.  The University highlights the following strengths of their training: \"The University has a strong tradition of teacher education and a history of successfully producing teachers who are in great demand by schools and colleges in the UK and overseas.  Our courses have been highly rated in Ofsted inspections and Loughborough has been assessed as a category ‘A’ provider, representing ‘outstanding’ provision, three consecutive times since 2005.\"",
        "UcasInstitutionCode": "L79"
      }
    ]
  },
  "has_inst": true
}
