{
  "locationType": "School",
  "accrediting": "University of Exeter",
  "provider": "QE School, Wimborne Minster",
  "subjects": [
    "History",
    "Secondary"
  ],
  "name": "History",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "1AN/2TK7",
  "providerCode": "1AN",
  "programmeCode": "2TK7",
  "schools": [
    {
      "name": "Main Site",
      "address": "Blandford Road, Pamphill, Wimborne, BH21 4DT",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Blandford Road, Pamphill, Wimborne, BH21 4DT",
      "geocode": true,
      "formatted_address": "Blandford Rd, Wimborne BH21 4DT, UK",
      "latitude": 50.8069457,
      "longitude": -2.0041454,
      "post_code": "BH21 4DT",
      "city": "Dorset",
      "route": "Blandford Road",
      "postal_town": "Wimborne"
    }
  ],
  "providerAddress": {
    "inst_code": "1AN",
    "addr_1": "Queen Elizabeth's School",
    "addr_2": "Blandford Road",
    "addr_3": "Pamphill",
    "addr_4": "Wimborne",
    "postcode": "BH21 4DT",
    "url": "http://qe.dorset.sch.uk",
    "geocode": true,
    "formatted_address": "600 Blandford Rd, Wimborne BH21 4DT, UK",
    "latitude": 50.80623569999999,
    "longitude": -2.0044331,
    "post_code": "BH21 4DT",
    "city": "Dorset",
    "route": "Blandford Road",
    "postal_town": "Wimborne"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Please see Exeter's Fees and Finance pages for this information.",
    "AboutCourse": "QE School runs all its School Direct training from its beautiful campus in Wimborne built in 2011 which has unrivalled facilities.\\r\n\\r\nYou will be working according to the Exeter University School Direct model, and further essay and assessment information can be found by following their web pages.\\r\n\\r\nIf you would like to visit the department at QE School and meet the team ahead of applying, please contact us and we can arrange this for you.\\r\n\\r\nAssessment in School Direct programmes is of your development in practice and in theory terms.  Exeter set the essays and online tasks that you have to complete, whilst at school you will be learning 'on-the-job' from day one what it means to be a teacher in your chosen subject area.\\r\n\\r\nYou visit the University just once, the rest of the time you are in school, with one day a week free to work in school on Exeter online assignments (called your 'in-school University day').  You have a subject tutor, a mentor and a University tutor all looking after you and guiding your progress, either at distance or in person every day.\\r\n\\r\nThere are phases to the development - you will not suddenly be 'thrown in', but at the same time you can accelerate the pace in consultation with your tutor if that is appropriate for you and your skills.\\r\n\\r\nYour week will not be a full timetable of lessons.  It will be a mix of teaching classes, teaching parts of lessons, team teaching, observing others around the school and in your chosen subject area, training led by experts at the school, training and guidance from a designated tutor and mentor, feedback and reflection sessions, marking and planning time.  You will be encouraged to come to all the same meetings and training that full time teachers do, giving you a full understanding of the profession and role.  There is also a placement in a nearby school for at least 6 weeks.\\r\n\\r\nAt QE School you have a designated room where you and our other trainees can go if you want to work away from departments for any reason.  This space is often used by trainees to get together to complete Exeter assignments and share their experiences; often the room becomes a place for sharing cakes and stories too, learning and reflecting together.\\r\n\\r\n ",
    "CourseLength": "OneYear",
    "Qualifications": "Please see Exeter University's School Direct entry requirement pages or contact the University to discuss this if you have any questions.",
    "FeeInternational": 16900.0,
    "FinancialSupport": "Unfortunately we do not offer any salaried positions or financial support.  Please do though visit Exeter University's School Direct Fees and Finance sections and their bursary guidance pages.  The government also publishes lists of which subjects it may be funding people to train in which changes yearly.",
    "InterviewProcess": "You are very welcome to visit the school prior to applying - please do contact us if you would like to do so.\\r\n\\r\nAt interview, you will get a full tour of the school, led by either a current trainee or one of our students.\\r\n\\r\nYou will be expected to teach a 30 minute lesson and you will have been sent detail as to what the lesson is to be on.  We recognise that you may well never have taught before, and this is just about seeing your potential to train and your rapport with students and your confidence leading them in a teaching task.  We do not expect to see 'the finished article' at this stage - just potential, and an understanding of the course and profession.\\r\n\\r\nYou will get to meet the department team and current trainees across the school, helping you to decide if we are the right place for you to train and vice versa - it genuinely is a two-way interview process in our eyes.\\r\n\\r\nThere will be a formal interview with the ITEC lead Rhianna Elsden and the Head of Department in the subject area to which you have applied.  If Exeter have asked us to check subject knowledge at interview, there may be an additional written task in order that we may do this.\\r\n\\r\nYou will undergo a full DBS check and questions on your understanding of safeguarding as part of the interview process.\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n",
    "OtherRequirements": "You will undergo a full DBS check and questions on your understanding of safeguarding as part of the interview process.",
    "PersonalQualities": "We are looking for applicants to have a genuine passion for teaching and for wanting to work with young people and help them to achieve their potential.  \\r\n\\r\nTeaching is a hard career - but incredibly rewarding.  Before starting the course we want you to recognise the challenges you face not just in the training, but in the profession thereafter.  We want you to recognise the challenges, but not be put off by them.  We want to train you and you to stay in the profession long term to make a difference to young people's lives and future prospects.",
    "HowSchoolPlacementsWork": "Your placement will be at a school close by.\\r\n\\r\nMany of our partner schools are also our feeder schools, but not all.  These would be Middle Schools where you would teach years 6-8.  In our partner secondary schools you would teach years 7-11 and in some cases 7-13.\\r\n\\r\nYou will visit the schools ahead of your placement and build up a working relationship with the staff there helping you to settle quickly when your placement starts.  \\r\n\\r\nMost placements take place in the second half of the Spring Term after the February half term."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Queen Elizabeth’s School is a heavily oversubscribed 13-18 mixed comprehensive school with an excellent local reputation for high quality teaching and learning and an innovative and forward looking approach to education.\\r\nThis reputation was reinforced by OFSTED in September 2017 and it continues to grow as we succeed in raising achievement still further; results have risen consistently over time and we expect to see further improvement over the next few years.\\r\nThere is a strong commitment to comprehensive education and a focus on creating an environment that supports continual school improvement and the attainment of all students.\\r\nThe complete rebuilding of the school into one of the best educational facilities in the entire country was completed in 2011 and we genuinely believe it is highly unlikely you will find better anywhere.",
    "TrainWithDisability": "For our students who have disabilities and other special needs we believe we offer outstanding support.  We do the same for our trainees.  Our facilities mean that the building is fully accessible on all levels and the site is open with wide corridors and pathways to support anyone with physical needs.  We have many students in wheelchairs, we also have visually and hearing impaired students - each with us due to the fact that we have both the facilities and the staff/understanding to support their needs.\\r\nOn our School Direct course we have supported trainees with both disabilities and training needs, including many trainees who are dyslexic.  They have all excelled with us and have commented positively on the support that was afforded to them.  ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "QE School has been partnered with Exeter University since its School Direct courses began.  QE School believes Exeter University provides unrivalled opportunities for trainees to achieve, as ratified once again in its most recent outstanding OFSTED, 2017: \\r\n\\r\n\"Trainees and NQTs display the professional qualities and attributes that make them resilient and driven in their work.\"\\r\n\\r\n\"Strong collaboration between all members of the partnership produces highly employable teachers who confidently apply theory to practice in class. Every trainee receives the individual personal and academic support they need to achieve their best and reach their full potential.\"\\r\n\\r\n\\r\n\\r\n",
        "UcasInstitutionCode": "E84"
      }
    ]
  },
  "has_inst": true
}
