{
  "locationType": "University",
  "accrediting": null,
  "provider": "Bishop Grosseteste University",
  "subjects": [
    "English",
    "Secondary"
  ],
  "name": "English",
  "slug": "B38/29TT",
  "providerCode": "B38",
  "programmeCode": "29TT",
  "schools": [
    {
      "name": "Main Site",
      "address": "Bishop Grosseteste College, Lincoln, Lincolnshire, LN1 3DY",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Bishop Grosseteste College, Lincoln, Lincolnshire, LN1 3DY",
      "geocode": true,
      "formatted_address": "Bishop Grosseteste College, Lincoln LN1 3DY, UK",
      "latitude": 53.243995,
      "longitude": -0.5357153,
      "post_code": "LN1 3DY",
      "city": "Lincolnshire",
      "route": null,
      "postal_town": "Lincoln"
    }
  ],
  "providerAddress": {
    "inst_code": "B38",
    "addr_1": "Admissions",
    "addr_2": null,
    "addr_3": "Lincoln",
    "addr_4": "Lincolnshire",
    "postcode": "LN1 3DY ",
    "url": "http://www.bishopg.ac.uk",
    "geocode": true,
    "formatted_address": "Lincoln, UK",
    "latitude": 53.230688,
    "longitude": -0.5405789999999999,
    "post_code": null,
    "city": "Lincoln",
    "route": null,
    "postal_town": "Lincoln"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "[Find more info about fees and funding on our website](https://www.bishopg.ac.uk/fees-funding/) ",
    "AboutCourse": "This PGCE course prepares you to teach English in the 11-16 age ranges with opportunities to gain experience of teaching post-16. It is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards. [Find out more on our website](https://www.bishopg.ac.uk/course/pgceseceng/)\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "For all PGCE Secondary specialisms you will normally need:\\r\n\\r\n* GCSEs at grade C or above (or equivalent) in English Language and Mathematics at the time of application. [Please see our list of accepted equivalents](https://www.bishopg.ac.uk/pgce-and-school-direct/).\\r\n* A relevant honours degree at a 2:2 classification or above\\r\n* Experience – We encourage you to gain some experience in schools as this is a good starting point for you to gain an interview for the Secondary PGCE\\r\n* Skills Tests in Numeracy and Literacy\\r\n* Declaration of Health\\r\n* DBS (formerly the CRB) Enhanced Disclosure\\r\n",
    "FeeInternational": 12500.0,
    "FinancialSupport": "[Find more info about financial support on our website](https://www.bishopg.ac.uk/fees-funding/) ",
    "InterviewProcess": "[Find out more on our website](https://www.bishopg.ac.uk/admissions-your-interviews/)",
    "OtherRequirements": "[Find out more on our website](https://www.bishopg.ac.uk/course/pgceseceng/)",
    "HowSchoolPlacementsWork": "[Find out more on our website](https://www.bishopg.ac.uk/course/pgceseceng/) "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Bishop Grosseteste University (BGU) has been educating students in the historic heart of Lincoln for over 150 years. Our beautiful campus is located just a few minutes’ walk from Lincoln Cathedral, Castle and the old Roman city. \\r\n\\r\nWe’re exceptionally proud that over the past 150 years, our commitment to first-class teacher training has remained consistent. Life after BGU is also extremely important to us and we offer many different methods of support for our trainees as they begin their teaching careers. Figures released by the Higher Education Statistic Agency (HESA) in July 2018 show that 97% of BGU graduates find work or are continuing to study six months following graduation. \\r\n\\r\nWe were also recently rated Gold in the first ever Teaching Excellence Framework (TEF) assessment, one of only a few universities from across the UK given the top award, demonstrating that we deliver consistently outstanding teaching, learning and outcomes for our students. We organise school placements for our trainees in a diverse range of partnership schools located across the East Midlands and ensure our teacher training both in schools and at the University allows trainees to develop an extensive understanding of every aspect of teaching. \\r\n",
    "TrainWithDisability": "We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. \\r\n\\r\nOur Student Advice team plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, along with students with specific learning differences or other access needs, before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\\r\n\\r\n* Specific learning differences including dyslexia\\r\n* Physical mobility difficulties\\r\n* Hearing impairments\\r\n* Visual impairments\\r\n* Persons requiring personal care\\r\n* Autistic Spectrum Disorders including Asperger’s Syndrome\\r\n* Mental health difficulties\\r\n* Medical conditions such as epilepsy, diabetes or asthma\\r\n\\r\nPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
