{
  "locationType": "School",
  "accrediting": "The John Taylor SCITT",
  "provider": "National Forest Teaching School",
  "subjects": [
    "Art / art & design",
    "Secondary"
  ],
  "name": "Art And Design",
  "slug": "1L6/26Y6",
  "providerCode": "1L6",
  "programmeCode": "26Y6",
  "schools": [
    {
      "name": "Main Site",
      "address": "John Taylor High School, Dunstall Road, Barton-under-Needwood, Burton-on-Trent, DE13 8AZ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "John Taylor High School, Dunstall Road, Barton-under-Needwood, Burton-on-Trent, DE13 8AZ",
      "geocode": true,
      "formatted_address": "Dunstall Rd, Barton-under-Needwood, Burton upon Trent DE13 8AZ, United Kingdom",
      "latitude": 52.765731,
      "longitude": -1.716944,
      "post_code": "DE13 8AZ",
      "city": null,
      "route": null,
      "postal_town": "Burton upon Trent"
    }
  ],
  "providerAddress": {
    "inst_code": "1L6",
    "addr_1": "John Taylor High School",
    "addr_2": "Dunstall Road",
    "addr_3": "Barton-under-Needwood",
    "addr_4": "Burton-on-Trent",
    "postcode": "DE13 8AZ",
    "url": "http://www.nationalforestteachingschool.co.uk",
    "geocode": true,
    "formatted_address": "Dunstall Rd, Barton-under-Needwood, Burton upon Trent DE13 8AZ, United Kingdom",
    "latitude": 52.765731,
    "longitude": -1.716944,
    "post_code": "DE13 8AZ",
    "city": null,
    "route": null,
    "postal_town": "Burton upon Trent"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9000.0,
    "AboutCourse": "Our Programme is essentially divided into 6 phases:\\r\n* Phase 1: 8-day induction in the SCITT\\r\n* Phase 2: 4-day Primary Placement \\r\n* Phase 3: Classroom Practice 1 in your home school. \\r\n* Phase 4: Classroom Practice 2 in a contrasting setting. This well be a\\r\n   9 week placement \\r\n* Phase 5: Week in a special School.\\r\n* Phase 6: Classroom Practice 3 in your home school.\\r\nIn each Phase of Classroom Practice you will spend 4 days in school. The fifth day  is a training day at John Taylor High School. In the morning all trainees undertake general professional studies training or work with a colleague from the University of Derby on PGCE assignments, and in the afternoon split into subject groups. You will engage in subject workshops learning how to Teach Art and Design. Our subject Development Leader for Art and Design is a highly experienced Curriculum Area Leader and has designed our  programme to give trainees the skills and subject knowledge to meet the demands of new assessment specifications and an ever-evolving educational landscape. You will be given the opportunity to explore and research how pupils learn, discover a range of teaching skills and perfect strategies that meet the needs of all pupils, develop their creativity and your own skills. The course is practical, provides many opportunities to receive individual feedback as well as offering collaborative opportunities to develop your subject knowledge. The environment in which you will work is extremely supportive. If you are passionate about Art and Design, keen to share your enthusiasm with young people and develop your own subject knowledge we would welcome your application for our Art and Design SCITT programme. \\r\n\\r\nSchool and subject based tasks support face to face training sessions and you will have the opportunity to share experiences with other during the reflect and review sessions on training days. \\r\n\\r\nThere will be 3 main assessment points throughout the year and by the end of the year you will need to demonstrate and evidence that you have fully met each of the eight Standards for Qualified Teacher Status as well as Part 2 of The Standards. A Subject Knowledge viva at the end of the programme will provide you with the opportunity to demonstrate how you have developed your Art and Design subject knowledge over the course of the year.   \\r\n\\r\nAll our previous Art trainees have successfully secured employment. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "All applicants are required to hold a UK undergraduate degree or a recognised equivalent qualification with a minimum degree classification of 2.2. The degree must be in, or closely related to, your proposed teaching subject.Where this is not the case you may still be offered a place, but it will be subject to you completing a Subject Knowledge Enhancement course. GCSE grade C or above in English Language and Mathematics is a requirement of the programme \\r\n",
    "InterviewProcess": "If your application  meets the requirements of the programme you will be invited to attend an interview at John Taylor High School training centre, where a member of the SCITT Team , a representative from a partner school and a subject specialist will interview you.  \\r\nPrior to interview we will ask you to complete a subject knowledge audit and undertake a  small amount of research in preparation for the interview. On the interview day we will ask you to:\\r\n\\r\n* complete a literacy and numeracy test\\r\n* deliver a five minute presentation \\r\n* engage in a micro teaching activity with a small group of KS3 pupils. In this activity we are only  looking to assess your ability to breakdown a concept to enable children to learn, your  presence and professionalism  and your ability to interact with pupils.\\r\n* have a one to one interview in which we will explore your reasons for wanting to become a teacher, your understanding of what it means to be a teacher and what constitutes outstanding teaching and learning.\\r\n\\r\nThere will a be an information session prior to the formal interview when we go through the programme with you in detail and provide an informal opportunity for you to ask any questions that you may have about our programme. \\r\n",
    "PersonalQualities": "To be successful on our programme, you need to have excellent subject knowledge and  be highly motivated, with a real passion for teaching  and  your subject.  You should be able to demonstrate a good understanding of what it means to be a teacher, ideally  through school experience and be able to evidence resilience and good organisational skills. It is important that you can work effectively as part of a team, are a good listener and receptive to constructive criticism. ",
    "HowSchoolPlacementsWork": "The National Forest Teaching School Alliance is an alliance of 14 secondary schools, 17 primary schools and 3 special schools across our local area. No school is more that 30 minutes travelling time from John Taylor High School . When assigning you to a school we will give consideration to a school's competence and capacity in your subject area, plan for two contrasting placements and look at where you live. We will not ask you to travel more than absolutely necessary. \\r\nOur programme is an 11-16 programme with post 16 enhancement and so you will have to teach across KS3 and 4 and according to your aspirations and confidence acquire Post 16 experience as well. We strongly encourage all our partners to provide a KS5 teaching experience for our trainees, as we believe that this enhances  employability s which is extremely important to us. \\r\nYour Home School, where you start and end your training, will oversee the whole of your training year and communication between your home School and second placement mentor is very important to us to ensure a smooth transition between the phases. To that end both mentors will be involved in your end of phase 1 and 2 assessments and transition information shared.  \\r\nPrior to starting in your home school you will spend 4 days in a primary setting in order to develop your understanding of what pupils have learnt and what they can do when they arrive at their secondary school to continue their educational journey. You will look at how your subject is taught in the primary school in order that you are aware of their existing skills and can plan to build on them effectively. \\r\nAfter completing you second placement in the spring term you will  spend a week in a special school to deepen your understanding of the barriers to learning that some pupils experience and different strategies deployed by special schools to help pupils overcome them. We work with a number of different types of special schools and a Pupil Referral Unit who all support us with this component of our training. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "John Taylor High School, based in the charming Staffordshire village of Barton under Needwood, is an Outstanding school (Ofsted 2014) and the lead school for the National Forest Teaching School Alliance. All our programmes are accredited by the John Taylor SCITT. We currently work with 14 secondary schools, 17 primaries and 3 special schools.  Most of our partner schools are located  north of Birmingham, predominantly in  Staffordshire and South Derbyshire. We are well located, being less than 5 minutes from the A38. A bespoke training centre, on the John Taylor High School site, is the main training venue for all Professional Studies and Subject Development training \\r\n As a teaching school we aspire to train and recruit the very best teachers to our local area and beyond and regard the ITE year as stage one of our teacher recruitment and development process. For trainees who secure employment locally within the alliance, we offer access to a programme of tailored professional development: Our Newly Qualified Teacher and Recently Qualified Teacher Programmes, build seamlessly on our ITE programmes and ensure that as an NQT and second year teacher you continue to be supported and developed. Talent management and succession planning are high on our agenda and our CPD and training opportunities reflect this, with opportunities for aspirant middle leaders and senior leaders to engage in tailored programmes to support career progression for good teachers.[click here to view our website](http://nationalforestteachingschool.co.uk)",
    "TrainWithDisability": "The National Forest Teaching School welcomes applications from people with disabilities. John Taylor High School, the lead school, has full access and facilities for people with disabilities.\\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The John Taylor SCITT, offering both primary and secondary programmes is based at John Taylor High School. The SCITT is  a relatively small provider and as a consequence prides itself on knowing all  trainees well and being able to offer highly personalised support. \\r\nIn 2017  the SCITT was  commended by Ofsted for :\\r\n* their vision and ambition\\r\n* the training and support provided\\r\n* the quality of placements offered\\r\n* their responsiveness to needs and views of trainees \\r\n* communication and collaboration with partner schools\\r\n* trainee outcomes\\r\n* employment rates \\r\n* professionalism and commitment of NQTs",
        "UcasInstitutionCode": "24V"
      },
      {
        "Description": "The University of Derby works in partnership with the SCITT and accredits the academic award of PGCE. Colleagues from Derby will lead  the Level 7 sessions in our John Taylor SCITT training centre. As a trainee you will have access to all the online resources from the University of Derby and enjoy other associated benefits of being a student with the University of Derby. ",
        "UcasInstitutionCode": "D39"
      }
    ]
  },
  "has_inst": true
}
