{
  "locationType": "School",
  "accrediting": "University of Birmingham",
  "provider": "Hales Valley Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "18E/2C3Q",
  "providerCode": "18E",
  "programmeCode": "2C3Q",
  "schools": [
    {
      "name": "Main Site",
      "address": "Brookwillow Road, Halesowen, B63 1BU",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Brookwillow Road, Halesowen, B63 1BU",
      "geocode": true,
      "formatted_address": "Brookwillow Rd, Halesowen B63 1BS, UK",
      "latitude": 52.4409763,
      "longitude": -2.0746565,
      "post_code": "B63 1BS",
      "city": "West Midlands",
      "route": "Brookwillow Road",
      "postal_town": "Halesowen"
    }
  ],
  "providerAddress": {
    "inst_code": "18E",
    "addr_1": "Brookwillow Road",
    "addr_2": null,
    "addr_3": null,
    "addr_4": "Halesowen",
    "postcode": "B63 1BU ",
    "url": "http://www.hvts.org.uk",
    "geocode": true,
    "formatted_address": "Brookwillow Rd, Halesowen B63 1BS, UK",
    "latitude": 52.4403158,
    "longitude": -2.0735943,
    "post_code": "B63 1BS",
    "city": "West Midlands",
    "route": "Brookwillow Road",
    "postal_town": "Halesowen"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The courses will begin in September 2019 and last for one academic year with a trainees time being divided between school based placements (approximately 80%) and structured training days (approximately 20%) which will take place at either Hales Valley Teaching Hub or at one of our partner organisations (University of Birmingham) and focus upon key educational theory and practice. \\r\n\\r\nOn the 46 week programme a trainee’s time is divided between Teaching Experiences and structured training sessions looking at subject delivery and wider professional issues. The teaching commitment will build up over the year: 50% in the Autumn term, 60% in the Spring term and 80% in the Summer term. During the course trainees will be supported by their school-based practitioner who will be a good or outstanding teacher and leader within the school.\\r\n\\r\nTrainees will be assessed on a combination of evidence gathered during the teaching experiences, a range of tasks linked to Hales Valley/partnership workshops as well as three formal assignments that focus on key areas of teaching and learning.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "The academic requirements are:\\r\n\\r\n•A grade C (or better) in GCSE English, mathematics and science\\r\n\\r\n•A degree class 2.1 or above\\r\n\\r\n•Successful completion of skills tests in English and maths \\r\nsupport available for maths skills tests at [www.numeracyskillstest.co.uk]\\r\n",
    "FinancialSupport": "Once individuals have accepted a place, they can then make applications for tuition fee loans through Student Finance England, to cover the cost of their training. ",
    "OtherRequirements": "Successful candidates will be required to carry out an enhanced DBS check before commencing the programme. ",
    "HowSchoolPlacementsWork": "School direct is a school-led training course which gives you the chance to learn ‘on the job’ in a school. You work as part of the teaching team from day one, learning from experienced, highly-skilled colleagues and you immediately put your new skills into practice.\\r\nYou spend on average 80% of the week in one of our 20 primary partnership schools teaching in key stage 1 and 2. \\r\nWe have worked very closely with our partnership schools over the last five years and have excellent relationships with them. They share our ethos, understanding the importance and value of school led teacher training.\\r\nYou will have three school experiences throughout the year ensuring you gain experience in both key stage 1 and 2 enabling you to teach 5-11 year olds.  You spend your first and last school experience in the same class, in the same school. Your second school placement is in different school ensuring you gain a wider experience in your training. \\r\nYou also spend time in EYFS and spend a day at a local secondary school in order to gain experience of both the key stage below and above where you will be qualified to teach. \\r\n\\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "School Direct and SCITT courses are  school-led training which gives you the chance to learn ‘on the job’ in a school. You work as part of the teaching team from day one learning from experienced, highly-skilled colleagues and immediately put your new skills into practice.\\r\n\\r\nHere at Hales Valley Teaching Hub, we offer three different routes into teacher training.\\r\n\\r\nThe two routes we offer which are validated by the University of Birmingham are:-\\r\n•Primary Postgraduate Certificate of Education award (Level 7) which has a total of 60 Masters level credits plus a QTS qualification.\\r\n•Early Years Postgraduate Certificate of Education award (Level 7) which has a total of 60 Masters level credits plus a QTS qualification.\\r\n\\r\nThe third route we offer is in partnership with Haybridge School Centred Based Initial Teacher Training is:-\\r\n•Primary Postgraduate Certificate of Education award (Level 7) which has a total of 60 Masters level credits plus a QTS qualification.\\r\n\\r\nWhy choose Hales Valley Teaching Hub?\\r\n•Excellent support and bespoke provision to meet the individual needs of our trainees.\\r\n•P.G.C.E. School Direct delivered in partnership with the University of Birmingham or Haybridge Allaince SCITT and one of our 20 primary partnership schools.\\r\n•100% pass rate at good or above and 100% employment rate once qualified since we began offering the programme.\\r\n•Experienced Hales Valley mentor designated to each trainee throughout the year.\\r\n\\r\nFor more information on one of our three courses, please email\\r\nhpickles1@lutley.dudley.sch.uk\\r\nor\\r\nbhale@lutley.dudley.sch.uk\\r\n\\r\n",
    "TrainWithDisability": "Hales Valley Teaching Hub strives to be an inclusive learning community. Whatever your disability, mental health  or learning support needs, we’re here to help make sure you that you can access appropriate support to take advantage of the School Direct and SCITT experience.\\r\n\\r\nHow we support our teacher trainees depends on your condition and other circumstances. Support is individual and personalised to you and responsive to how your needs may change throughout your time with us.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "The School of Education at UoB has a long tradition of delivering ITE courses. Its teaching has been graded as 'outstanding' for the third consecutive time by Ofsted inspectors which reaffirms the University’s status as one of the UK’s leading institutions for excellence in teacher training.  \\r\n\\r\nThe quality of the programme and the newly qualified teachers that enter the profession as a result of it are critical to all partners involved.\\r\n\\r\nStudent Support \\r\n(http://www.birmingham.ac.uk/students/support/index.aspx)\\r\n\\r\nChild Care Facilities \\r\n\\r\n(http://www.birmingham.ac.uk/students/support/nursery.aspx)\\r\n\\r\nDisability Access \\r\n(http://www.birmingham.ac.uk/students/support/disability/index.aspx)\\r\n\\r\n\\r\n\\r\n",
        "UcasInstitutionCode": "B32"
      },
      {
        "Description": "The benefit of School Centred Initial Teacher Training is that you are inducted into school life from day one, gaining valuable classroom experience, working alongside excellent practitioners, enabling you to master your theory of teaching  and classroom management skills. It is an effective, challenging and rewarding route into teaching, and we treat every trainee as an individual, identifying their needs in order to ensure they achieve an excellent outcome.\\r\n\\r\nYou will be supported by a mentor throughout the year, and will have regular training days with other trainees and a chance to share ideas with both new and experienced teachers.\\r\n",
        "UcasInstitutionCode": "2B3"
      }
    ]
  },
  "has_inst": true
}
