{
  "locationType": "University",
  "accrediting": null,
  "provider": "UCL, University College London (University of London)",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Bursary, Scholarship or Student finance if you’re eligible",
  "slug": "U80/2P3S",
  "providerCode": "U80",
  "programmeCode": "2P3S",
  "schools": [
    {
      "name": "Main Site",
      "address": "Registrar's Division, Gower Street, London, WC1E 6BT",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Registrar's Division, Gower Street, London, WC1E 6BT",
      "geocode": true,
      "formatted_address": "Gower St, Bloomsbury, London WC1E 6BT, UK",
      "latitude": 51.52423330000001,
      "longitude": -0.1345379,
      "post_code": "WC1E 6BT",
      "city": "Greater London",
      "route": "Gower Street",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "U80",
    "addr_1": "Student and Registry Services",
    "addr_2": "UCL",
    "addr_3": "Gower Street",
    "addr_4": "London",
    "postcode": "WC1E 6BT",
    "url": "http://www.ucl.ac.uk/ioe/courses/teacher-training",
    "geocode": true,
    "formatted_address": "Gower St, Bloomsbury, London WC1E 6BT, UK",
    "latitude": 51.52455920000001,
    "longitude": -0.1340401,
    "post_code": "WC1E 6BT",
    "city": "Greater London",
    "route": "Gower Street",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "AboutCourse": "Students on the Primary PGCE programme benefit enormously from the complementary skills and expertise of staff in partnership schools and at the UCL Institute of Education (IOE). The schools offer placements for teaching experience, and their teachers serve as tutors, mentors and joint assessors for our student teachers. IOE tutors have extensive experience of teaching, school management, inspection, research and consultancy.\\r\n\\r\nPrimary PGCE students can gain experience of teaching across one or more key stages; the Foundation Stage and Key Stage 1; Key Stage 1 and Key Stage 2; lower Key Stage 2 (ages 7 to 9) and upper Key Stage 2 (ages 9 to 11). Students will learn to teach all the primary curriculum subjects. They will also select one subject for specialist study from the range that we offer (i.e. Children’s Literature and Language, English Language and Literacy, French, Geography, Mathematics, Music, New Media and Computing, Religious Education, Values and Identity and Science).",
    "CourseLength": "OneYear",
    "Qualifications": "- A minimum of a lower second-class UK Bachelor’s degree or an overseas qualification of an equivalent standard. For Primary Specialist Mathematics, a Mathematics degree or degrees with significant Mathematics content would be an advantage.\\r\n\\r\n- GCSE English Language, Mathematics and Science at grade C/ 5 or above. Please note that we do not accept \"additional\" or \"applied\" GCSE subjects but we do accept double or single science GCSEs.",
    "FinancialSupport": "Please see our website for further information about available bursaries and funding: [https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/fees-and-funding/bursaries-and-funding]",
    "InterviewProcess": "Applicants successful at shortlisting stage will be invited to an interview at UCL Institute of Education.",
    "OtherRequirements": "For information about all UCL's statutory requirements linked to Teacher Training programmes please visit our website: [https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements]",
    "HowSchoolPlacementsWork": "Text to be decided by the UCL Placements team."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The UCL Institute of Education (IOE) is a global leader in teacher education. Our programmes are recognised by Ofsted as 'outstanding' in every criterion across Primary, Secondary and Post-Compulsory education (FE). \\r\n\\r\n- We'll support you with the skills and knowledge you'll need from the moment you step into a classroom, but we know that learning to teach is much more than that we'll prepare you to build a rewarding and fulfilling long-term career in education. \\r\n\\r\n- Our focus on quality means that whatever route you select, you will be taught by experts in your subject and education phase, many of whom are world leaders in their field. \\r\n\\r\n- We are committed to supporting education in London, where schools lead the country in performance and pupil progress. We work with around 500 London schools, including long-term partners who work with us to harness our wider research and expertise. \\r\n\\r\n- When you walk into the UCL Institute of Education, you'll join a lively, friendly and diverse community of 8,000 students and more than 600 distinguished academics, committed to improving lives through education and promoting social participation to address local and global challenges. ",
    "TrainWithDisability": "Please visit our Student Support and Wellbeing website:[https://www.ucl.ac.uk/students/student-support-and-wellbeing] for information about the services they offer to incoming students.",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
