{
  "locationType": "School",
  "accrediting": "Roehampton University",
  "provider": "Montpelier Primary School (West London Teaching Alliance)",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "2F3/35LQ",
  "providerCode": "2F3",
  "programmeCode": "35LQ",
  "schools": [
    {
      "name": "West London Teaching Alliance",
      "address": "Montpelier Primary School, Montpelier Road, Ealing, London, W5 2QT",
      "code": "W"
    }
  ],
  "addresses": [
    {
      "address": "Montpelier Primary School, Montpelier Road, Ealing, London, W5 2QT",
      "geocode": true,
      "formatted_address": "26A Montpelier Rd, Ealing, London W5 2QT, UK",
      "latitude": 51.5238728,
      "longitude": -0.3037456,
      "post_code": "W5 2QT",
      "city": "Greater London",
      "route": "Montpelier Road",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "2F3",
    "addr_1": "Montpelier Road",
    "addr_2": null,
    "addr_3": "Ealing",
    "addr_4": "London",
    "postcode": "W5 2QT  ",
    "url": null,
    "geocode": true,
    "formatted_address": "Montpelier Rd, London W5 2QP, UK",
    "latitude": 51.5227409,
    "longitude": -0.3029259,
    "post_code": "W5 2QP",
    "city": "Greater London",
    "route": "Montpelier Road",
    "postal_town": "London"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Led by Montpelier Primary School, judged outstanding by Ofsted, the West London Teaching Alliance has a collaborative School Direct partnership of 8 primary schools in the London Borough of Ealing. \\r\n\\r\nDedicated to delivering excellence in education as well as first class teacher training, the WLTA works in partnership with Roehampton University to offer an exciting and innovative School Direct programme.\\r\n\\r\nWith a record for delivering high quality professional development for teachers, our training practice is well known in Ealing and, consequently, the WLTA now delivers Ealing borough’s induction training for newly qualified teachers. Montpelier is both a National Support School and a National Teaching School and provides support for other schools to strengthen teaching, learning and leadership at different levels. The school is well resourced and support is available from existing teachers and leaders who are committed to develop teaching in order to enhance and improve opportunities for children.\\r\n\\r\nProviding comprehensive and fully supportive guidance from our mentors, the WLTA gives trainees a unique chance to become grounded in a broad and balanced range of specialisms and an opportunity to experience a day training at every one of our School Direct schools. \\r\n\\r\nHighly skilled practitioners at Montpelier, North Ealing, Lady Margaret, Oaklands, Featherstone, Southfield, St Mark's and West Twyford primary schools will each offer a full day of training. Trainees can also choose to take part in further elective options. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "2.1 Honours UK degree or an approved non-UK degree qualification. 2.2 degree considered when an applicant has a Masters or can demonstrate substantial (one year minimum) recent (within the last 18 months) primary school experience in a state/mainstream school.\\r\n\\r\nGCSE English, Mathematics and Science at Grade C/4 or above\\r\n\\r\n2 A levels or equivalent\\r\n\\r\nApplicants currently retaking a GCSE or awaiting a degree classification will be offered a conditional place if successful on interview.\\r\n\\r\nAll trainee teachers must also pass the Department of Education’s professional skills tests in numeracy and literacy before they can start a training programme. \\r\n\\r\n https://getintoteaching.education.gov.uk/how-to-apply/passing-the-skills-tests",
    "InterviewProcess": "Once your application is processed by UCAS, it is then forwarded onto us for our schools to consider. Successful applicants are then invited in for an interview morning or afternoon. Interview/assessment days comprise a three part process including an interview with a panel of two Headteachers, a 30 minute written test of grammar and spelling (as set by Roehampton University) and a 20 minute group task to see how you interact with a group of 10 children and to see if you can teach them something new.\\r\n\\r\nShould you succeed, you will also need to pass the the Department of Education’s professional skills tests in numeracy and literacy before you can be offered a place. \\r\n\\r\nFor further information about these skills tests, visit the Department for Education’s website at https://getintoteaching.education.gov.uk/how-to-apply/passing-the-skills-tests\\r\n\\r\n",
    "OtherRequirements": "In addition to the specific entry requirements detailed, the following DfE Requirements must be met. All candidates must:\\r\n\\r\nMeet the Secretary of State's requirements for physical and mental fitness to teach\\r\n\\r\nHave been subject to a Disclosure and Barring enhanced disclosure check\\r\n\\r\nHave the intellectual and academic capabilities needed to meet the required DfE Teachers' Standards\\r\n\\r\nPossess the appropriate qualities, attitudes and values expected of a teacher (enthusiasm, self-organisation, resilience, determination, adaptability and motivation)\\r\n\\r\nHave passed the professional skills tests in English and mathematics prior to the start of the programme\\r\n",
    "PersonalQualities": "Applicants must articulate a clear and appropriate reason for wanting to teach children. They must:\\r\n\\r\nConvey commitment and enthusiasm to primary teaching\\r\nDemonstrate openness to learning and self-development\\r\nDemonstrate a desire and passion to teach young children\\r\nDemonstrate the correct use of standard English\\r\n\\r\nIt is essential that all applicants gain some insight into what is involved in being a teacher, this does not have to be paid work in a school it could be in an informal environment such as brownies, sport coaching or summer school.\\r\n",
    "HowSchoolPlacementsWork": "The primary schools in Ealing which will have vacancies are Montpelier, Lady Margaret, St Mark’s, Oaklands, Featherstone, North Ealing, Southfield and West Twyford. \\r\n\\r\nSuccessful applicants will be based at one of these schools (by mutual consent) full time (apart from the 29 days spent studying at Roehampton University) and a block school experience placement of 31 days at another school.\\r\n\\r\nYou will additionally spend one day in each of our schools learning from their specialisms as part of your training."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Led by Montpelier Primary School, judged outstanding by Ofsted, the West London Teaching Alliance has a collaborative School Direct partnership of 9 primary schools in the London Borough of Ealing. Dedicated to delivering excellence in education as well as first class teacher training, the WLTA works in partnership with Roehampton University to offer an exciting and innovative School Direct programme.\\r\n\\r\nWith a record for delivering high quality professional development for teachers, our training practice is well known in Ealing and, consequently, the WLTA now delivers Ealing borough’s induction training for newly qualified teachers. Montpelier is both a National Support School and a National Teaching School and provides support for other schools to strengthen teaching, learning and leadership at different levels. The school is well resourced and support is available from existing teachers and leaders who are committed to develop teaching in order to enhance and improve opportunities for children.\\r\n\\r\nProviding comprehensive and fully supportive guidance from our mentors, the WLTA gives trainees a unique opportunity to experience a day at every one of our School Direct schools. Highly skilled practitioners at Featherstone, Lady Margaret, Montpelier, North Ealing, Oaklands, Southfield, St Mark’s, West Twyford and Wood End Academy primary schools will each offer a full day of training in each of their specialisms. Trainees can also choose to take part in further elective options.",
    "TrainWithDisability": "Montpelier Primary School has a lift and is wheelchair accessible.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "* Roehampton University has partnerships with over 150 schools in south London and the surrounding areas. \\r\n\\r\n* Learning is supported by experienced academics at one of the highest rated initial teacher education providers in the UK. \\r\n\\r\n* The qualification gained is a PGCE which is recognised internationally and you will also get a recommendation for Qualified Teacher Status. Successful completion will give you 60 Masters level credits, which can be carried forward to further study.\\r\n\\r\nFor further information: \\r\n(https://www.roehampton.ac.uk/postgraduate-courses/school-direct/)",
        "UcasInstitutionCode": "R48"
      }
    ]
  },
  "has_inst": true
}
