{
  "locationType": "School",
  "accrediting": "University of St Mark & St John",
  "provider": "All Saints Teaching School Alliance",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "slug": "21V/2NC6",
  "providerCode": "21V",
  "programmeCode": "2NC6",
  "schools": [
    {
      "name": "Main Site",
      "address": "Ilsham Road, Torquay, Devon, TQ1 2JQ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Ilsham Road, Torquay, Devon, TQ1 2JQ",
      "geocode": true,
      "formatted_address": "Ilsham Rd, Torquay TQ1 2JQ, UK",
      "latitude": 50.4670926,
      "longitude": -3.5056438,
      "post_code": "TQ1 2JQ",
      "city": "Torbay",
      "route": "Ilsham Road",
      "postal_town": "Torquay"
    }
  ],
  "providerAddress": {
    "inst_code": "21V",
    "addr_1": "All Saints Teaching School Alliance",
    "addr_2": "c/o Ilsham Academy, Ilsham Road",
    "addr_3": "Torquay",
    "addr_4": "Devon",
    "postcode": "TQ1 2JQ ",
    "url": "http://astsa.org/schooldirect",
    "geocode": true,
    "formatted_address": "Ilsham Rd, Torquay TQ1 2JQ, UK",
    "latitude": 50.4671457,
    "longitude": -3.5065426,
    "post_code": "TQ1 2JQ",
    "city": "Torbay",
    "route": "Ilsham Road",
    "postal_town": "Torquay"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "-",
    "AboutCourse": "From day one, trainees will be school based and a part of a school team, working with outstanding teachers and mentors in our Teaching School alliance schools. School Direct brings together all the necessary elements required for excellence in Initial Teacher Education and Training; this is built upon a partnership of expert school-based practitioners and our experienced accrediting provider, Plymouth Marjon University. The programme brings teacher education pedagogy and up to date research within a school-based setting, providing enriched, school-based essential classroom experiences that allows you to put theory into practice as you develop into an outstanding teacher. \\r\n \\r\nThe School Direct programme duration is one academic year (September - July), during which time you will be based in a home school and to ensure a breadth of experience you will undertake a number of high quality school placements across our Partner schools, as well as a bespoke programme of training developed and delivered by University lecturers and outstanding teachers. \\r\n \\r\nOur programme has been designed to build your confidence and subject knowledge and give you the necessary skills to become an outstanding classroom teacher. On completion of your training you will be awarded a PGCE and Qualified Teacher Status (QTS). All graduates of our Schools Direct programmes will be confident, passionate, knowledgeable and reflective teachers. \\r\n \\r\nIt is expected that as a reflective, highly developed, newly qualified teacher, you will secure employment either directly with your host school or in one of our partner schools, upon successful completion of the programme. \\r\n \\r\nWe are only offering non-salaried routes for School Direct for the 2019-20 programme. \\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "To be eligible for our School Direct programme, the following qualifications, experience and attributes are required: \\r\n\\r\n* A UK undergraduate honours degree or a recognised equivalent qualification at 2.2 or above.\\r\n* GCSE Grade Cs or above in Science, English and Mathematics (or equivalent).\\r\n* Candidates will have successfully completed the Professional Skills' tests in Literacy and Numeracy by the end of the summer term and prior to their September start.\\r\n",
    "FeeInternational": 9250.0,
    "InterviewProcess": "You will be interviewed by our School Direct ITT Lead plus at least one other person from one of our alliance schools.  Normally you will only need to attend one interview.\\r\n\\r\nYou will invited to one of our schools for the morning/afternoon, possibly along with other applicants, and will be given a group introduction to our programme and then a tour of the school.\\r\n\\r\nAs well as an individual  interview, you will also be asked to complete a simple maths and literacy task, and carry out a 15 minute task with a small group of children. There will also be a short group discussion about an article, which will be sent to you in advance.",
    "OtherRequirements": "All candidates must complete a declaration regarding any criminal convictions, clearance from the Criminal Records Bureau regarding suitability to work with young people and a fitness to teach declaration.",
    "PersonalQualities": "We are looking to recruit high calibre candidates who have the values, qualities and attributes needed to become outstanding teachers, with the drive and motivation to succeed. \\r\n \\r\nWe are looking for candidates who: \\r\n \\r\n* Are passionate about making a difference to the lives and development of young people\\r\n* Have a 'Can Do' attitude and a positive outlook.\\r\n* Have good interpersonal skills.\\r\n* Are creative and imaginative.\\r\n* Have good organisational skills and excellent time management.\\r\n* Are reflective and strive to improve their own practice.\\r\n",
    "HowSchoolPlacementsWork": "We work with a wide range of diverse and high quality primary schools and academies from a variety of different contexts including: multi-academy trusts, church, community, local authority, small, large, seaside, urban and rural locations.  You will attend placements and visits to other partnership schools including schools from a different phase to the one in which you aim to teach.\\r\n\\r\nNormally you will spend the Autumn term in your host school, then change placements in the Spring term, and finally returning to your host school for the Summer term.\\r\n\\r\nDuring the Autumn term you will work with children in class for 50% of the week.  The remaining 50% of time is allocated as non-contact time. This means times when you are not necessarily in class and allows you time to undertake other forms of professional development so that you can build subject knowledge across the curriculum, hone your understanding of pedagogy and help you to become a more reflective and dynamic teacher.  \\r\n\\r\nThis time will gradually decrease throughout the year as you take on greater classroom and teaching responsibility.\\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "* Do you aspire to be an outstanding primary teacher?\\r\n* Are you excited at the prospect of making a difference to children's lives?\\r\n*Are you determined, passionate and committed to your own development?\\r\n\\r\nAll Saints Teaching School Alliance is an innovative, dynamic and forward thinking Teaching School. Our programme awards both QTS and a PGCE on successful completion of the programme. \\r\n \\r\nWe work with a wide range of diverse and high quality primary schools and academies from a variety of different contexts including: multi-academy trusts, church, community, local authority, small, large, seaside, urban and rural locations. Our Teacher Education team have six years' experience of designing and delivering the School Direct programme and year on year we have had an extremely high success rate of School Direct students gaining employment upon completion of our programme. Whilst we do not guarantee teaching posts to School Direct graduates, our alliance schools are fully involved in the programme as they are committed to 'growing' the next generation of outstanding teachers for their own schools. \\r\n \\r\nWe work together to share expertise, experience, talent and capacity to improve the learning and achievement of young people across the South West. We believe that every child has the right to be taught by an excellent teacher in an excellent school that nurtures, challenges and supports their potential. Together, we have a track record of developing and supporting new, talented teachers into the profession, through high quality training, delivered by excellent practitioners in our schools and universities. ",
    "TrainWithDisability": "Support can be provided for candidates with disabilities - we will discuss this with you in detail upon receipt of your application.",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Our School Direct programme is an exciting Teacher Education training route for top graduates, in partnership with Plymouth Marjon University. Our training programme uses a variety of school-based settings, enabling trainees to experience a wide range of different learning environments and contexts. This variety ensures that trainees are fully prepared to take up posts in schools. \\r\n \\r\nAs a School Direct trainee, you will be enrolled at Plymouth Marjon University with access to the full range facilities, resources and both social and academic opportunities. As a full member of the University you will benefit from all key events that are arranged. ",
        "UcasInstitutionCode": "P63"
      }
    ]
  },
  "has_inst": true
}
