{
  "locationType": "School",
  "accrediting": "Tes Institute",
  "provider": "West Essex School Direct Partnership",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Salary",
  "slug": "1OS/38J2",
  "providerCode": "1OS",
  "programmeCode": "38J2",
  "schools": [
    {
      "name": "Passmores Cooperative Learning Community",
      "address": "Tracyes Road, Harlow, Essex, CM18 6JH",
      "code": "P"
    }
  ],
  "addresses": [
    {
      "address": "Tracyes Road, Harlow, Essex, CM18 6JH",
      "geocode": true,
      "formatted_address": "Tracyes Rd, Harlow CM18 6JW, UK",
      "latitude": 51.7575576,
      "longitude": 0.1222646,
      "post_code": "CM18 6JW",
      "city": "Essex",
      "route": "Tracyes Road",
      "postal_town": "Harlow"
    }
  ],
  "providerAddress": {
    "inst_code": "1OS",
    "addr_1": "West Essex SD Partnership",
    "addr_2": "Chester Road",
    "addr_3": "Loughton",
    "addr_4": "Essex",
    "postcode": "IG10 2LD",
    "url": "http://www.davenantschool.co.uk",
    "geocode": true,
    "formatted_address": "Chester Road, Loughton IG10 2LJ, UK",
    "latitude": 51.65884010000001,
    "longitude": 0.0807486,
    "post_code": "IG10 2LJ",
    "city": "Essex",
    "route": "Chester Road",
    "postal_town": "Loughton"
  },
  "options": [
    "PGCE with QTS, full time with salary"
  ],
  "enrichment": {
    "AboutCourse": "The West Essex School Direct Partnership has a long tradition of successful teacher training and we were centrally involved in the ‘pilot’ year 2012-13 when the Government launched the programme. \\r\n\\r\nWe provide a very special, school based training experience in partnership with TES Institute who have a reputation for innovative on-line learning materials, especially in shortage subjects, with its Subject Knowledge Enhancement courses.  \\r\n\\r\nTES Institute, a leading teacher training provider and the newest member of the TES Global family, is delighted to be working in partnership with Passmores Co-operative Learning Community Trust  and its partners to deliver School Direct initial teacher training (ITT).  \\r\n\\r\nOur salaried and unsalaried School Direct programmes are accredited by the National College for Teaching and Leadership (NCTL) and they provide a blend of online learning and in-school experience leading to Qualified Teacher Status (QTS) and an option to add a Postgraduate Certificate in Education (PGCE). \\r\n\\r\nThe PGCE is accredited by our partner University and is subject to annual review.\\r\n\\r\nOne of the West Essex School Trusts – Passmores Cooperative Learning Community - is part of a  partnership known as PCLC and they are now offering primary teacher training places in Harlow through School Direct.  The schools within PCLC and across our partnership schools believe that teaching is an exciting, challenging and rewarding profession.  Our vision is to offer the highest standard of education for all, both in our local community and the wider area.\\r\n",
    "CourseLength": "OneYear",
    "SalaryDetails": "With School Direct salaried programmes, you won’t need to pay any tuition fees. You’ll be employed and paid by a school directly as an unqualified teacher. This has previously been on Point 1 of the Unqualified Teaching Scale. The amount will be subject to tax.",
    "Qualifications": "To qualify for this school-centred route, you must have English, Maths and Science GCSE Grade 4/C or above and a degree of a 1st or a 2:1, though we are willing to consider applicants who have a 2:2 and can demonstrate a real aptitude for teaching.\\r\n\\r\n",
    "InterviewProcess": "The partnership schools will take part in a shortlisting process for each subject on offer in January.  This will lead to interviews being held across all of the schools by the end of January.\\r\n\\r\nFollowing this, there will be two parts to the selection process:\\r\n\\r\n* There will be an initial observation of a short teaching activity\\r\n* Successful candidates will be called back for a more formal interview and short written task\\r\n\\r\nApplicants who are successful at interview will be offered a conditional place. This is subject to the following:\\r\n\\r\n* Satisfactory references\\r\n* Satisfactory medical assessment\\r\n* Disclosure and Barring Service Check (DBS)\\r\n* National and Local Terms & Conditions of Employment.\\r\n",
    "OtherRequirements": "You must have 2 references.\\r\n\\r\nYou must have passed the English and Maths professional skills test before we can make a formal offer of a place on our training course.\\r\n",
    "PersonalQualities": "* Ability to work using own initiative and manage own work load\\r\n* Ability to combine work and study\\r\n* Ability to work co-operatively and effectively with colleagues\\r\n* Ability to build relationships with children that promote learning\\r\n* To have excellent verbal and written communication skills\\r\n* An interest in and enjoyment of working with children\\r\n* An ability to reflect on own practice and to listen and learn from guidance and from teaching and learning experiences\\r\n* An understanding of children’s needs\\r\n* An understanding of the professional boundaries related to child protection procedures\\r\n",
    "HowSchoolPlacementsWork": "You will be trained in schools which have finely developed systems in place to nurture development of the whole teacher and equip the trainee teacher with the 'tools of the trade'. \\r\n\\r\nEach successful trainee is placed in a school for the majority of the placement and the training will be provided by expert practitioners."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "At the West Essex School Direct Partnership, we believe that teaching is an exciting and rewarding profession. \\r\n\\r\nOur Partnership is based at and managed by the Lead School, Davenant Foundation School, in Loughton, Essex, and recruits for 18 secondary and 5 primary schools in the West Essex, Harlow and Chelmsford areas. All of our Partner schools are judged ‘Outstanding’ or ‘Good’ by Ofsted. Our unique blended learning programme combines school based training, on-line learning materials, a network of experienced subject specialists to deliver pedagogy, subject knowledge and off-site visits to special schools, primary schools and Leading Teacher days.  \\r\n\\r\nAll schools in our Partnership have a successful track record of working with trainee teachers  and university PGCE providers. Each school provides trainees with a fully trained mentor, supported by a Pathway Tutor (subject specialist) from TES Institute who visits each half-term to monitor progress and to “Quality Assure” our programme.  Our route has provided consistent employment for trainees within the Partnership on completion of their training. In the last 3 years, all of our trainees had been employed before the end of the course, the majority of these in the schools where they had trained.\\r\n \\r\nSuccessful applicants gain Qualified Teacher Status (QTS) and most choose to complete a PGCE.\\r\n\\r\nWe provide excellent role models from within the teaching staff and opportunities to observe ‘outstanding teaching’. Each school aspires to engender an ‘appetite for learning’ within its pupil community, both in the classroom and within the range of extra-curricular activities it provides.  \\r\n",
    "TrainWithDisability": "As the academic side of the programme is delivered through an online format, those with disabilities may find it to be a more accessible and flexible option. \\r\n\\r\nFor the in-school elements of the programme, disability access will vary depending on the school. Please check with the School Direct School that you are applying for a place with for details. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "TES Global offers a postgraduate teacher training programme, delivered in your chosen school through an online, virtual learning environment. \\r\n\\r\nAs well as school based training, our trainees benefit from a range of online benefits, including:\\r\n\\r\n* An individual training plan \\r\n* Subject knowledge enhancement \\r\n* An in-school mentor and specialist TES pathway tutor\\r\n* Onsite workshops \\r\n* 24/7 access to the virtual learning environment\\r\n* Live online lectures and tutorials \\r\n\\r\nTrainees are encouraged to study for the academic award of PGCE (validated by UEL) as well as the professional award of qualified teacher status (QTS), awarded by TES Institute. ",
        "UcasInstitutionCode": "H40"
      }
    ]
  },
  "has_inst": true
}
