{
  "locationType": "University",
  "accrediting": null,
  "provider": "University of East Anglia",
  "subjects": [
    "Languages",
    "Languages (european)",
    "Primary",
    "Spanish"
  ],
  "name": "Primary Specialising in Spanish",
  "slug": "E14/XR41",
  "providerCode": "E14",
  "programmeCode": "XR41",
  "schools": [
    {
      "name": "Main Site",
      "address": "University of East Anglia, Norwich, Norfolk, NR4 7TJ",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "University of East Anglia, Norwich, Norfolk, NR4 7TJ",
      "geocode": true,
      "formatted_address": "Norwich Research Park, Norwich NR4 7TJ, UK",
      "latitude": 52.6219215,
      "longitude": 1.2391761,
      "post_code": "NR4 7TJ",
      "city": "Norfolk",
      "route": null,
      "postal_town": "Norwich"
    }
  ],
  "providerAddress": {
    "inst_code": "E14",
    "addr_1": "University of East Anglia",
    "addr_2": "Norwich Research Park",
    "addr_3": "Norwich",
    "addr_4": "Norfolk",
    "postcode": "NR4 7TJ ",
    "url": "http://www.uea.ac.uk/education/pgce",
    "geocode": true,
    "formatted_address": "Norwich Research Park, Norwich NR4 7TJ, UK",
    "latitude": 52.6219215,
    "longitude": 1.2391761,
    "post_code": "NR4 7TJ",
    "city": "Norfolk",
    "route": null,
    "postal_town": "Norwich"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Fees currently published are for 2018 entry. 2019 entry fees will be confirmed shortly.",
    "AboutCourse": "Our 38-week, full-time PGCE Primary (specialising in Lower Key Stage 2 and Upper Key Stage 2 with Primary Languages - Spanish) programme will prepare you to become a general class teacher in the age range 5-11 years, with a specialism in teaching foreign languages.\\r\n\\r\nYou will undertake two school placements - one in Lower Key Stage 2 (Years 3 and 4) and the other in Upper Key Stage 2 (Years 5 and 6). In at least one of your school placements, you will practise and enhance your language teaching skills, as well as teaching across the rest of the curriculum. You’ll be working with children at this important stage to motivate, inspire and challenge them in their learning.\\r\n\\r\nUpon successful completion of your PGCE, you will graduate with Qualified Teacher Status (QTS) and 90 Master’s credits.\\r\n\\r\n[Find out more about this course](https://www2.uea.ac.uk/study/postgraduate/taught-degree/detail/pgce-primary-key-stage-1-and-lower-key-stage-2-with-primary-languages-spanish)",
    "CourseLength": "38 weeks",
    "Qualifications": "Prior to submitting your application, you will need:\\r\n* A GCSE pass at grade C or an equivalent qualification in English language, Mathematics and in a natural Science subject (ie Biology, Chemistry, Physics or a combination of these)\\r\n* An A level in Spanish (or equivalent)\\r\n* IELTS 6.5 or equivalent qualification, if first language is not English\\r\nPrior to beginning the course, you'll need a good honours degree or its equivalent. A degree classification of 2:2 or above is preferred. All degree subjects are considered.\\r\n\\r\nNB: Further degree requirements may apply. Find out more within our [Essential Information section](https://www2.uea.ac.uk/study/postgraduate/taught-degree/detail/pgce-primary-key-stage-1-and-lower-key-stage-2-with-primary-languages-spanish)",
    "FeeInternational": 19000.0,
    "FinancialSupport": "Find out more about the Financial Support available within our [Essential Information section](https://www2.uea.ac.uk/study/postgraduate/taught-degree/detail/pgce-primary-key-stage-1-and-lower-key-stage-2-with-primary-languages-spanish)",
    "InterviewProcess": "Interviews are part of the formal selection process. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\\r\n\\r\n* An introductory talk\\r\n* An individual interview\\r\n* A written task\\r\n\\r\nYou may also be asked to complete other relevant tasks such as:\\r\n\\r\n* Working with small groups of pupils\\r\n* Giving a presentation\\r\n* A group interview\\r\n* Literacy, numeracy and subject knowledge questions\\r\n",
    "OtherRequirements": "Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\\r\n\\r\nIf offered a place, prior to registration in September, all applicants will be required to:\\r\n\\r\n* Pass the [numeracy/literacy skills tests](https://getintoteaching.education.gov.uk/how-to-apply/passing-the-skills-tests)\\r\n* Obtain an Enhanced Criminal Records check from the [Disclosure and Barring Service](https://www.gov.uk/government/organisations/disclosure-and-barring-service) \\r\n* Complete a satisfactory [health check]( https://static.hobsons.co.uk/uea/usermedia/UG%20Admissions%20Email%20Templates/Linked%20documents/UEAOccHealthQ.pdf). All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach.\\r\n",
    "PersonalQualities": "Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\\r\n\\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.",
    "HowSchoolPlacementsWork": "UEA’s PGCE Primary programme places great emphasis on practical skills and the realities of classroom teaching.\\r\n\\r\nYou will be based in schools two-thirds of the 38-week programme (120 days). \\r\n\\r\nYou’ll gain experience from two main school placements and teach primarily in two age bands within your chosen age range specialism. The placements are in contrasting schools to give you a breadth of school-based experience. \\r\n\\r\nDuring the two extensive placements in our partnership schools, you’ll gain a broad range of practical teaching experience. You will learn to put ideas and theory into practice as you work in university and your placement schools."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "UEA is a top UK university with an international reputation for excellence in teaching and research. We're ranked among the top 200 universities in the world (Times Higher Education World University Rankings 2018). The 2019 Guardian University Guide ranked UEA 3rd in the UK for Education.\\r\n\\r\nThe School of Education and Lifelong Learning is internationally recognised for the quality of its educational research. Our research has made a difference in schools across the country, influencing approaches to managing classroom behaviour, understanding students' motivation, and creating effective communities for learning.\\r\n\\r\nAll of our PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. You'll be well-supported throughout your PGCE, both during your time on placement and on campus.\\r\n\\r\nImagine a career where you inspire, motivate, and unlock the full potential of those around you. Teaching is something that can truly make a difference.",
    "TrainWithDisability": "UEA operates an equal opportunities policy. Our Wellbeing Service offers a range of interventions including self-help resources, workshops and one-to-one appointments. \\r\n\\r\nIndividual needs are catered for and can be discussed through the interview process. \\r\n\\r\n[Find out more about the information and advice available](https://portal.uea.ac.uk/student-support-service/wellbeing)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
