{
  "locationType": "School",
  "accrediting": "Bishop's Stortford SCITT",
  "provider": "Bishop’s Stortford SCITT",
  "subjects": [
    "Biology",
    "Science",
    "Secondary"
  ],
  "name": "Biology",
  "financial_support": "Scholarship or Student finance if you’re eligible",
  "slug": "26T/2TBF",
  "providerCode": "26T",
  "programmeCode": "2TBF",
  "schools": [
    {
      "name": "Main Site",
      "address": "Cambridge Road, Sawbridgeworth, CM21 9BY",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Cambridge Road, Sawbridgeworth, CM21 9BY",
      "geocode": true,
      "formatted_address": "Sawbridgeworth CM21 9BY, UK",
      "latitude": 51.8208348,
      "longitude": 0.1493451,
      "post_code": "CM21 9BY",
      "city": "Hertfordshire",
      "route": null,
      "postal_town": "Sawbridgeworth"
    }
  ],
  "providerAddress": {
    "inst_code": "26T",
    "addr_1": "BSET SCITT",
    "addr_2": "Cambridge Road",
    "addr_3": "Sawbridgeworth",
    "addr_4": "Hertfordshire",
    "postcode": "CM21 9BY",
    "url": "http://BSETSCITT.co.uk",
    "geocode": true,
    "formatted_address": "Cambridge Rd, Sawbridgeworth CM21 9BU, UK",
    "latitude": 51.8198577,
    "longitude": 0.1503482,
    "post_code": "CM21 9BU",
    "city": "Hertfordshire",
    "route": "Cambridge Road",
    "postal_town": "Sawbridgeworth"
  },
  "options": [
    "QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 7500.0,
    "AboutCourse": "This course is offered for fee paying trainees only.\\r\n\\r\nTrainees will observe and teach across Key Stages 3 and 4, including experience of pupils in years 7 and 11. Observing or team teaching during thefirst few weeks. This may develop into a contact timetable of up to 40% of a full time teacher during the first placement school (approx.8 lessons), building up to 65% of a full time teacher during terms two and three (approx. 13 lessons). \\r\n\\r\nTrainees will work in your placement school Monday- Wednesday and Fridays. Thursdays are training days where trainees will join the other SCITT trainees at Leventhorpe and occasionally one of our Partner Schools.\\r\n\\r\nDuring the training year trainees will complete two assignments. The first focuses on the skills of medium term planning. It requires trainees to focus on the needs of their pupils and the way sequences of lessons need to be planned and evaluated for pupils to make the best possible progress. The second assignment focuses on the skills of action research and requires trainees to think about the needs of different groups of pupils within the classroom and how they might respond in different ways to learning activities.\\r\n\\r\nAssessment of trainees against the QTS standards will be overseen by the Training Manager, who will be supported by quality assurance through the External Moderator. \\r\n\\r\nJudgement and moderation will take place in late June of the training year. The External Moderator will attend Leventhorpe and visit some Trainees in their placement schools to observe the teaching of the standardisation sample of trainees.\\r\n\\r\nTrainees must meet the Teacher Standards at a minimum expectation and they will be graded a minimum, good or high standard. Grading will be made on a best fit basis for each of the 8 standards. There will be a number of sources of evidence used to assess Trainees against the Teacher Standards. These will be: Trainee Evidence Folder, lesson observation records, the academic assignments and school placement assessments (completed each term by the Teacher Mentor and Professional Tutor), as well as the Subject Mentor and Professional Studies Assessments.\\r\n\\r\nWe are a relatively new SCITT, in our 3rd year. Our two small cohorts of trainees over the past two years have all passed at Good (29%) or Outstanding (71%) level and have all secured teaching posts, many choosing to do so in one of our Partnership schools.\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "- GCSE English Language Grade C or above (or equivalent).\\r\n- GCSE mathematics Grade C or above (or equivalent).\\r\n- Professional Skills Tests\\r\n- A UK first degree (or equivalent).  Usually at least 50% should be in the subject you wish to teach.\\r\nIf your qualifications were not gained in the UK, please visit the National Academic Recognition Information Centre (NARIC) website to find out whether your qualifications are considered to be equivalent to UK GCSEs and degrees.\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n\\r\n ",
    "InterviewProcess": "We have a rigorous recruitment and selection process. Candidates will be interviewed by the SCITT Training Manager and a Headteacher for Primary, and Subject Lead for secondary. \\r\n\\r\nAs part of our interview process, candidates will be required to:\\r\n- Present on an engaging aspect of their subject\\r\n- Meet with a panel of students\\r\n- Attend a panel Interview\\r\n- Complete a written task\\r\n\\r\nCandidates who are choosing to undertake Teacher Training in a subject different to their degree course, may be asked to complete a subject knowledge test. \\r\n\\r\nCandidates will be informed of the outcome of their interview on the same day. ",
    "OtherRequirements": "At BSET safeguarding of children is our first concern and so in addition to DBS checks we reserve the right to make additional checks of former employers. \\r\n\\r\nWe do not make school experience a condition for application but it is a good idea to have recent experience of a school setting so please contact us if we can help you arrange this.\\r\n\\r\nExperience of working in a school or with young people is an advantage but not essential for applications to the fee paying route.\\r\n\\r\n",
    "HowSchoolPlacementsWork": "The BSET SCITT Partnership currently comprises six secondary school and three primary schools. In addition, we also work with a number of placement schools. All of these schools at present are within the Sawbridgeworth- Bishop’s Stortford region. Our aim is to spot and nurture the outstanding teachers of the future, giving them the best possible training and support in their early career.  Our training is led exclusively by serving practitioners in our family of schools and training takes place entirely in school settings.Trainees will spend both their placements in local schools, where they will be supported by Teacher Mentors in each school.\\r\n\\r\nFee-paying trainees spend one term in their first placement school and two terms in their second school. We will always try to accommodate trainees’ preferences when making decisions about placement schools.\\r\n\\r\nTrainees must gain experience in two consecutive age ranges. This depends on the age range applicable to the subject in which you are training to teach. For those subjects in the secondary age range 11-16, trainees will teach across Key Stages 3 and 4, Year 7-11.\\r\n\\r\nFor those subjects in the secondary age range 14-19, trainees will teach across Key stages 4 and 5, Years 10-13). In addition, trainees may be given the opportunity to teach outside of the age ranges for which they are being trained."
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "We are a partnership of schools in the Bishop's Stortford, Sawbridgeworth and Harlow area who collaborate to provide teacher training for graduates who would like to teach in either the primary or secondary schools.\\r\n\\r\nOur aim is to spot and nurture the outstanding teachers of the future, giving them the best possible training and support in their early career.  Our training is led exclusively by serving practitioners in our family of schools and training takes place entirely in school settings.\\r\n\\r\nWe offer training in the a wide range of secondary school subjects and primary age groups leading to Qualified Teacher Status (QTS).  Our training pathways are tailor made, with salaried and fee-paying options to gain QTS and the possibility of gaining experience in a second subject area to improve employability. \\r\n\\r\nYou can depend on the best support in BSET schools. Training is hard work and you will need the support of an excellent mentor. All of our mentors are excellent practitioners and they are very experienced as we are used to working with over fifty teacher trainees every year. \\r\n\\r\nYou will also get to work with fantastic, positive young people - our area is culturally diverse and educational aspirations are high amongst young people and their parents. \\r\n\\r\nWe welcome visits during the school day, so why not contact us and see these fantastic young people as they learn.\\r\n\\r\nVisit our website for further details -[http://www.bsetscitt.co.uk/]\\r\n\\r\n",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
