{
  "locationType": "School",
  "accrediting": "University of Hertfordshire",
  "provider": "Parmiter’s School",
  "subjects": [
    "Art / art & design",
    "Secondary"
  ],
  "name": "Art and Design",
  "slug": "1D5/2YS8",
  "providerCode": "1D5",
  "programmeCode": "2YS8",
  "schools": [
    {
      "name": "Main Site",
      "address": "High Elms Lane, Garston, Watford, WD25 0UU",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "High Elms Lane, Garston, Watford, WD25 0UU",
      "geocode": true,
      "formatted_address": "High Elms Ln, Watford WD25 0JS, UK",
      "latitude": 51.7027416,
      "longitude": -0.3916026,
      "post_code": "WD25 0JS",
      "city": "Hertfordshire",
      "route": "High Elms Lane",
      "postal_town": "Watford"
    }
  ],
  "providerAddress": {
    "inst_code": "1D5",
    "addr_1": "Parmiter's School",
    "addr_2": "High Elms Lane",
    "addr_3": "Garston",
    "addr_4": "Watford",
    "postcode": "WD25 0UU",
    "url": "http://www.parmiters.herts.sch.uk",
    "geocode": true,
    "formatted_address": "High Elms Ln, Watford WD25 0UU, UK",
    "latitude": 51.7030548,
    "longitude": -0.3892004,
    "post_code": "WD25 0UU",
    "city": "Hertfordshire",
    "route": "High Elms Lane",
    "postal_town": "Watford"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "CourseLength": "OneYear",
    "Qualifications": "\\r\n* GCSE in Mathematics, English and Science (Primary General only) at     Grade 4/C. \\r\n* First degree of a United Kingdom higher education institution or equivalent qualification, classification 2.2 or above preferred. Overseas qualifications must be verified by NARIC. \\r\n",
    "InterviewProcess": "The selection process requires candidates to  \\r\n* teach a lesson (topic provided in advance)\\r\n* subject knowledge interview\\r\n* 45 minute written English task\\r\n* panel interview \\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The Herts and Bucks Teaching School Alliance has considerable experience of training teachers and recognises and values the enthusiastic contribution that they make to our school communities. The lead schools, Parmiter's School (Hertfordshire schools) and Dr Challoner's High School (Buckinghamshire schools) offer School Direct salaried and unsalaried teacher training routes across the full range of curriculum subjects. The training programme is structured to allow trainees to develop the skills required by teachers to teach the subject that they are training  in and to develop specific expertise for making a distinctive contribution to practise in their settings. A subject mentor directs the development of subject knowledge for teaching in school settings. All schools within the TSA employ a Professional Mentor to oversee and quality assure the provision of training within the school. The programme enables trainees to have a clear understanding of learning theories and child development and how this impacts on student learning and informs their own development as a teacher. Trainees will have the opportunity to spend time in one of the other partnership schools to ensure a contrasting and comprehensive experience. As well as first class mentoring in school, trainees will participate in three full-day conferences and shared professional studies sessions. Bespoke training in behaviour management is provided.These will enhance learning and professional development as well as providing a valuable opportunity to forge relationships beyond their immediate context. Feedback from trainees is extremely positive with all trainees securing  Newly Qualified Teaching roles for the following academic year. ",
    "TrainWithDisability": "Training to be a teacher can be very rewarding, but also tiring and, at times, frustrating.  We are here to assist trainees through both the \"peaks and troughs\" of their school placements and hope that the experience is enjoyable, professionally satisfying and personally fulfilling. \\r\n\\r\nSchools within The Herts and Bucks TSA are committed to making reasonable adjustments for disabled staff and \\r\nto ensure that the needs of disabled staff are accommodated in the school environment, as far as is reasonably practical. \\r\n\\r\n\\r\nThroughout the trainee’s time at school the subject mentor will provide professional support and guidance and will have weekly scheduled meetings with the trainee.  This process will be overseen by the professional mentor.  In addition to the more formal aspects of the training, however, it is hoped that the trainee will regard both the mentor and the professional mentor as  confidantes and that he or she will be able to turn to both should difficulties arise.  \\r\n\\r\nPlease contact the lead schools for further advice and guidance on an individual basis. \\r\n",
    "AccreditingProviderEnrichments": [
      {
        "Description": "We are committed to the concept that the most effective teacher training takes place through close co-operation between the training institution and the school, whereby the student benefits from the expertise of practising teachers and at the same time receives the necessary theoretical training.  Close links have been forged with our accredited training provider, The University of Hertfordshire. The university is a leading regional provider of Initial Teacher Education (ITE) and consistently high achieving in it's Ofsted inspections and in the Guardian and Times League tables. ",
        "UcasInstitutionCode": "H36"
      }
    ]
  },
  "has_inst": true
}
