{
  "locationType": "School",
  "accrediting": "University of Exeter",
  "provider": "JCTSA",
  "subjects": [
    "Physics",
    "Science",
    "Secondary"
  ],
  "name": "Physics",
  "financial_support": "Student finance if you’re eligible",
  "slug": "172/2D9G",
  "providerCode": "172",
  "programmeCode": "2D9G",
  "schools": [
    {
      "name": "Axe Valley Community College",
      "address": "Chard Street, Axminster, EX13 5EA",
      "code": "E"
    },
    {
      "name": "Holyrood Academy",
      "address": "Zemard Lane, Chard, TA20 1JL",
      "code": "K"
    }
  ],
  "addresses": [
    {
      "address": "Chard Street, Axminster, EX13 5EA",
      "geocode": true,
      "formatted_address": "Chard St, Axminster EX13 5EA, UK",
      "latitude": 50.7836564,
      "longitude": -2.9954868,
      "post_code": "EX13 5EA",
      "city": "Devon",
      "route": "Chard Street",
      "postal_town": "Axminster"
    },
    {
      "address": "Zemard Lane, Chard, TA20 1JL",
      "geocode": true,
      "formatted_address": "Chard TA20 1JL, UK",
      "latitude": 50.8760124,
      "longitude": -2.9654842,
      "post_code": "TA20 1JL",
      "city": "Somerset",
      "route": null,
      "postal_town": "Chard"
    }
  ],
  "providerAddress": null,
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "The programme has three fully integrated components:\\r\n*Secondary Education and Professional Studies Module\\r\nThe Professional Studies component introduces you to key educational ideas and principles within a range of educational contexts. The module is followed throughout the year with both University and school-based elements and is concerned with classroom issues, whole school issues and the role of education in the wider society.\\r\n\\r\n*Secondary Professional Learning Module\\r\nCentral to school-based work is the development of your ability to meet the standards of professional competence which trainees must demonstrate in order to meet national standards for the award of QTS.\\r\n\\r\n*Secondary Physics Subject Knowledge and Pedagogy module\\r\nThe principal aims of the module are to equip students with a comprehensive understanding of the background issues and practice of the current teaching of Science and Physics in the secondary school, in order to meet national standards for the award of QTS.\\r\n\\r\nAssessment is through University and school-based assignments. There are no formal exams.There are two main assessment strands:\\r\n\\r\n1. Assessment of the Standards relating to professional attributes, knowledge, understanding and skills that need to be reached in order to be awarded Qualified Teacher Status (QTS).\\r\n\\r\nThis strand runs through the whole programme as students gradually develop the expertise needed to achieve the Standards required. Formative Reports are used to identify areas of strength and to construct individualised action plans in areas where further development is required. The final Summative Report, which records either 'pass' or 'fail', is completed towards the end of the second school placement during the summer term.\\r\n\\r\n2. Assessment at Masters level to gain the PGCE.\\r\nStudents are required to complete three 5,000 word (or equivalent) assignments related to the teaching and learning of science. The first focuses on the nature and purpose of science education and the development of the understanding of a particular aspect of science education. This is completed during the first, university based, term. The second is completed whilst on the first school placement during the spring term. It involves carrying out an  Action Research Project or a Case Study.\\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "* A good degree with at least 50% of the content related to physics, e.g. engineering or astronomy. Equivalent or alternative qualifications are always considered. \\r\n* Good GCSE grades in ‘double science’ or in each of the three separate science subjects. \\r\n* A good ‘A’ level grade in physics and ideally in another science subject.  Where necessary applicants may be required to complete some subject enhancement before joining the course.\\r\n*GCSE English and maths at grade C+/4+",
    "InterviewProcess": "Interviews will take place in the home school. You will be interviewed by the head of department, a member of the leadership team and a teacher with responsibility for initial teacher training. Before the interview day, but as part of the interview process, you will be expected to arrange a visit to the school. On the interview day itself you will be asked to observe a lesson and discuss what you notice and you will be asked to work with a small group of students for part of a lesson, supporting them through an activity prepared by their teacher.",
    "HowSchoolPlacementsWork": "\\r\nJCTSA schools decide on an individual basis in which subjects they wish to offer training. This means that you are applying to a specific school to study your subject. Your contrasting school experience will be as close as possible to your home school but you will need access to a car.\\r\n\\r\nThere are two school placements. The majority of your in-school experience is done in your home school. This is the school to which you applied for your place. In addition there will be a six-week placement to a contrasting school. \\r\n\\r\nThe majority of our schools are 11-18 and are judged as good or outstanding. They are all rural and are located in West Dorset, Chard and in South East Devon. \\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Woodroffe is the lead school in a large alliance of secondary and primary schools. We are an outstanding school, as are a number of our partner schools. Woodroffe is all a regional maths hub, providing specialist maths support to teachers across Dorset and parts of Devon. The Jurassic Coast teaching School Alliance has many years of experience in delivering teacher training programmes, working with The University of Exeter who have been judged by Ofsted as outstanding providers of initial teacher education.",
    "TrainWithDisability": "Our practice with regard to students with disabilities and other needs is in line with that of The University of Exeter.   \\r\n(https://search.exeter.ac.uk/s/redirect?collection=all-exeter-uni&url=http%3A%2F%2Fwww.exeter.ac.uk%2Fmedia%2Funiversityofexeter%2Fcollegeofsocialsciencesandinternationalstudies%2Feducation%2Fpgce%2Fdocuments%2FITE_Fitness_to_Teach_and_Disability_Support_procedure_2018.doc&index_url=http%3A%2F%2Fwww.exeter.ac.uk%2Fmedia%2Funiversityofexeter%2Fcollegeofsocialsciencesandinternationalstudies%2Feducation%2Fpgce%2Fdocuments%2FITE_Fitness_to_Teach_and_Disability_Support_procedure_2018.doc&auth=VvL%2Bz4sSTtW8bG5yJ1304g&profile=_default&rank=1&query=fitness+to+teach)",
    "AccreditingProviderEnrichments": [
      {
        "Description": "",
        "UcasInstitutionCode": "E84"
      }
    ]
  },
  "has_inst": true
}
