{
  "locationType": "School",
  "accrediting": "The University of Huddersfield",
  "provider": "Trinity TSA",
  "subjects": [
    "Primary"
  ],
  "name": "Primary",
  "financial_support": "Student finance if you’re eligible",
  "slug": "1YF/2QL9",
  "providerCode": "1YF",
  "programmeCode": "2QL9",
  "schools": [
    {
      "name": "Main Site",
      "address": "Shay Lane, Halifax, West Yorkshire, HX2 9TZ",
      "code": "-"
    }
  ],
  "addresses": [
    {
      "address": "Shay Lane, Halifax, West Yorkshire, HX2 9TZ",
      "geocode": true,
      "formatted_address": "Shay Ln, Halifax HX3 6QU, UK",
      "latitude": 53.7483096,
      "longitude": -1.8770284,
      "post_code": "HX3 6QU",
      "city": "West Yorkshire",
      "route": "Shay Lane",
      "postal_town": "Halifax"
    }
  ],
  "providerAddress": {
    "inst_code": "1YF",
    "addr_1": "Trinity Teaching School Alliance",
    "addr_2": "c/o The Maltings College",
    "addr_3": "Maltings Road",
    "addr_4": "Halifax",
    "postcode": "HX2 0TJ ",
    "url": "http://www.trinitytraintoteach.co.uk",
    "geocode": true,
    "formatted_address": "Maltings Rd, Halifax HX2 0TJ, UK",
    "latitude": 53.7379367,
    "longitude": -1.9008984,
    "post_code": "HX2 0TJ",
    "city": "West Yorkshire",
    "route": "Maltings Road",
    "postal_town": "Halifax"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "AboutCourse": "Our School Direct programme allows you to qualify as a primary teacher within one year. You will gain a PGCE, QTS and 90 Masters credits. It is school-led, which means that the majority of your training is based in school. You will experience a full school year, and be immersed in daily life from the day you arrive in September. In doing so, you will have the opportunity to experience teaching as it really is, whilst working alongside, and being mentored by, outstanding practitioners. \\r\nYou'll develop your knowledge of National Curriculum subjects in the primary curriculum with a focus on teaching and learning in the Early Years, Key Stage 1 and Key Stage 2. \\r\n\\r\nCourse Structure\\r\nThe course is a one year postgraduate certificate in primary education (3-11). You'll gain a comprehensive knowledge of the core subjects and the full breadth of the National Curriculum. You will gain a deep understanding of key aspects of teaching including how young people learn, behaviour management, assessment, and creative, innovative methods of teaching and learning. You'll research theories of child development, gain a greater understanding of current professional issues in primary education and develop your own educational philosophy.\\r\n\\r\nTeaching and Assessment\\r\nYour training will incorporate school based practice with weekly professional learning delivered by Huddersfield University and excellent practitioners from within the alliance. Professional learning will take place in our well equipped primary training classroom at The Maltings College in Halifax. At the training centre you will work with a group of trainees from other Trinity Teaching School Alliance schools, which will allow you time to collaborate, share good practice and engage in peer support. You will spend the majority of your training year in one school, but will also complete an alternative placement in a contrasting alliance school, where you will have the opportunity to experience a different setting. \\r\n\\r\nOur School Direct programme offers the highest quality training in a supportive, learning rich environment. You'll learn in small, friendly and collaborative groups, designed to give you the confidence to succeed. \\r\n\\r\nModules: \\r\nCore Curriculum Studies in Early Years and Primary Education \\r\nInclusion, Equality and Diversity \\r\nThe Wider Curriculum in Early Years and Primary Education \\r\nDeveloping Critical Professional Practice \\r\n\\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence. ",
    "CourseLength": "OneYear",
    "InterviewProcess": "The Trinity Teaching School Alliance and Huddersfield University partnership have a rigorous recruitment and selection procedure. We select our trainee teachers not only against academic criteria, but also on their passion for teaching all learners, excellent subject knowledge and whether they have the aspiration and drive to be an outstanding and inspirational teacher in and out of the classroom. \\r\nYou will be shortlisted for interview based on your application. The interview process typically lasts for a day. The following selection procedures are designed to assess your suitability for training to teach: \\r\n- panel interview with members of the alliance. \\r\n- teach a 10 minute literacy or numeracy session to a class of children in one of our partnership schools \\r\n- literacy tests to evaluate your ability to communicate clearly and accurately \\r\n- a maths test to evaluate your grasp of basic numeracy skills \\r\nFrom this process we will see whether you have the passion, drive and skills to train to teach in one year. ",
    "HowSchoolPlacementsWork": "Our provision is growing, and we are now partnered with a wide range of schools across the region. You will spend the majority of your training year in one school, but will also complete a short alternative placement in a contrasting alliance school where you will have the opportunity to further develop your teaching skills. In addition, you will gain experience working within schools with specialist provision, such as a special school or PRU, as well as within a secondary school. You will undertake your placements in two consecutive key stages; Early Years and Key Stage 1, or Key Stage 1 and Key Stage 2. During your first placement, you will work under the guidance of the class teacher to build your confidence and develop essential planning, teaching and behaviour management skills. As your placement progresses, you will begin to take more ownership of learning. Your second placement provides an alternate experience where you will further develop your classroom skills. It is an opportunity to challenge yourself within a contrasting setting and it allows you to build new networks. After Easter, you will return to Placement A, where you will consolidate your practice and build your teaching commitment, preparing yourself for progressing into your NQT year. \\r\n \\r\n\\r\n"
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "Trinity Teaching School Alliance and Huddersfield University have developed an innovative school-led teacher training programme for School Direct 2019. We are a large alliance of over 45 schools across West Yorkshire, offering rich opportunities for trainees to access the highest quality training in a diverse range of establishments including academies, church schools, schools with 6th forms, primary schools with early years provision, grammar schools, and schools with dedicated special needs provision. \\r\n\\r\nOur School Direct programme has been created in partnership with  leading practitioners from both the University and across the alliance, as well as subject specialists from our sister organisation White Rose Maths. We ensure a collaborative approach between all partners, led and quality assured by a team of experienced senior leaders, dedicated to providing \\r\nthe very best training experience for our School Direct students. We  have a strong focus on ensuring that our trainees are fully supported to develop their knowledge, skills and professional attributes in order to become outstanding and inspirational teachers. \\r\n\\r\nA world-class education system requires world-class teachers and this unique programme sets out to address this challenge. Trinity Academy Halifax is the lead school - graded outstanding in all areas. As the Teaching School Alliance within Trinity MAT, we are dedicated to developing the teachers and educational leaders of the future. Staff are able to access quality CPD programmes, designed to ensure our outstanding teachers also have the opportunity to develop into outstanding leaders.",
    "TrainWithDisability": "We offer disabled access across the Alliance and recommend applicants to discuss their individual needs with us so that we can place you in the most appropriate school for your training year. ",
    "AccreditingProviderEnrichments": [
      {
        "Description": "Huddersfield University have been developing great teachers since 1947. Today, the School of Education and Professional Development is a Centre for Excellence in Teacher Training (CETT) and in 2017, were recognised as a Gold Rated university by the Teacher Excellence Framework (TEF). The Research Excellence Framework (REF), deemed an impressive 94% of research to be world class or of international significance. Ranked top five in the Guardian Guide for Education for the sixth year running, every year Huddersfield train over 1,200 teachers combining the latest research, cutting-edge teaching practice, ensuring graduates are equipped with the most relevant and up-to-date skills.",
        "UcasInstitutionCode": "H60"
      }
    ]
  },
  "has_inst": true
}
