{
  "locationType": "University",
  "accrediting": null,
  "provider": "Roehampton University",
  "subjects": [
    "Geography",
    "Secondary"
  ],
  "name": "Geography",
  "financial_support": "Student finance if you’re eligible",
  "slug": "R48/F1X8",
  "providerCode": "R48",
  "programmeCode": "F1X8",
  "schools": [
    {
      "name": "Main Site",
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "code": ""
    }
  ],
  "addresses": [
    {
      "address": "Roehampton University, Roehampton Lane, London, SW15 5PU",
      "geocode": true,
      "formatted_address": "Roehampton Ln, London SW15 5PU, UK",
      "latitude": 51.4579866,
      "longitude": -0.2432869,
      "post_code": "SW15 5PU",
      "city": "Greater London",
      "route": "Roehampton Lane",
      "postal_town": "London"
    }
  ],
  "providerAddress": {
    "inst_code": "R48",
    "addr_1": "Roehampton Lane",
    "addr_2": "London",
    "addr_3": null,
    "addr_4": null,
    "postcode": "SW15 5PU",
    "url": "http://www.roehampton.ac.uk",
    "geocode": true,
    "formatted_address": "Roehampton Ln, London SW15 5LS, UK",
    "latitude": 51.4554361,
    "longitude": -0.2431242,
    "post_code": "SW15 5LS",
    "city": "Greater London",
    "route": "Roehampton Lane",
    "postal_town": "London"
  },
  "options": [
    "PGCE with QTS, full time"
  ],
  "enrichment": {
    "FeeUkEu": 9250.0,
    "FeeDetails": "Tuition fees for the 2019/20 academic year are yet to be confirmed.\\r\n\\r\nAs an indication of what you might pay, the fee for students who started in September 2018 was:\\r\n•\\t£9,250\\r\n\\r\nPGCE students can apply for loans from Student Finance England and may be entitled to a tax-free bursary -https://getintoteaching.education.gov.uk/funding-and-salary/overview\\r\n\\r\nFind out more about scholarships and funding on our website - https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts\\r\n\\r\n",
    "AboutCourse": "Student teachers within the Citizenship, Geography, RE and History subject specialisms are taught as a PGCE Humanities group. You will have specialist inputs on your chosen subject and also gain experience of issues in planning and teaching cross-curricular work within the Humanities. Your two school placements are in your specialist subjects.\\r\n\\r\nGeography is facing many challenges within the present education system. It is an exciting and relevant subject which plays a major role in helping children to develop a better understanding of the increasingly complex world around them.\\r\n\\r\nPGCE Secondary Geography aims to:\\r\n\\r\n•Broaden and deepen your knowledge and understanding of Geography for teaching purposes; \\r\n\\r\n•Provide you with an informed and critical view of National Curriculum, CSE, A level and relevant vocational requirements; \\r\n\\r\n•Raise awareness and provide experience of a broad range of learning and teaching strategies; \\r\n\\r\n•Develop your skills in classroom management, planning, communication, assessment, recording and evaluation; \\r\n\\r\n•Understand the differing needs of those with learning difficulties and very able students; and\\r\n\\r\n•Raise your awareness of a wide range of assessment strategies\\r\n\\r\nThe Geography subject specialism will run throughout the academic year and will cover a variety of areas including:\\r\n•Planning and curriculum in Geography\\r\n\\r\n•Approaches to student learning\\r\n\\r\n•Thinking skills\\r\n\\r\n•Enquiry based learning\\r\n\\r\n•Fieldwork\\r\n\\r\n•ICT and Geography, including the use of GIS\\r\n\\r\n•Creative approaches to learning\\r\n\\r\n•Debates concerning the links between school and university geographies\\r\n\\r\nWhere possible progress of students in teaching and learning skills and understanding will in part be developed through the creation of curriculum ideas and resources with external partners (eg Afghan Action) for wider use by the geographical educational community as well as on teaching placement.\\r\n\\r\n\\r\nGeography students will form part of a Humanities subject group along with History, RE and Social Science for generic sessions. There will also be a programme of Geography subject enhancement sessions. This approach recognises the need for flexibility and adaptability required of the Humanities based teacher. \\r\n\\r\nContinuous assessment is used throughout the course.  There are no examinations.\\r\n\\r\nApplications are welcome from students with good/very good qualifications in their Geography qualifications at GCSE and AS/A level (or equivalent) and at honours degree level. \\r\n\\r\nApplications are also welcome from students with a Joint or Combined Honours degree in which Geography is one of the major subjects. \\r\nStudents with related degrees such as Geology or Environmental Studies may also apply. \\r\n\\r\nA good A level Geography qualification would be viewed very positively. \\r\n\\r\n",
    "CourseLength": "OneYear",
    "Qualifications": "•\\t2:1 degree for English, Geography, History or Social Science\\r\n•\\t2:2 degree for Mathematics, MFL, Sciences or RE\\r\n(We may, under exceptional circumstances, accept a Third if there are \\r\nother very strong recommending features in your application.)\\r\n\\r\n•\\tGCSE Grade 4 (old grade C) or above in English Language and Maths (equivalency test available if needed)\\r\n\\r\n•\\tA-levels (or equivalent) in relevant subjects\\r\n\\r\n•\\tAlthough not essential, you may find it useful to have recent experience working with children and/or observing teaching in a school setting.\\r\n\\r\n•\\tA pass in the Professional Skills Tests in literacy and numeracy\\r\n",
    "FeeInternational": 15405.0,
    "InterviewProcess": "If invited for interview, you will meet members of the course team who will give an overview of the course and answer any questions you may have. \\r\n\\r\nYou will participate in a group task with candidates from a range of subjects and give a brief presentation as part of a small group. \\r\n\\r\nSubject tutors will introduce a written subject task that you will complete during the day and you will have an individual interview with a subject tutor. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.",
    "OtherRequirements": "Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\\r\n\\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\\r\n\\r\nEnglish Language Requirements - you must have a GCSE Grade 4 (old grade C) in English Language. \\r\n\\r\nWe offer an equivalency test in English and/or Mathematics for any successful applicant who does not hold this qualification or an equivalent one.  \\r\n",
    "PersonalQualities": "You should be able to demonstrate a genuine interest in and enthusiasm for Geography at interview. \\r\n\\r\nApplicants without Geography as a major subject would be expected to undertake essential background reading before the start of the course. \\r\n\\r\nThe Secondary PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills also include the ability to form relationships,  good communication skills, a commitment to learning and teaching and reflective qualities. \\r\n\\r\n",
    "HowSchoolPlacementsWork": "You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with learners from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\\r\n\\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\\r\nPhase A.  In planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \\r\n\\r\nPhase A\\r\nAfter induction you will spend about 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you. \\r\n\\r\nPhase B\\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  "
  },
  "has_enrichment": true,
  "inst": {
    "TrainWithUs": "The School of Education at Roehampton is one of the principal providers of teacher training in the UK, with partnerships with over 350 schools. We have a rich history of over 175 years providing teacher training education through our four Colleges. \\r\n\\r\nAs a student in our School, you will enjoy high quality teaching, which will equip you for a successful career with a competitive starting salary. Your employment prospects will be excellent: 99% of our teacher training graduates are in work or further study six months after leaving us (Destinations of Leavers of Higher Education 2013/14). \\r\n\\r\nWe are based on a beautiful parkland campus in south-west London, close to Putney and Hammersmith, and just 30 minutes from the West End. Our School is ranked third in London for the quality of our research in the field of education (Research Excellence Framework 2014), reflecting the work-class expertise of our staff.\\r\n\\r\nFor more information about the university, please see here.\\r\n\\r\n(https://www.roehampton.ac.uk/why-roehampton/)",
    "TrainWithDisability": "The University of Roehampton welcomes students with disabilities and offers flexible support services tailored to your needs. Our Disability and Dyslexia Services are on the main campus, Digby Stuart, along with our Access Centre: Access@SW15.\\r\n\\r\nFor new students, we strongly recommend that you get in touch to let us know about your specific disability and support needs. Any information provided will be kept strictly confidential and will only be used to support you with your studies. \\r\n\\r\nWe recommend to inform us of your specific learning difference (SpLDs) such as Dyslexia, Dyspraxia, Dyscalculia and Attention Deficit Hyperactivity Disorder (ADHD).\\r\n\\r\nFor more information please see our disability services website here.\\r\n\\r\n(https://www.roehampton.ac.uk/disability-services/)",
    "AccreditingProviderEnrichments": [

    ]
  },
  "has_inst": true
}
